{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "17",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          1.9202696741525598,
          1.9380573888942403,
          1.123921329593654,
          -0.44210439738137036,
          0.3670385220983367,
          0.4425606253453527,
          -0.9102601537866724,
          0.5574944145912708,
          0.71110031221206,
          -0.3919218401656318,
          -2.138342583499188,
          -0.49974319004675677,
          -0.477270131968105,
          -0.039224110394565984,
          -1.7954752186341605,
          1.1773979561665595,
          0.7469094233015622,
          0.7801958542416155,
          0.524192186879561,
          0.8189754940438252,
          2.0396789610126262,
          -0.24293922580838284,
          -0.5639582477850901,
          -1.2058098047536419,
          0.19773459549799918,
          -0.8377974978790165,
          -1.116065644923472,
          -0.04204997523800769,
          0.46877699689690006,
          -2.3476363566729823,
          1.8163338105246598,
          -2.506512898897232,
          -0.14912727016371272,
          0.7374701485298176,
          2.601488011796665,
          0.512555244436692,
          -0.8641430763348631,
          0.4272937116557977,
          -0.8524692136388091,
          0.6848308838627931,
          -0.5880103007661523,
          -0.05601609923538003,
          0.44624197736856747,
          0.37781775324519024,
          3.275865961360521,
          -0.6882899282220583,
          0.11920971146998716,
          0.23775883852627097,
          -0.5169344218892097,
          -0.8382888082189651,
          1.1957764698820275,
          2.1570653066620458,
          2.463371611874448,
          0.6695297861892925,
          0.36392922662859717,
          0.9502520425425447,
          -2.2841730106008704,
          -1.066380985004936,
          -1.255575455763803,
          -0.3360230476352964,
          -0.3170828058371527,
          0.21012024399155327,
          0.042680352171284526,
          -2.3435289819640763,
          -0.6555031523211738,
          1.2664131902336915,
          -0.4341205438643824,
          1.0727104741895632,
          -1.5133698133469733,
          0.12735652501348083,
          0.3516814882273649,
          -2.6341354773972676,
          -1.4492050183400267,
          -0.6518507133186326,
          0.17700484951298467,
          -0.1931984136740393,
          -0.7803364785075053,
          -0.18901943718484704,
          -2.5039267214812964,
          1.166157275060588,
          0.06848520771881995,
          -0.4436750334144462,
          -1.026590364712737,
          -1.5416797177405905,
          1.5698130901686003,
          -0.8621857591170617,
          1.6233081239077751,
          0.23058375221203406,
          3.563462468460915e-05,
          -0.24183188683627274,
          -1.6501759891407164,
          0.5677288782086919,
          -0.03511611295844906,
          -0.4547697986294896,
          1.7145457438494407,
          -1.0174524720032403,
          -0.051432736690597336,
          -0.6070500955837513,
          -0.7325653726266238,
          -0.6403324363331588,
          -1.1492988128182031,
          0.9308689838738436,
          -0.06631741040080863,
          1.9348315574390356,
          0.3780379595089845,
          -0.9132364389288112,
          0.2988533596351156,
          -1.0540762112969913,
          0.742329744611965,
          0.06300911863487468,
          0.20059655333593407,
          2.771968561137849,
          1.245506094204195,
          0.3765603087122044,
          2.2480582109320655,
          0.8013927304187851,
          1.432299652467929,
          -2.609575344173062,
          -1.3827027809835888,
          1.0944640847586409,
          0.5518685526465861,
          -0.41140658202870634,
          1.2707126447109556,
          -1.6780341730937292,
          -1.6555894232504762,
          1.2584161567786964,
          1.67599866691207,
          -0.027668494768012863,
          1.4936104778372499,
          0.21961969572878903,
          -1.4261649599761825,
          1.34790048588314,
          -0.20638306861936823,
          0.26609515278123436,
          2.170425666436444,
          -3.191474858867412,
          0.10397096031167966,
          0.40515161378664694,
          -0.0764222089099953,
          -1.1793635028755363,
          -0.12506392011368228,
          -0.4224026501503732,
          -0.516223220973639,
          -0.6365666768748326,
          -0.3174034887787464,
          -1.2812237313870973,
          -0.31467239798301866,
          0.5076396491663577,
          -0.27189145301888457,
          -0.0395713352343251,
          0.8529169327023985,
          0.15227765222861606,
          0.2596001997534967,
          2.1998513581248216,
          1.6875292692943893,
          0.602502547515049,
          0.35503043204163115,
          -0.31067598079937686,
          -2.119158923973051,
          -1.6999237124194657,
          0.6306918565390724,
          1.9914599914508098,
          2.7012004230364965,
          3.118185224464487,
          -1.6925598198199794,
          -2.5463263142095225,
          -1.0450574511189088,
          1.910930272011359,
          -1.2249599551801862,
          0.6109165908362102,
          -0.12330923235695215,
          -0.02225635927490264,
          2.723367247152742,
          -1.6334840031722917,
          0.7030750926995567,
          -1.421461492657704,
          -0.5476094541815542,
          -0.15215514971509309,
          0.7265307218672686,
          0.10027584493060054,
          0.07875347918252036,
          0.5497631658515987,
          -0.09929161039876276,
          0.09327590856502169,
          -1.629983247587286,
          -0.200155426041061,
          0.7416337375715449,
          0.3005741429662681,
          2.633510461944091,
          -1.0597552154323937,
          -2.163318080211818,
          1.6889746143587998,
          2.512359559363766,
          0.10250410056408145,
          0.027415479873182175,
          -0.3309341474001036,
          1.4068753138046568,
          2.1669438591118078,
          0.5458033403999824,
          1.020692440834897,
          -1.7346161645059932,
          -3.0636913105821066,
          1.4910972578397024,
          0.839864394998858,
          0.8394717122980094,
          -1.7384504497325082,
          -2.463956046937925,
          1.0092341486595195,
          -2.454809301770485,
          0.16158248292539307,
          -0.9578738909867787,
          0.7303676529071653,
          -1.514366560470104,
          0.7404194148321603,
          -0.8367130510056723,
          -1.5758484611613417,
          -1.3889172059084378,
          -0.5182144458559611,
          -0.672222079799215,
          -0.6585241733375188,
          -0.9119134114988934,
          0.13224876365143884,
          -0.1864515570546651,
          -1.545112885603861,
          0.8328034571155527,
          1.461122184219474,
          0.771370289586277,
          -2.523205578961399,
          0.1090722467480764,
          -0.018185424389882042,
          1.564546398330846,
          0.4589738081582368,
          1.138012901055088,
          2.0058616453022653,
          -1.0821223962115885,
          -0.02294584681792795,
          -0.8938262063199125,
          0.14899115381047903,
          0.9555879928962451,
          -0.3083882340974366,
          2.5904700270229664,
          -0.8490637670400653,
          0.3690809087333652,
          -0.32075946260377874,
          -0.7208431788965309,
          1.5837816511212959,
          -0.3276052379018425,
          1.6186114859085765,
          3.4427509673496717,
          -0.07583165996342521,
          -1.295851444834401,
          -3.8665981755652292,
          0.9493434878528414,
          1.2436199946784974,
          -0.015373204147129465,
          3.7287693352149356,
          1.0418274331253763,
          0.38860813428122565,
          0.19095538563544998,
          -1.4871825204739906,
          -1.38510629662799,
          0.8056208017861889,
          0.4409306137055581,
          -1.2833376003848007,
          2.4890976903321556,
          0.42295411428677593,
          1.3449794787913756,
          -0.027322986406638744,
          0.6748201446890573,
          -1.1363590946894082,
          4.143918737045566,
          0.2702469298707611,
          -0.6824394596235634,
          0.8450167435393962,
          1.5649818817045735,
          0.9639457045770672,
          -0.7345494341842895,
          -0.8890021994514692,
          0.5390858655802595,
          0.3331139860380472,
          -1.3736090643202685,
          0.3526236848357717,
          -0.34488554129559307,
          -0.358203948339985,
          1.196513973992107,
          1.024422052210735,
          -0.36252194619619343,
          2.588621375848489,
          -1.2201035161857126,
          0.31902489324126676,
          -0.20233530400959346,
          -0.27240152074719864,
          1.5571068051292818,
          0.6848940071161663,
          -1.218579876248315,
          -1.3095846407670895,
          -0.4173538224727733,
          2.2853360573295722,
          -1.6155544649680529,
          -0.7709790718370216,
          -1.3095492481880104,
          -0.9238027113791547,
          1.0972525319501216,
          0.8150302304543923,
          0.3206241009881872,
          -0.5449633644747448,
          -1.0313206882064891,
          0.24656407408440997,
          -1.252503597185575,
          -1.56626811969212,
          0.3112328367757705,
          -2.468112538526524,
          2.0195527732816934,
          2.8506695774350184,
          -1.1146321858904715,
          -0.5183568794559651,
          0.03780227699174207,
          1.3273369864120224,
          -0.2805228887342308,
          -1.6228920959739837,
          1.4769649119004407,
          0.7766366237127008,
          0.9217308993297643,
          -1.4033995467369973,
          2.610360728662371,
          0.2674791183129239,
          -0.31319819295219514,
          2.21188500664357,
          -0.5519676289296409,
          -0.6912161175809303,
          2.0432022556938563,
          -1.4041922175986203,
          -3.7653721832909235,
          -2.1875347934658054,
          -3.4649777872157626,
          -4.14986022985993,
          -0.38472547065593443,
          4.572018474987183,
          1.433587682539172,
          -0.6553653924920513,
          1.9800304458926805,
          3.4560832958540177,
          0.5937650841472984,
          0.2797802497629422,
          -0.25119754031391817,
          -0.6101850377698219,
          0.9132435154120467,
          -3.3729049490828165,
          -3.0633853237716933,
          0.9606988520710656,
          2.462043086822552,
          1.158491732296627,
          0.10793185967959891,
          0.6776341205013757,
          1.3794272115424142,
          0.09282843320182167,
          -1.1790019145081885,
          -1.2682182788907748,
          5.301502508493858,
          1.0179573619157707,
          -1.851233565738423,
          -0.12865214058215138,
          -1.2005105257638715,
          -0.29147707411265134,
          1.3872378376132735,
          1.084370206386297,
          0.5060556059550312,
          -1.379202240237555,
          0.6245889185731074,
          0.022040507852983855,
          -1.0949239307925738,
          -1.349036563670684,
          -1.6212226772302796,
          0.9862744284470445,
          0.8610155624174338,
          -0.38818397192406984,
          -1.6840529642331155,
          -1.084718729188046,
          -1.5173410011236121,
          1.194989371456594,
          2.6592242159201973,
          0.9538099703272028,
          0.1634715242643559,
          -1.553236135492707,
          1.6820950512932737,
          -0.9090011662743807,
          -1.055598532422465,
          -1.194771529927192,
          0.18292485982321768,
          0.0004426393679804459,
          0.8052385979069127,
          -0.7611557936006214,
          -2.0416722265514182,
          0.008548439518151775,
          0.4077317822958089,
          -0.022922760710588373,
          0.06636683829395973,
          -1.137654292430732,
          -0.37082436753020104,
          -1.3013424340782194,
          1.5542634763456409,
          -2.234815644067023,
          0.8695071078025934,
          2.272808437855237,
          -1.1073220704629665,
          -0.08212124725992682,
          -0.8928202013105632,
          -1.4946933769685733,
          -0.4687349288973111,
          -1.8456938517771622,
          -0.17657956729972146,
          0.32444508220750085,
          0.9949165929408135,
          1.2945700974328942,
          -0.7155595894653946,
          -1.5978637537103855,
          -0.7472694393887466,
          0.3113435667553015,
          -1.1891983811193643,
          1.207628821814893,
          -2.215816792347578,
          1.8127407396383737,
          -0.30708047873316086,
          -1.027061717830753,
          -1.3148404262851392,
          2.2294236127990943,
          -2.520617257630149,
          -0.20990844553721139,
          -1.0136027514362353,
          0.27246326866149606,
          -0.06591703124131468,
          0.666362630226692,
          1.3694638968541784,
          -0.6065359638217106,
          1.9674919049224182,
          2.527926983767899,
          -1.3946617455827337,
          1.572783324464485,
          -0.0638586678120377,
          -1.057349215768092,
          0.4102283479670354,
          1.530342693570522,
          -2.0107031403099507,
          -0.07868818774214793,
          2.9673088545990547,
          0.20426098639420287,
          2.1948857947837,
          0.11974493260003256,
          -0.11705537923863595,
          0.27137339986913833,
          0.5572898942014185,
          0.9259353658827367,
          2.0438265400895186,
          1.071151329394245,
          0.7912943834838917,
          0.5760159359994135,
          -0.0813626462804037,
          0.39018790164194544,
          -0.4993504693118706,
          -1.2460200231139034,
          -0.03427866204042524,
          1.0404002443943265,
          -0.8597409815335533,
          -1.1045705084738358,
          -0.8616152287138726,
          -1.3032243273379103,
          0.18634219741989028,
          -1.9130140573314307,
          -0.10190961580936653,
          2.6045777492423516,
          1.4890178747547989,
          1.7463856767953445,
          0.8649818116703978,
          0.03835879515841055,
          -0.4114509613390254,
          0.3969490610306456,
          1.4972402209480749,
          1.2599289704375691,
          0.8639770436259748,
          0.40503730819378114,
          2.496429119411408,
          1.3439312177852871,
          0.421619353495644,
          -1.5215927047561673,
          -1.1620166297573375,
          1.2915501052688223,
          1.048189142509489,
          -0.4184688620048337,
          -0.2517575593614134,
          -1.0826355554032259,
          -1.547064292766042,
          0.38415045963338007,
          -0.9093907751238894,
          -2.3468461791406603,
          -0.7694566201639431,
          -0.8417553908671125,
          1.4000976932955602,
          -1.8713008425631517,
          -0.5244247399079314,
          0.6433168495876527,
          2.142538597217299,
          -0.470879514715476,
          -0.588923879271969,
          1.9108302701067748,
          0.0874204864900375,
          1.0387217969700686,
          -0.41261327948992366,
          0.3132571706673023,
          0.4936210204039875,
          0.8959554243150097,
          -0.20502116783427926,
          0.9713958214279971,
          1.9535681827294462,
          0.5462422165250074,
          0.33612547888010225,
          -1.7679618005797397,
          -0.6638283428714241,
          0.8055060407787118,
          0.783121509509384,
          -2.6405446758898226,
          0.9857687851808702,
          -0.29273698213654603,
          1.3601412731135998,
          -0.5736150034406903,
          0.6762450382295084,
          3.017268760755042,
          -0.7367510711053903,
          -0.04864886342084953,
          -1.1024993242678118,
          1.0964479514383771,
          -0.2769749826648727,
          2.999300835688635,
          0.7880179682172352,
          -1.0714974817139535,
          0.47245278582483097,
          -0.027118113866000423,
          0.38569274108728796,
          -0.2745162620794037,
          0.8986943841812721,
          -2.721496275014187,
          -0.917317809428478,
          2.5279364644903293,
          0.5436709005406931,
          -0.3139024582724911,
          0.7165446746644742,
          0.020608305980599307,
          1.412797615367629,
          0.46426310129004944,
          -0.24953091695841034,
          0.7571507421444101,
          0.3923902224746269,
          -0.19446826651817256,
          0.2339266247747221,
          0.5499091131052121,
          0.9787731173874427,
          1.572341153215769,
          1.3206517437229994,
          1.451052542863605,
          -0.3571538035617994,
          -0.16643695640136102,
          1.0352781590445412,
          -0.10250719569897104,
          -1.1377250587237204,
          -1.0138648228738096,
          0.22231604404735275,
          -0.1495086662086606,
          -0.9125687132242055,
          -0.7264910810628228,
          0.8864779823014042,
          -0.5401507557594016,
          0.6601598343101005,
          1.534701896844992,
          1.5066837100574575,
          -0.3184287514709846,
          1.284579660542494,
          0.043594024073922516,
          -1.867957921399543,
          1.3279729950024446,
          -0.7740088111101172,
          0.4698836668434744,
          0.4180926281531224,
          0.6777224631098356,
          0.04496803101927622,
          1.1971613156370424,
          0.2938565822965837,
          0.25107117512750193,
          -1.1511741034498642,
          -0.6088290855585567,
          -2.0881817074358233,
          0.27022297054707767,
          0.18000348785377546,
          -0.7717956877391607,
          0.37200020864412653,
          -0.17804590187678895,
          -1.0419651272782091,
          -0.2930427531912829,
          0.8268867675375288,
          -0.05488907760771958,
          -0.06090662140210314,
          0.34369639918314565,
          -1.0841063365016068,
          -0.4994492925389229,
          -0.8398181638728456,
          -1.7133985215678706,
          -1.0616502401714996,
          -2.3200799147175424,
          -0.9955435376424087,
          -0.7348872899839323,
          -0.5727419308733676,
          0.4851878950177336,
          0.5338638775932033,
          0.5436136669471573,
          -0.9595226288474215,
          1.0163192024981842,
          0.6984027492568915,
          0.28690741891032373,
          -0.9587338769152937,
          0.32012022999360734,
          -0.1262649654874129,
          -0.6742629903858476,
          -0.4994879027416994,
          -0.4867918606766507,
          0.5990920100380837,
          0.42980104414738424,
          -0.49413457697858615,
          -1.268215772034094,
          -1.4267655818453,
          -0.08993061400439645,
          -0.9811871073858,
          -0.629112882933874,
          -0.01753118756243504,
          0.5920596237509433,
          0.1416991827200809,
          -0.39399003509347036,
          -1.649719257474019,
          -0.5797664749751547,
          0.1746522539270491,
          -0.5493673752226471,
          -0.5654059642910219,
          0.5228079115132747,
          0.12619017039898348,
          -0.8953967658263005,
          -0.43075061715308266,
          -0.9757457237047327,
          -1.1353198391778907,
          1.4619718269844146,
          -0.5810256317693379,
          0.3332688657844227,
          0.4280722225730479,
          -0.4275095009142719,
          -1.243461246701079,
          0.22746824535253596,
          0.6946185005017699,
          -0.3310825124948857,
          0.19314974476529576,
          -0.48180289238254853,
          0.2185935983912704,
          0.7199633585372651,
          0.09499621784415464,
          0.7641142151861168,
          0.7307296364694585,
          -0.3033349908765824,
          1.2497884721649253,
          0.06370990760887808,
          -0.5968553226625141,
          0.9259201903729115,
          0.6941974238946279,
          -0.9013179474271642,
          2.4361024280478265,
          0.8686687715915586,
          1.0857083314482365,
          -1.5642482612729198,
          -2.505818271353118,
          1.0726113494695253,
          -0.09362405561937956,
          1.7472276700337406,
          -0.5146269593562579,
          0.5361406454725502,
          0.46578576063045357,
          -0.6125132497091922,
          0.37889449422426497,
          -0.05738018458394864,
          0.4959619320211885,
          1.6868911638661443,
          -0.18878359959965754,
          0.06363852982205985,
          -1.277849816541431,
          0.2862843682851349,
          1.308573383938199,
          0.031381631804595946,
          -0.08322431619775032,
          -0.09917345867169629,
          -1.185431505083893,
          -1.4484679295948355,
          -0.7744640732936814,
          -0.13925242204341082,
          -0.4602841704546243,
          -0.47833292431135926,
          0.10745613025787386,
          -0.4671905171155075,
          0.5224555153284526,
          -1.6690008702786556,
          -1.4595308674629794,
          0.809885763270771,
          -1.6776236221468641,
          0.005195948797442431,
          0.5506729393187217,
          0.946204495917083,
          0.49972534006741187,
          -0.0832287083544912,
          2.301198611259505,
          -0.306589678468076,
          0.542809694373772,
          -0.41794231871585685,
          0.4730626906359119,
          1.3255023149305993,
          1.0909578904729758,
          -0.8256681480182668,
          -2.150463561139456,
          -1.0430245290429283,
          -0.8047781096178201,
          -0.8935802558892884,
          -1.8224972460823063,
          0.9191232092637884,
          -0.5091551007756966,
          -0.1394135391783477,
          0.4571087333492458,
          0.09051596416771353,
          -0.39173025720342197,
          1.2416322359355227,
          -0.4066754079830183,
          -0.5392985246981826,
          0.4306472998177145,
          1.1610799336290925,
          -0.647003440615525,
          -0.5984982968792106,
          0.8518360740257068,
          -1.117259750161261,
          -0.9225977080204956,
          0.42448799463711345,
          -0.044320626586697796,
          0.5436013757559411,
          -0.9758968338198943,
          0.6494728392306667,
          -1.3723212030774647,
          -0.47298782902288283,
          0.7270818143900657,
          -0.7253883928204974,
          -0.13259791184312666,
          0.42098102724522,
          -0.007092498994198564,
          1.129321456609545,
          0.6175689975119599,
          1.0352024479218143,
          -2.34447162300937,
          0.492208850159135,
          -0.09181272415534755,
          1.606199419092867,
          -0.19036605873347828,
          0.43746215241696884,
          1.9128740007662102,
          0.8164412208584981,
          -2.760922779777853,
          0.8988097589708376,
          -0.5078848742441264,
          -0.38431001390243896,
          4.21864751394127,
          0.1811128123433341,
          -2.1250318787813405,
          -2.3680504678247227,
          0.0018597366171635974,
          2.319416497132142,
          -2.781523842739427,
          -1.0188639239892525,
          0.0763978059396602,
          0.10758057095519762,
          0.5500729750483292,
          0.739885309666694,
          2.4835889466779872,
          3.5925957229270344,
          -1.2439887843842055,
          -1.8785189232430286,
          1.5253846839807175,
          -1.2796709244416313,
          0.09132123367626697,
          -0.44482186121279016,
          0.49453431984607227,
          0.21996015271457614,
          1.728755984197678,
          0.47250129590741996,
          -1.6045463486031606,
          0.4338465832516423,
          1.389691520127396,
          -1.1787186465006751,
          -1.8388367186875694,
          2.470892235629033,
          0.7531084473019407,
          -0.1882390575188824,
          -0.5812318590509472,
          2.5118726216254057,
          1.0740016109801878,
          0.29990708845043546,
          -0.8459096691568416,
          2.181343973095423,
          -1.1173565987724354,
          1.0321148928989203,
          1.6071281998651001,
          1.6443218998818396,
          0.5895016288239974,
          0.4860572321971263,
          -0.1621105882501132,
          1.1492870590037936,
          0.15142721915559862,
          1.7661493348208732,
          0.0487872528649315,
          -1.3423193487736678,
          0.5641662231832006,
          -1.9774359195715356,
          -1.1592740820465945,
          -0.029111451262968595,
          0.0037357226543497774,
          -1.1194968691121086,
          -0.4025619947334068,
          1.3334424666286069,
          -0.5089945974890596,
          1.0919163854525982,
          1.497741301437386,
          0.48394804343800496,
          0.23471837680470847,
          0.16375190296258402,
          -1.1537768352421294,
          -0.43715598561982794,
          0.8087782488981392,
          0.15024960545937427,
          1.1386680569459016,
          -0.1982334619306773,
          1.834907537346953,
          0.05731871592882678,
          -3.7037545052700573,
          -1.460822689045721,
          2.2921067931702015,
          2.254374658091715,
          1.6905778868087507,
          2.4274228748124727,
          -0.7171654516739854,
          0.4835053235257347,
          -1.0067230349236873,
          -0.9608056114982315,
          1.6509089979033313,
          -0.934585668793751
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -0.3162301941820624,
          -0.11998688629546386,
          1.325581951706544,
          0.6248795010084018,
          -2.46349106711609,
          -0.16861062652101175,
          0.34222467706415416,
          -0.38672034144952055,
          2.423737611858157,
          0.15943162881771797,
          -0.9623743397423786,
          1.1008637972216524,
          1.149867080454702,
          -1.138073493470657,
          -1.6739722535225816,
          -0.39407386742013356,
          -0.9883703991066397,
          0.8976229841686991,
          2.0033480612421988,
          2.6686575376687314,
          2.1083023208623715,
          -0.6422310258414624,
          1.0196101963619255,
          0.44120564169526655,
          -0.8878142917396515,
          0.3481505218235299,
          -1.7132194221061774,
          -0.8494034750694969,
          -0.593300852514124,
          -0.8256442427548464,
          0.10467486827782006,
          3.269015755603426,
          -0.7578894256727443,
          -1.1434831351959234,
          0.4241187110373813,
          -3.3094336842065935,
          -0.11949747409095403,
          -2.009463702758131,
          -0.2883615188210862,
          -0.22234037201086668,
          -1.5156705515245938,
          -0.4945796096079547,
          -0.5648308273851068,
          0.12755055246735797,
          0.9816183419658822,
          -1.072406420631231,
          -1.1617722988913963,
          -0.9517653152124942,
          -0.4927343842445601,
          0.21030930480840349
        ]
      },
      {
        "dims": [
          "50",
          "30"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          -0.501732017480455,
          -0.3137446055412497,
          -0.17862440681431171,
          -0.30654773308952693,
          -0.8856392460155975,
          0.24658000233047042,
          -0.4079671515382345,
          -0.7304117996739111,
          -0.5959803062855077,
          0.317290974849384,
          -1.0481259148183717,
          0.5934144106018985,
          0.6452491725584797,
          1.0880771304233359,
          1.2851604631726397,
          -0.3001590197289904,
          -0.8401434261881875,
          2.0799379827905007,
          -0.07086487163142319,
          -0.5822870168699248,
          -0.17655276188047342,
          -0.6015024205247281,
          1.0525113129064427,
          1.0679200757247476,
          -0.29732225283375074,
          -0.2419734763978936,
          -0.3932739537527202,
          -0.8974461994532135,
          -0.50013928546697,
          -1.0285345495071438,
          -0.3864027099022764,
          1.175063785893797,
          0.14914555589312842,
          1.2941436819491499,
          -1.8520484588831294,
          -0.49425714308683016,
          0.4207781280373402,
          -0.11323138444121925,
          -1.2254678827956627,
          0.6675816946383828,
          -1.831083201311187,
          0.00383507285920242,
          -0.2588942251063352,
          0.20494739172618065,
          -0.012173553297223791,
          -1.5726556050224259,
          -2.432059244747136,
          3.4378126804000533,
          0.7414674804055332,
          0.5618258679193048,
          0.9260958050446688,
          0.6244991164737133,
          0.08451630425702775,
          1.5669491481625093,
          -0.12475432102912282,
          0.5896075497038408,
          0.715451175086549,
          -0.07057728927713629,
          -0.8312666062914307,
          -0.9488227745953215,
          -0.2667263048645996,
          0.23171598708402666,
          -0.1763472001934929,
          0.5618771653724824,
          -0.7130319092521049,
          -0.5320721959785236,
          0.4079846597521671,
          1.2539621062443163,
          -0.10194871154015356,
          0.018080676042451335,
          0.2505250736572427,
          -0.4930094226455909,
          0.335003892895953,
          -0.9382721047292749,
          -1.3159604513305396,
          0.11514197579103352,
          0.45381525763925673,
          -0.07579049085129583,
          1.2996688319721956,
          0.47120476447386767,
          0.4207491992681294,
          1.2853407262388943,
          -2.625452381155653,
          -1.8576391726256667,
          -0.47917028268677586,
          0.08197270316832504,
          -0.5726843190394243,
          1.5759319345678966,
          -0.4419611483467574,
          1.2639932275832426,
          2.146196088881728,
          -0.550894621003215,
          -1.2102561474054212,
          0.6718378692534402,
          0.9745131897768029,
          0.048496079248081865,
          1.4539556787757972,
          -0.456504823269803,
          1.156937474783665,
          -0.9616185462154281,
          1.4497258733718925,
          -0.7533260697582849,
          -0.3924059393557878,
          -0.7312525257281702,
          -0.7842366911782446,
          -0.28885718570354346,
          0.2174307108362829,
          -0.7363396014241235,
          -0.6277201634166327,
          0.3580994671237163,
          -1.4254072366875832,
          -0.2558006536709907,
          1.2866681472317723,
          -1.4710505031112695,
          1.077661908099274,
          -0.5158258283556215,
          -1.0744559642924014,
          -1.124679479958709,
          0.10378146390250123,
          0.9810529182584207,
          0.3988300637727537,
          -1.0266466909737506,
          -0.3912820844658795,
          1.229619785988548,
          -0.3124628344001173,
          -1.1994581354349405,
          1.2633486515332808,
          1.3455604411523459,
          -0.9212390454852109,
          1.4066693339114242,
          -1.0686898195390846,
          -0.23158733073790283,
          -0.44360154842588656,
          -1.2705524512575346,
          -1.9230200105390112,
          -0.3804935455326163,
          -0.3779029286351145,
          1.0359826762368285,
          0.7996188319178524,
          -0.09749148795357129,
          -0.7921453317406193,
          1.1860249866264587,
          -1.9147325568790856,
          -0.948295271218237,
          0.04036910689639478,
          0.010104937322256721,
          0.2711370371299627,
          -0.2538238231317448,
          -0.10294863805721488,
          0.5576053363725955,
          -1.3977211235436757,
          0.3013619812204791,
          0.3546141479750893,
          0.46817460182735027,
          0.3542186287628564,
          -0.1835056801445655,
          0.1403890622006073,
          0.844085337875827,
          -1.2056277394254804,
          0.9770873246217281,
          -1.178055329809028,
          0.143502262799091,
          0.17088025700071077,
          0.6471427903023895,
          0.8254936806642611,
          -0.3724481355780507,
          -0.7563104328121549,
          1.15041161493816,
          1.4216111899041763,
          -0.26663629334625366,
          0.73870953420355,
          1.4707907972890337,
          -1.559036223706935,
          0.34352512440916755,
          0.27309117629052837,
          0.3576170626471327,
          -0.5429078983279065,
          0.31158157900380534,
          0.17948301564440783,
          -0.3916779091476123,
          0.5477788932504432,
          -0.16274501407197736,
          0.0867530657695314,
          1.2263382618560053,
          1.8603263192435924,
          -0.47466174185320614,
          1.5334978092990048,
          0.4280727426673489,
          0.6921590058089021,
          0.4203614798145214,
          0.9646394400389373,
          -0.4771159716152404,
          -0.767719761839607,
          -0.6540977873369881,
          -0.9027434734327137,
          -0.695306585271271,
          0.32141807933807437,
          -1.3680710616153025,
          0.8261666734932726,
          -1.9202136145831135,
          -0.4922333532412933,
          1.2375753384211006,
          -0.4856468561060423,
          -0.1387938863771421,
          0.20147902216444638,
          0.09356330873408081,
          0.024998186340791016,
          -0.31526532255797834,
          0.3321383132883414,
          0.2945277246032913,
          0.48546735491788445,
          -0.15163980827680734,
          0.6227197476233514,
          0.02288012074705567,
          0.6601894421825425,
          0.25936729485964694,
          -0.5644188138277163,
          0.8989683444432742,
          0.809554897883264,
          -1.176711984272548,
          1.008827087012569,
          -0.4711710866430331,
          0.08864916477633511,
          -0.0938710740894305,
          -0.13642858497234242,
          1.563526621544872,
          0.9524648629554192,
          -1.1265204479319233,
          0.6700042469380963,
          -0.8221084954688336,
          -0.08868211363976197,
          0.9671477557332022,
          -1.0344837028388538,
          -1.3096885987410172,
          -0.26833774990015546,
          -0.23113769286786118,
          -0.5593075618573299,
          1.2736855421251612,
          -0.7659507315512417,
          1.0329758548622943,
          -0.6903284168392089,
          0.06604872220594088,
          1.1754936255641677,
          0.022890583811341604,
          -1.627765577612066,
          -0.015296021322759562,
          -0.4089849647376568,
          0.489813256745705,
          -0.7197346144014731,
          0.5614133503203047,
          -1.8631372273207032,
          0.11021936463303576,
          -0.4499110323504443,
          0.2446715818042508,
          0.2563530226087912,
          1.5127238928791902,
          -0.3492236021384903,
          3.3633901046515966,
          0.7299207053166162,
          0.7211195310807432,
          -0.3453736880499035,
          0.6602482596440308,
          -1.016891617500968,
          0.29062287699967676,
          1.0156914189795867,
          -0.08164509790668487,
          0.9223795992127524,
          0.8479494579158802,
          -4.250349413017867,
          -0.2704011733858604,
          0.8800361258663785,
          1.2797902489579815,
          0.9889579007510755,
          0.08641112169550698,
          0.18798708791708865,
          0.6730872188221795,
          0.06515847333353054,
          -0.20281912696638943,
          1.668635769275287,
          -2.1806338027270846,
          0.6439281687412532,
          -0.9182205694308161,
          -0.32940245427106957,
          -0.23493918628120702,
          -0.11296397176599707,
          1.733721556770755,
          0.5359923170505991,
          -0.611340569163461,
          -0.6170786304484198,
          -1.0836413626696086,
          0.4748592097242296,
          0.7028348361149457,
          -0.7410361268966312,
          -0.3651059957573023,
          -0.25462146282958614,
          -0.22596601678906741,
          -0.023766131302876657,
          0.8586237137242804,
          0.23346554467886668,
          0.5010851566669569,
          0.013661100800951677,
          -0.36118659614529286,
          -0.5881230010703402,
          0.8026739138893833,
          0.3591307596221618,
          -0.5831653260671278,
          1.1734105905159422,
          0.22223779432476842,
          -0.7327668905011365,
          1.4370282108396613,
          -0.40609139240518477,
          0.09506814322350406,
          -0.6368170361059433,
          -0.18595632726623254,
          -0.6740791944932809,
          -1.3734561022275469,
          -0.9155301742774449,
          0.35229140183535207,
          0.5237902456354898,
          -0.7526398831190207,
          -0.25314421654527847,
          0.4440698211783071,
          -0.2636861745549379,
          0.45715864414920176,
          -0.43595958097851606,
          0.437231753437468,
          -0.27489223389930834,
          -1.19234222639524,
          0.32274780269043174,
          -0.28609064853789595,
          -0.014858839149294985,
          -0.08975008265030214,
          -0.24053614914268528,
          0.21023710411664004,
          0.28584439405234224,
          -0.4708197115651402,
          0.03417663469029215,
          1.3899267940839164,
          -0.1594492312799859,
          0.5837646961089583,
          0.26092148604741633,
          -0.1507731276830197,
          0.7352727488166662,
          -0.7815494170753681,
          -0.8735068484735731,
          -0.07858089872769775,
          -0.10821086041842315,
          -0.06663212934781365,
          1.6141359310705192,
          -0.002675004047160479,
          -0.3125751239004257,
          0.916672569403693,
          -2.0343270707628456,
          -1.60400799408306,
          -1.4724915873340507,
          0.12873968703799626,
          -1.027047030900227,
          1.2566895133344396,
          0.1761781625821911,
          1.016813853988375,
          -0.41340142968031257,
          1.136597452356564,
          0.25849306900721863,
          -0.6136230515952228,
          -0.6953821664044177,
          0.8439622964742924,
          -1.2696756308770905,
          -0.7522609844737976,
          1.2046805266656622,
          -1.545863926982535,
          0.6013301511598576,
          0.23983515086148505,
          0.5435219607222584,
          0.6068432928286076,
          1.0651339509198945,
          1.2794302764415748,
          0.05207932127446698,
          -0.9035887059845816,
          -0.9739799226885492,
          1.848291672318449,
          -1.07167974074859,
          -0.9974953607080571,
          1.6806691528374338,
          0.6363962267032726,
          0.06911020918791555,
          -0.4955507034980982,
          -1.1896339740128348,
          -0.014200880736905553,
          -1.0393789432603582,
          -0.47814905846950445,
          -1.2293599688999406,
          0.3892483674846523,
          1.0927890926840653,
          0.26883956209404786,
          -0.07279721248190234,
          0.12073230798651169,
          -1.0722002055740154,
          0.008555547175874485,
          -1.1228720671320895,
          0.9095883442159811,
          -2.273452282396763,
          0.5322278456206058,
          -0.7617056380246341,
          1.0332039511520505,
          1.3326774377744652,
          0.7119375584620056,
          -0.28683532209577667,
          2.077001515013648,
          0.6385246380185887,
          2.34534210050227,
          -0.7403676692358047,
          0.2698111427255961,
          -0.3765977228757169,
          1.0529481279073578,
          -0.04593822253573564,
          0.5263977120549138,
          0.5651326069136854,
          0.22535058689968726,
          -1.7058293906081554,
          -0.8481633109242835,
          -1.4839279824915361,
          0.46260155211417214,
          0.5025629001352316,
          -0.969313957812393,
          -0.25463759501036454,
          -0.1312769306754557,
          -0.8164294512511452,
          0.5616550374748208,
          -0.48782403423873,
          0.40946644794071546,
          -1.9481614023677274,
          0.8003669656885825,
          -0.04101133881616024,
          0.6064861860269329,
          0.6049678266411563,
          -0.19037026612799626,
          -0.37925832444214014,
          1.4822229787584567,
          0.49603874397657305,
          -1.9317859921539948,
          0.751471705232345,
          0.5571169001114517,
          -0.20611739060763826,
          1.2322027548529422,
          0.44730465165948086,
          0.0065895620067584195,
          1.2780477226337823,
          0.1552086589027037,
          -0.39426361979595487,
          -1.0543887437687756,
          0.7063477793006526,
          0.34971830876246224,
          -0.3741449549918463,
          0.15057353952663127,
          0.2664951565852439,
          -0.48143711017873175,
          0.5856460765942247,
          0.022072916874726324,
          -0.586508493169858,
          0.8159504368942602,
          -0.4871514236970749,
          0.13644947127906618,
          0.19177387343310534,
          -0.704680873377116,
          -1.197047766587373,
          -1.050487536583181,
          0.6526546960457168,
          0.6598621156237285,
          -0.49780947662522174,
          -0.10665098717789337,
          1.9674565499518413,
          -1.0452744192715353,
          0.48354785846398923,
          -0.13100748295753395,
          -0.7169839825743825,
          0.612569789867888,
          1.4763771834001682,
          -0.5684453859252168,
          1.3216975318689799,
          0.19165588675040043,
          -0.5259983994010182,
          1.2908308353084075,
          0.9222839468796536,
          -0.2940361237297719,
          1.2944365534970526,
          0.5745206209121347,
          -0.2790807017298299,
          -0.6796744293271203,
          0.14110890164840828,
          -0.8303629475492039,
          -0.7975646270485839,
          0.24639110819539028,
          -0.7513278340123154,
          0.8035407154586464,
          1.3674109842282733,
          0.6476499173488551,
          -0.5650379225014044,
          0.4630175062940862,
          -0.33693570393091404,
          3.240304878664272,
          1.1121304267669234,
          -0.44518594023943997,
          0.8798731070725508,
          1.097015855282616,
          -0.12022388782948411,
          0.3399303397470972,
          1.0503031079442129,
          0.258794318583422,
          0.8176825808885824,
          -0.5273244416098783,
          -0.3800081494309134,
          -0.4050523538571669,
          -0.24374266370489034,
          -0.4446603199557272,
          -0.8957978211196285,
          0.25922777719203277,
          -0.7693141755924675,
          -0.9367024982694514,
          -0.2395495071376498,
          0.35884671296328297,
          -0.1543527202345228,
          0.46391569390356396,
          0.6952777621279421,
          0.4427748034983257,
          0.7132389852889982,
          -0.05927409770059138,
          -1.4389338235972424,
          1.2569549980305912,
          -0.39562684318412433,
          1.3950010462499538,
          -0.27600229335688153,
          -0.8482350873322928,
          0.7413853224948691,
          0.7797317132661647,
          0.4166733125284234,
          -0.3266704802487029,
          -0.40884310727138234,
          -0.5221887974099827,
          -0.6482660987572794,
          -0.8552044043693956,
          1.3811763096380252,
          -1.5054340693574757,
          -0.696422448129846,
          -0.29563920560267415,
          -0.5883433234903069,
          -1.1053516888422705,
          0.6170112415600311,
          0.3566408598226246,
          0.06981334738853313,
          1.4074036655062279,
          1.3015449882848338,
          0.04841347375875121,
          0.9974389700630354,
          -1.2425817232451815,
          -2.1656094572468794,
          -1.2057571976146093,
          1.8190979602021913,
          0.10332675745882029,
          -0.4086607040861347,
          0.9340821037088778,
          0.3706089231903341,
          -0.47788537314971,
          -0.47027578287458255,
          -1.2561841499123405,
          0.2598354224688944,
          -0.32106498915420295,
          -0.4876805694891835,
          -0.500325270853636,
          -0.1520740910408417,
