{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "21",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          3.073978749999197,
          -0.5023807383216965,
          0.9792320102354085,
          0.566499605259719,
          -1.722544201745153,
          0.7682908837494068,
          -3.366091586040306,
          0.3431169111393448,
          -0.6121995196722421,
          -0.17752474755849165,
          0.622659381330312,
          -0.23083966684342203,
          1.2657652262351655,
          -1.656322834706928,
          0.9606166266167253,
          -0.09950269005299861,
          -2.239422469068055,
          2.949226092777742,
          -3.974718011521576,
          2.3966205234941618,
          0.10135995927610587,
          0.240734707997948,
          0.170912161300982,
          -0.47497361591577775,
          0.9222611116038372,
          1.4951279485379356,
          -0.41613115363922465,
          -0.6449738672712418,
          0.35541328058942584,
          -3.022993388323871,
          1.0099397345667047,
          0.03111854123392185,
          -4.744922333461043,
          1.2011111740402858,
          1.9192812500146679,
          -1.7553504163557692,
          -0.5517995909944962,
          -0.7974504655158187,
          1.9777795808824898,
          0.7506362960293346,
          -4.609923264902203,
          -0.8149695657901743,
          -2.175467617826448,
          -0.16185609664797332,
          0.5742551034373603,
          0.04471507775217615,
          -2.5014992071014506,
          0.7756881872852728,
          1.3081169190587492,
          -0.12828581085420446,
          2.8451140440765874,
          -0.1459145941478343,
          2.942193905107024,
          -0.40433425490163405,
          0.3847579840735482,
          2.6379298593252383,
          -1.4494350717223417,
          -2.068975651351519,
          -1.4148929405429398,
          -1.164017593927539,
          2.885691776942498,
          0.025758982278033343,
          0.45328941233414033,
          -1.6721758024907447,
          -0.4336418882370262,
          -0.48397166650465034,
          -1.8988285905760096,
          2.459483206984684,
          -1.0490038448999115,
          0.024425363363032557,
          0.654268465747098,
          -2.130180309491675,
          -0.32713944063111355,
          0.4222442929687257,
          -0.6183379307303967,
          3.042144190855131,
          1.049633194895098,
          -0.503412664984114,
          0.7999130060929552,
          -0.7064080708845194,
          0.019801385323710834,
          1.3002992949550216,
          0.4632739260332402,
          0.8019214555075641,
          -1.2619174962281328,
          2.0520184530756937,
          0.4373312553327754,
          -1.2390693674369055,
          1.1034686728020933,
          -1.518787454758569,
          0.17600431895820773,
          1.7260995320352803,
          1.6184438563624437,
          -0.5315643434060523,
          1.0966904794031402,
          -0.9231513832372955,
          0.43513348070906743,
          -1.8757579731218135,
          -0.9785812169284858,
          0.00810344845806447,
          -0.6973067691542193,
          1.4596216904223616,
          -0.11278683024842319,
          -1.425501056883203,
          2.348551453033078,
          -0.015855236599337536,
          -0.30351511748029625,
          0.2766814065411951,
          0.15194312607254423,
          -0.5023664431127336,
          -0.5656735665748376,
          -2.16631014355734,
          0.1392153444109634,
          0.28545342924503453,
          0.18617677873299002,
          1.2012864956547555,
          -1.957022233006598,
          0.889258405631673,
          1.811655994259768,
          0.9531056445730177,
          -0.6227325515891197,
          0.8926000362572252,
          1.4238604807186541,
          -2.0012396755824557,
          1.8290537928363564,
          1.1812020675050465,
          -0.9996318946398367,
          2.4498518342610947,
          -0.8631056256977202,
          0.33971460610110993,
          0.11309201096446643,
          0.6745400289932905,
          0.4091682715793968,
          1.2463762999408086,
          0.6530763416631212,
          2.162031185795318,
          -0.07547324349235834,
          -2.4757790882449573,
          0.12496205977845933,
          2.4972642997771994,
          0.134140644432976,
          1.682046499505522,
          0.8888040971684008,
          0.22871364154821683,
          0.8364736905791204,
          -1.7382586512722435,
          0.9082323155037224,
          1.826707165675217,
          -1.1723424531410234,
          -0.8625745589824135,
          1.0843673192471817,
          0.3302000042479288,
          -1.339275811950777,
          -2.7651933081858764,
          1.3750902045712667,
          -0.9425084428025691,
          2.6698111313957043,
          2.4214657398255435,
          -3.2087297129460657,
          -0.819181089562155,
          -0.2022289756459599,
          -0.29129879010348614,
          0.07968159317422384,
          1.9226105041761377,
          3.33021609051003,
          1.7807813772319094,
          -2.656699812189678,
          -0.12674823320893625,
          -0.5942372587446425,
          -1.8018740340462225,
          1.0832031819414534,
          -2.6959275105556224,
          -2.0241314507516095,
          1.8667023459952823,
          -0.3259154621009317,
          -0.5230434835869562,
          0.5001681055369329,
          -0.8887057441520907,
          0.9130223940338406,
          -0.09473615143630924,
          -0.6602415380193196,
          1.0696465730334952,
          -1.5433888450688258,
          1.9226921292507253,
          3.5699283193800726,
          -1.6513862635905974,
          2.4284757481612633,
          2.180458304349425,
          -0.47385909333801857,
          -3.8793925850326807,
          -2.1515999659704246,
          1.534880405016177,
          0.24816962679549695,
          2.4664954516604123,
          0.2688657079675696,
          3.512249841538469,
          -1.2316859231111115,
          -0.8140214832525973,
          0.9830646622157867,
          -0.8024979722688933,
          -2.57709900450778,
          -1.4970527562513487,
          -0.9138746538952905,
          0.993968466830896,
          -0.17578389481882553,
          -0.3745420221813972,
          2.200533119385138,
          0.14633032422684197,
          -4.815169900519891,
          -2.265907408297971,
          1.072281079843041,
          1.3129246956509626,
          1.1342414773733833,
          -3.5862007430560277,
          1.35569925781778,
          -0.026245246301094604,
          0.3344362549122643,
          -3.374835399390768,
          0.36082514501573754,
          -0.9640138851900724,
          0.500614052189028,
          5.2774442035765405,
          0.8576772842483138,
          0.9858919609580832,
          -2.687962884182061,
          1.1090425145267924,
          0.6259470865591518,
          -3.927201400330149,
          0.5199446161053897,
          5.2310659213042685,
          5.17675056462824,
          -1.0074474224255492,
          1.6820625160722378,
          -1.8086412113995323,
          -1.581498628171073,
          1.731613947410891,
          -2.090473090618244,
          1.1385413381462528,
          0.8195315804069373,
          -1.1751555319549694,
          0.43124561667936734,
          0.6879663295753337,
          0.0828646682585946,
          -0.0586797144159539,
          -1.520673635040058,
          3.564163570360294,
          -2.15417868173769,
          1.9101516500040099,
          2.6708953219889833,
          1.0207283428147258,
          2.132862850235619,
          -2.492064713537865,
          1.8770074209260832,
          0.9211048837511753,
          -2.1509163525278034,
          -0.432763672918851,
          4.802961235015479,
          1.7221590468268724,
          -2.4629210876614924,
          1.1771247961683284,
          0.026543398971759186,
          0.11382823120005722,
          -2.088938874386486,
          1.8336299721430869,
          -0.3384099697244252,
          -1.990085186939468,
          0.07409994833080938,
          5.0725175250589984,
          -1.1616134455489313,
          -0.25408594944161556,
          -0.5116667619128574,
          -0.08079317661317928,
          -0.24856937854846534,
          0.2357087279545848,
          2.7493527068945536,
          0.8927050022555316,
          0.1731336702725084,
          0.5283461339099552,
          0.06091685281784754,
          0.3267212214097176,
          0.39059949080616335,
          2.0818600171098853,
          -2.633610452193412,
          -1.3096443251929142,
          0.1252623119284808,
          -1.837919363231494,
          2.134967622503168,
          -1.9177405231319562,
          -1.0592152929679108,
          1.720539492208871,
          -1.298108144739658,
          -1.6638656940406167,
          1.4206763276420422,
          0.6043890432674989,
          -1.6220088205725482,
          -3.685521182505751,
          2.0862160955745246,
          -3.454307135704899,
          0.07452521851966498,
          -2.392449850425596,
          -0.20592560577931907,
          -0.5899478890235076,
          -1.4185438830751713,
          5.159548122853215,
          -0.36560468753110575,
          2.6484840738765225,
          -0.8260344654226922,
          -1.6321206481029202,
          -2.74502298218908,
          -1.3432391132869617,
          -1.4730829593133794,
          -3.4184634641633034,
          1.9297379384188158,
          -0.6421067050501827,
          2.47041938703875,
          4.012133547297473,
          -1.086349953849179,
          -0.5782826179641134,
          -2.646711498383621,
          -2.1037965055459584,
          -1.4421022252934115,
          -0.2998733413989379,
          -1.4857290200324982,
          -4.0899482446031765,
          6.465152190952867,
          2.635979934635352,
          1.1523044015617478,
          -2.8243470792093004,
          -0.041166753221667136,
          0.32153301740679663,
          0.7209295560940033,
          -0.9190212517878946,
          0.42950680397739066,
          -1.123574914723246,
          2.3265640941338055,
          -0.801889027765634,
          2.1108367588619634,
          3.9596011693929256,
          0.6187604782657953,
          -2.31283454089331,
          -1.0880537158381391,
          -0.30900644497472546,
          -5.479131843099263,
          1.5003783445484717,
          3.446676226254097,
          1.3501462049039956,
          -0.3382974840212396,
          -1.277672434707859,
          -2.397273614705165,
          -0.47672651800305194,
          -1.9847781285257935,
          6.1129668756758875,
          -0.03730576321078423,
          -1.6207485553992147,
          -2.5506623779469124,
          3.050192965230902,
          -0.12188920221289587,
          -0.7030742647503153,
          4.92680105131161,
          2.5835346234295975,
          -0.5145507070135183,
          -0.9913869450477099,
          -0.6504302958669821,
          -1.6314513803347312,
          0.5240816651771911,
          -1.3235132408815917,
          0.30605488255737334,
          -0.11278737337346109,
          -1.737682250383202,
          -0.1968937073914647,
          -0.051812027696755976,
          -3.06722296244067,
          -1.3460717590557503,
          -0.09933006585042474,
          -1.9844268654994175,
          0.8647434029598754,
          -0.6352406799579188,
          0.18303703079867706,
          -2.79567021115682,
          -0.37090156048728634,
          0.04808901468947712,
          0.8452669704121606,
          -1.0366039322951228,
          1.2856958423577654,
          -0.6539542887344347,
          2.391016219409947,
          -2.5945639562690253,
          2.102956375645669,
          -0.4861825277199471,
          2.0414540462383384,
          0.6096962594116343,
          0.9556198363072789,
          -1.468067697548342,
          -1.1348317582714662,
          -0.5310902551154273,
          1.8125857036542223,
          2.2246985542569666,
          -2.2710549629549295,
          0.135274105290703,
          1.0231074172810302,
          -0.1331632253864775,
          0.13506794496541005,
          0.0017623202837526916,
          0.10953576122327291,
          -0.06037847493136637,
          0.13270928807772953,
          -0.03717598683471005,
          -0.16412787505122017,
          0.13601717829490273,
          -0.13713493985629732,
          -0.0606254115893499,
          0.15100858542559278,
          0.15119150877732668,
          0.024640499340146456,
          0.044235132878863846,
          -0.017297993095092827,
          -0.06938366521337305,
          -0.0574879161784831,
          0.05788484679724108,
          0.08467882975664022,
          0.09783305890367974,
          0.09717512089186581,
          -0.13716197463596025,
          -0.0018721464057279346,
          -0.14845161483349664,
          0.016618348149764105,
          -0.019618179105441457,
          0.13008577593339987,
          -0.05002225184729163,
          -0.12848490295902115,
          -0.11978644059093706,
          0.08774425181533015,
          0.03966552123949313,
          -0.1338346824366166,
          -0.13954399059366976,
          0.06743085725443178,
          -0.14335015791979416,
          0.10799320052953411,
          0.06920013077757056,
          -0.1404693865518964,
          -0.13929875018960203,
          0.1632814139864295,
          -0.042185722566089344,
          -0.0434032373655683,
          0.10495314785832775,
          0.15006461320629894,
          0.16306717415857588,
          0.08501558481909509,
          -0.041518427054387484,
          -0.1397473508242637,
          0.09299066971491847,
          0.019596286247514402,
          -0.025425670302676374,
          0.1363434490515743,
          -0.13045429853047183,
          -0.0024744871822793293,
          -0.1639547446334516,
          -0.01051524560412141,
          -0.14887286552185314,
          -0.1278974262836131,
          -0.12833081812062266,
          0.050064298481210245,
          0.08255505216882573,
          0.02797259090453079,
          0.15507202980296128,
          -0.0419844780599216,
          -0.0718996873617737,
          0.1236754869595853,
          -0.09274145448111783,
          0.15542433162383004,
          -0.16368604342650464,
          0.1576577052433938,
          -0.15328283772589738,
          0.1312396350341686,
          0.009294509654422653,
          0.16540370432631543,
          -0.14300336970168878,
          0.018069643520073318,
          0.15746434319895322,
          0.007749983401999415,
          0.043416921960433945,
          0.0656792503845242,
          -0.015252765189992782,
          0.04279936240629835,
          0.028289848746988838,
          0.13459991763656587,
          -0.15251566257535074,
          -0.07349307721458095,
          0.1511258583246719,
          0.1309445948840947,
          -0.014878420140422465,
          0.040307901990447224,
          -0.07469494227079004,
          -0.10464421777939921,
          -0.01218021721459337,
          -0.049204496764555114,
          0.028069003909808998,
          -0.14168203450735925,
          0.15917294524650943,
          0.16313752798023262,
          0.08988490876187798,
          0.14653381022531836,
          0.4419972340181038,
          1.6213125503725596,
          0.4676834148891282,
          0.9404721076719231,
          1.1067589585930537,
          -1.5016285938484,
          -0.15179525564376775,
          1.5995500099568463,
          -0.844908397891434,
          1.3846664515152964,
          0.5469803306999685,
          -3.2214601100083704,
          1.0942277908901528,
          -2.7830705160840985,
          -4.001383080697913,
          1.2804297559135907,
          -0.7295694827866032,
          0.21370718992855975,
          -2.202827248539522,
          0.09669634239695979,
          0.07451981271892368,
          1.169712902969696,
          2.5224656150192852,
          1.5163321527793598,
          -2.07053496516948,
          0.8144735959745805,
          -2.718490258856986,
          0.8354624735225832,
          0.39643562830064794,
          0.6025175833899962,
          1.4182031946755997,
          -0.15150891915798695,
          2.4798834902241262,
          0.03724800284169974,
          0.04078189991756988,
          0.5063106346582261,
          1.0366499026063838,
          -1.2649185237042326,
          2.09719084032962,
          -1.1864722109808887,
          -0.26446494864420894,
          1.676449886770451,
          0.26276654337136685,
          0.3980049084356611,
          -1.325048444277632,
          -0.2224691648143707,
          0.5523023251945891,
          -1.9168729115715553,
          0.10968752287439523,
          0.7859321158941208,
          0.13355267991898792,
          0.46454554808397347,
          -0.32384216156854173,
          0.6533362535368864,
          -1.3777037056180075,
          -0.3726444997678709,
          1.3840213775143764,
          1.0599741354401626,
          3.1088573805302997,
          0.318324549784758,
          -1.8650121974160871,
          -1.1356039163525629,
          0.33274910566210825,
          -0.4853739772617588,
          0.2928061556361319,
          1.6002894862092525,
          2.0518764967096073,
          2.4564995310179074,
          1.5795919872047126,
          0.3298645927462922,
          1.1980985872626864,
          1.605697926718466,
          2.7908503679799392,
          3.457328540713075,
          -3.145118605179361,
          3.843984103963644,
          0.6053336634849742,
          1.7113900695425628,
          -1.1419613957438273,
          0.5097340524375824,
          1.6779239849775966,
          0.02919235451631425,
          -1.5548622903103624,
          0.4150169258585592,
          -2.2886483193908935,
          0.3416918716873853,
          -1.5883561555565413,
          1.3867422041112147,
          -0.6376043743101423,
          0.7101583304101,
          -0.25975546019882056,
          -0.18028732877401948,
          0.9217194375123214,
          -0.2077241157336551,
          -0.8025829289590416,
          -0.7755980006698018,
          -0.08463521470103832,
          -2.200158776219367,
          -1.189408136040213,
          -1.358706006280092,
          -2.875198126210322,
          -1.5019500317536136,
          -0.7507476506457089,
          0.3321520636053312,
          0.5042461259287588,
          -1.3422449354796209,
          0.4814798925796271,
          1.2408346520977604,
          -0.3575426947394433,
          -0.05040380874736642,
          -0.6407861230208712,
          -2.2008876951751883,
          -0.6969313044561986,
          0.20447596421998968,
          -1.589872283724154,
          0.0977790605890935,
          3.272256478935155,
          1.59658122578643,
          -1.691219382393461,
          0.6344252128427215,
          -0.35502895427637415,
          -0.09599859598304951,
          1.691960985010809,
          0.30653507966076415,
          0.2127538087745031,
          -0.5719058187291208,
          -1.2274017777839612,
          1.477592161688007,
          1.989619071790173,
          1.6963461395687358,
          -0.1472064173190484,
          -1.1196268523949138,
          -2.8894522552902697,
          3.200657424976908,
          0.1619300341351221,
          -1.0200146997547137,
          -0.05618265426952269,
          -0.7632019033021226,
          0.47279954548163267,
          0.29839897641080243,
          -0.2162781022430916,
          -1.8610457282671236,
          0.4652069523745177,
          1.8103567254689106,
          -0.09924575807894662,
          -1.3860361114339494,
          0.7345040996376674,
          1.4003476418106815,
          -1.119018334854035,
          0.29322956519949345,
          -1.3863780295049104,
          0.005756101622090313,
          -3.0214249129208373,
          1.5221374984290286,
          -1.0542889317889903,
          -2.748614120472698,
          1.462050548566949,
          -1.5484861152019975,
          2.4881193727143227,
          1.9661695438173066,
          1.308080197913379,
          -0.40895053910173784,
          -3.077693790388368,
          -0.5265931917252713,
          -1.3430535433617805,
          -0.7464549633003315,
          -0.16829407292215293,
          0.43324191501029985,
          -1.8168512089974218,
          0.6231191180893444,
          -0.29217758784108105,
          1.1868998186476818,
          -0.871358906783584,
          -2.501561476474033,
          1.1413458979996391,
          1.476534845203528,
          0.09413773511164096,
          -0.8454158182814351,
          -1.7885669365019412,
          -1.750299067698585,
          -1.649034969694116,
          0.29828492223561576,
          0.8563631008073844,
          -1.6777100156806872,
          -1.3575769627401844,
          0.23074377040454766,
          -0.8926829527075629,
          -0.42054905490904343,
          -0.8407825970958166,
          -2.495914220695513,
          2.1375342258306627,
          -1.436222569751037,
          -0.35285717039531783,
          -0.23364881143697852,
          -0.6195527435981414,
          0.11706497877863999,
          -0.7029328184889463,
          -0.17911657179218826,
          0.6837981230513498,
          0.007900203610007948,
          0.47884103566955183,
          -1.490747784582736,
          -1.5414785456970053,
          0.8974751755694209,
          0.40548427678838894,
          0.8317525807888494,
          1.317867202203431,
          -0.42681096082115544,
          0.5062940987516938,
          1.5783302625095599,
          -0.80441324244058,
          1.5402519132109618,
          -0.0008331138231768675,
          -0.9516028570057378,
          0.292928947711118,
          0.3997117047049056,
          -0.4513892224596201,
          0.7490991036520502,
          0.8705508539374728,
          -1.5193698218811202,
          0.538519948765475,
          -0.73924121721055,
          -1.1498322095123834,
          -0.5909294599871865,
          -0.006135658883723405,
          0.44789530912784076,
          -0.011988007433839704,
          -0.007316714921987652,
          -0.06390141386788774,
          0.08650828210982588,
          -0.6954459906984578,
          -0.7698529959802279,
          -0.7691314312158509,
          0.505963038532872,
          -0.6639210357204117,
          0.3675403714662778,
          -0.9035994047325451,
          0.4470484473846708,
          0.6263622176782,
          1.186070064906164,
          -0.5886628855016206,
          1.0653689302617033,
          -1.925806030682331,
          0.9219342383879755,
          -1.8854171274241733,
          0.07182285261732103,
          1.517842703655694,
          0.9774987442573964,
          0.2073707311029908,
          -1.4232475467306305,
          -0.660983039825941,
          0.10345965628767717,
          -1.7218687570846851,
          -0.0950631451110395,
          -0.4699076219114677,
          2.1937445610598156,
          -0.08248090597200568,
          -0.045866395812012586,
          -0.9051594206997043,
          0.2276163975877698,
          -1.6280555062255693,
          1.646789047562493,
          0.18494492217934147,
          1.4733355224723008,
          0.393940761971929,
          3.254409654139065,
          -2.727406204156394,
          -0.9707983565189207,
          0.21906042572995443,
          2.1326506723129612,
          1.4378807664088062,
          -2.405043133906897,
          -2.1004442276980244,
          -3.0200239188790925,
          0.5204797486239632,
          0.41917337949573347,
          0.5942729615507917,
          1.8039909433927244,
          3.33581700668776,
          0.19717741025164542,
          -2.307856426868464,
          0.26365096535171495,
          -0.6938568702775703,
          2.1356203674938694,
          1.4292243078087645,
          -0.18879146231876137,
          -0.4406061170558787,
          -1.0193284433542331,
          0.38265531161374167,
          -0.23660407823898924,
          0.607982355674282,
          -1.1108464629250432,
          -0.07693950601293205,
          1.4082448667672918,
          -0.21174538511550867,
          -0.16778521149325196,
          1.5924054016649243,
          0.8268121902695984,
          -1.1439673229926655,
          0.2042991338711345,
          -0.9737389412179616,
          -0.7201317287129645,
          -1.542876565991164,
          0.14844296282431232,
          -0.2422471505002428,
          0.839593016415523,
          -0.9063690464787556,
          -0.46223046615680446,
          0.28344194346796,
          -0.9909565224883433,
          -1.2329591992281186,
          -3.6703598565235316,
          0.2913669965500123,
          -1.402213335052476,
          1.3181775425272468,
          0.8210922366271046,
          -1.145063510037617,
          -0.16494901922302851,
          -0.6358487071236519,
          -0.5904161701733538,
          0.4407474326982067,
          -0.30322488876921455,
          -1.3691910264518952,
          -1.0209051142763472,
          1.2231902556982126,
          0.5879618893757674,
          -0.4315982031433637,
          -0.3417493019993046,
          -0.40810823972135546,
          1.4876339259366396,
          -2.033506875174129,
          -2.2331424880989297,
          0.08791629976563488,
          -0.33216872066321274,
          2.671029274373156,
          -0.4200513960571575,
          1.4817583521459161,
          1.8291549062405275,
          0.5980332458551637,
          -1.8845557471486776,
          -0.619505899731127,
          1.4720716670738814,
          -1.8216129110501087,
          -1.204941187233051,
          -1.3402577714647521,
          2.3293846698052136,
          -0.9287445480622181,
          3.1211567227250048,
          -0.23287776230825133,
          -0.20817216738143782,
          -1.5579030224514818,
          -0.15423255053493556,
          1.2724284585895649,
          0.6048965710316634,
          0.3863933166453122,
          0.34819099512234764,
          -0.02702340788813338,
          -1.3299530636756158,
          0.15308683846490584,
          2.0371431682253034,
          -0.7382747799439014,
          -0.9266465985410757,
          -0.05516143228234523,
          -1.3275663660952528,
          -1.776370610382858,
          -0.14546612858559976,
          0.385411535701806,
          0.47386485514005106,
          2.321928990509891,
          1.7443569072390654,
          0.285059414521592,
          -0.48610802714161555,
          -3.228651603468558,
          -1.1969901410486905,
          -2.275988651352783,
          0.03697265466491395,
          0.2170467349116506,
          -2.1246259257321327,
          -0.08898741715531895,
          0.867586211715136,
          -0.9955580817355588,
          -0.36699393088796434,
          1.281456096996204,
          -1.5157495448891554,
          0.08521380110686883,
          1.275797820062407,
          -2.8377821958853193,
          0.5155050174302355,
          0.19942858534425997,
          0.6804197206678422,
          -0.1392745336861666,
          0.6065518817161228,
          0.24419249145168972,
          1.9038909323586433,
          -1.1811664532689603,
          1.4892647316957017,
          0.8563043271111954,
          -0.630463479687348,
          2.9613120533493436,
          0.48137964637026304,
          -0.7158922144462184,
          0.05129290304153069,
          -2.5532719655421814,
          -0.17421274117166188,
          -1.2688637806847112,
          1.297177158007511,
          -0.8449179817803457,
          -3.208947173841186,
          -0.3312348205067605,
          -1.6349523469701268,
          -1.9831134215513395,
          -1.9439916311328416,
          -0.1405628122975112,
          -1.326507435444794,
          0.9025895624313844,
          1.444919163726065,
          -1.0967595729977995,
          -1.438059309161489,
          -0.5792259122530734,
          1.3843066209162451,
          1.5088365973194495,
          0.35851319681255645,
          2.6065575525273856,
          0.3098083159068662,
          -3.6944187267953463,
          -1.4253703867203251,
          2.064404360252958,
          0.6885429557898377,
          0.5942947770966653,
          2.0569447431525876,
          0.25823884256075397,
          0.8684184413813388,
          -0.5223379613721906,
          -0.9998492479464527,
          -2.509101313546927,
          -0.9913298235280417,
          0.43682543699033083,
          0.7328516234307635,
          1.1336225664471313,
          2.3581109532209745,
          -0.3016897798986986,
          -0.19088483392520214,
          -0.6421178354290527,
          -1.130546988143061,
          -1.3598807531636992,
          1.293854430566611,
          2.1217970184747466,
          -0.9167246163434537,
          1.5509177480828842,
          -0.3835971172705367,
          2.350036531569748,
          0.05861324429366836,
          -0.8046419102161771,
          -0.6002843897324582,
          -0.412060412928815,
          1.153405271792911,
          -1.769046256782868,
          1.6521042424692327,
          -2.440551621975441,
          -0.10196331443315357,
          -1.2608033026795593,
          -1.4618284088149518,
          2.769208970219571,
          2.5749884429973173,
          -1.1758491484421534,
          1.46760667283231,
          -0.8047246451231186,
          1.6290462803271024,
          0.11000672635058595,
          0.16126835720178614,
          0.05126163121899454,
          0.3128952004372731,
          1.0295267844938552,
          -0.26283785174127927,
          -1.9680402138323971,
          -2.03021083299142,
          2.5226052260647913,
          -2.2173581112248564,
          -0.9885592176348876,
          -2.46135452308995,
          0.6386861316767596,
          -0.4938490808235679,
          1.8845241321993809,
          -0.8111025126425452,
          -0.9647779420834597,
          -2.117536496023592,
          -2.0801106444793644,
          0.5247758014161021,
          -0.6022565665921722,
          -2.0833357864590987,
          -0.23716027220428015,
          -0.5439126578868285,
          -1.0737580364401274,
          0.8176692573467088,
          0.9356080817017591,
          -1.2141964003571475,
          3.167513313000648,
          -0.6621662967853338,
          -2.175424919123269,
          0.9875975454477993,
          1.8496542870326902,
          3.0662506909021285,
          2.104127206016645,
          4.577283125220465,
          0.48380127931393907,
          3.2551540860884574,
          -0.3935444458962214,
          2.7679180177301266,
          -1.921958377586919,
          -3.1873584368582604,
          0.9147310587040038,
          -1.664455742033803,
          3.346611681964949,
          -1.2577821982368216,
          -2.456307991110447,
          0.14609041186200222,
          3.781787480885562,
          2.4834495936974954,
          7.884379125440216,
          -1.3413432388587814,
          -2.2231929740162437,
          -1.9327004646975898,
          -1.7541928402354448,
          -1.339574064695823,
          3.699950788728075,
          0.018593451810751456,
          -1.1519838927154737,
          1.7992903233438382,
          -0.22704495265316416,
          -0.9368558266336838,
          -1.5161875544694698,
          -4.293106891566528,
          2.667386547156251,
          -2.056345369600977,
          0.39990535190426346,
          1.5374480596021172,
          -0.7042814558166214,
          1.3304216050000492,
          -2.984576495944646,
          3.4277674076383398,
          0.3659599896524435,
          -2.2764768257203296,
          0.0727429941322149,
          -2.0756048391666386,
          1.151406966565144,
          1.4527466943608291,
          0.9659195013206744,
          -3.8262963964216263
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          1.382706039857177,
          -1.649085863589473,
          0.5003311980534292,
          -0.1124981530442127,
          -3.4401150585919402,
          0.6022732441771631,
          1.2163394783248784,
          0.7564822155603725,
          -0.45908676570580514,
          -2.0322655450720277,
          0.33104146843105453,
          -0.009547533392891026,
          -0.8147970331353203,
          -0.48571498930042184,
          -1.5439277038875239,
          -1.3075433801148946,
          -0.8943405047364351,
          0.18966051283783292,
          2.694472066648628,
          -2.4572777272634285,
          -0.8678635543332481,
          -0.11528551467758325,
          -3.2496991718942345,
          -1.0626102426388435,
          2.886392627282147,
          -0.5624079756388385,
          1.353394864132571,
          1.7199018381890072,
          -2.6545268733571263,
          -0.6166077147799778,
          1.5827883775184313,
          -1.8460014300978551,
          -1.3274864137140867,
          -0.7860618615819749,
          1.9663801545505553,
          2.1118930600225503,
          -0.44205432434521363,
          0.051789771735119956,
          1.2596398512933964,
          -2.469442054193895,
          1.5744867782998744,
          0.4442020251849258,
          -0.22535761178138922,
          0.6743420829933426,
          -2.2907710395242784,
          0.012331498791205278,
          -0.5620758497456372,
          -2.1356392714505197,
          2.3679571228708727,
          -1.4365496433040557
        ]
      },
      {
        "dims": [
          "50",
          "30"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          -1.2183372288602456,
          0.16002734499878138,
          0.4938030399878727,
          2.1221148584205034,
          -0.8053744176326169,
          3.149580960359617,
          -0.2757430991939929,
          0.16232832937614064,
          0.5086649621601983,
          -0.21810385304935995,
          0.9141157901013139,
          -0.27714128823323697,
          -0.9395468773695193,
          -0.4646580672563955,
          -0.6436900830559191,
          0.16986523632683664,
          -0.6332476955258114,
          1.9926230012136392,
          -0.3616352350182009,
          -1.2618031596018227,
          -1.0072385910102388,
          0.3581744904842383,
          -1.8070237882913507,
          -1.596938864099323,
          0.09062741411635705,
          1.292711580648889,
          0.2979378081241568,
          -0.9157566938670314,
          0.6655822009598699,
          -1.7609557133738958,
          1.0159776799646014,
          -0.9155789724757015,
          -2.1864318695028615,
          0.7486991852920194,
          0.6481577188031106,
          -0.907851891957723,
          2.24048242196153,
          -1.3724040318719506,
          -0.319843849425521,
          0.16032613819374802,
          0.4441507996676468,
          0.17886296396266188,
          0.5060130179306704,
          0.8377448751681129,
          0.5498035133255709,
          -0.45138854483562046,
          1.9729908709359396,
          -0.6250766085677368,
          -1.3410797014142004,
          1.0764468352293464,
          1.319695686327712,
          -0.5159019910991263,
          0.5312343571679101,
          1.2705124464371726,
          -1.037890281502757,
          -0.8977709252561943,
          -1.3509472801603633,
          1.6344625671194677,
          -1.4486475955477716,
          0.558801152924962,
          -1.2197325233127363,
          -2.1753791003472274,
          -0.01637529047201034,
          0.22979364878012076,
          -0.7586172788413547,
          0.045106983982466355,
          -0.17809345572798746,
          0.9624662838350897,
          -0.43723766356916255,
          -0.8549385975456539,
          0.3826509938724938,
          3.3455462843742985,
          -0.03616949266533133,
          0.2635543783805766,
          -0.815467381687516,
          0.7178678927651302,
          0.7304385298789449,
          -0.10372832127939162,
          -1.2397447080488844,
          -0.8627648023001231,
          1.1278238281045379,
          0.4637737257278155,
          0.05947071915677341,
          0.49913085953143543,
          -0.9267477921101617,
          1.0563159788700716,
          0.7976264402440238,
          -0.9100360103020578,
          1.1752009905740797,
          -0.4149149638235966,
          -0.046803268800365685,
          3.1818509095605587,
          1.5446036724954022,
          -0.07033845493567795,
          -0.6741931587293608,
          -1.521431102992341,
          -0.21569428248362973,
          0.2327657020927123,
          0.8497376835296496,
          -0.20713327983761787,
          -0.5548952327429174,
          -1.302196197377439,
          -1.2708714102426861,
          -0.2620337796416206,
          -0.4359783441668032,
          1.3186271227583488,
          -0.8043614304699049,
          1.5211117205828295,
          1.4148722687197592,
          1.7489503101308013,
          0.7610553214473325,
          -1.1001098942601424,
          1.0011739211125892,
          1.0478815808053503,
          0.2793322607788341,
          0.29938117120801144,
          0.2957280249747116,
          1.1467706022532471,
          -0.21980096931970491,
          2.74863209613452,
          1.9415282376321876,
          -0.7097324933905909,
          -0.5637641496805281,
          -0.7895252649760853,
          1.5659631288223759,
          -0.563567678534468,
          0.10487724744756552,
          -1.2615199859826876,
          2.382323653845581,
          1.3237018878691296,
          -1.130891312576001,
          -1.6355536332677607,
          1.3530245645345458,
          -0.8542115088613833,
          0.9561689001034787,
          0.6179808079908498,
          0.14236669470632937,
          -2.7467168481690356,
          1.8725655648188615,
          0.3286341514687799,
          -0.13278519363782923,
          -1.3179201485479528,
          1.534926575830978,
          0.2648813722256234,
          0.6550899147261958,
          -2.1549051802274692,
          -1.1617322456685801,
          0.3547436371061661,
          -0.0464617370423539,
          0.09240873688631829,
          0.5608723289354414,
          0.588003768652856,
          -1.4211233633589637,
          -0.5245399699894405,
          1.0211990721886555,
          -0.32404742672326114,
          2.097153387938771,
          -0.2634540963523588,
          0.19551702652795386,
          -0.13864023542138623,
          1.0860833476654805,
          -0.40190780221847405,
          1.5587330593496347,
          1.1163921161220232,
          0.5749159791397295,
          -0.448240716259335,
          -0.4526953954343642,
          -2.3373237365076234,
          -1.7156970354478218,
          0.32981422903737784,
          3.788623719718167,
          -0.748287497191972,
          -0.32193856902885404,
          0.7669262984266999,
          1.022047667809006,
          -1.2810914585380935,
          -0.4593363350081303,
          0.9073378359224132,
          -1.6319862765829725,
          0.3954784981948961,
          -1.1081214622749331,
          -0.26061573004571914,
          0.8791624293681384,
          0.8597366100775532,
          -1.139613382344564,
          1.6884791918201267,
          -0.9286802485280522,
          0.259410334565078,
          -1.426099704342227,
          -0.21953558149774305,
          -1.0385304423597388,
          0.2831067819536925,
          -0.8379654074218073,
          -0.08074475690366212,
          -0.20806965705793468,
          -2.7367771778058074,
          -1.1874529416741868,
          2.3299955708053965,
          -0.020846230730140528,
          -0.20324263625597996,
          -1.8774301721126057,
          1.8144250044795913,
          -2.4571536926240722,
          -0.47933560479125426,
          1.850404861418053,
          1.801253880176528,
          0.1257212892622807,
          -0.9789596214963624,
          1.1594299454375845,
          0.05004483379583463,
          -0.3205078735888345,
          -0.49479281522019175,
          -0.05371708562893913,
          -0.03317677810880014,
          -0.8635685222512848,
          1.6842232019231522,
          0.2708075613482202,
          0.22722665919675236,
          -2.2076297721744327,
          -1.1372802954951748,
          0.6503349881358701,
          -0.5608774866512835,
          -0.9232695622375062,
          0.7975230137161268,
          0.692040299004299,
          -1.8894137162741438,
          -2.146093133700737,
          1.9054706144159674,
          -2.117007133144524,
          0.09132487092841808,
          -0.08692909757591938,
          0.8691809912503871,
          -1.391330623996252,
          0.6391370098972716,
          2.6516109879838297,
          0.7754211000123403,
          -0.3416162778516968,
          0.808355109697107,
          -0.600165373448211,
          -1.175131359482162,
          -0.790029063424242,
          -3.109645881063748,
          0.5050918255835309,
          -0.2889509040707909,
          -0.08907816706981148,
          -0.9136354476410943,
          -0.4007364880046577,
          1.0898484094325487,
          1.5139606551231206,
          -0.10353827564651112,
          0.14178824130253456,
          1.4743324139476335,
          0.32996491217407287,
          -0.0012920612438199412,
          -1.0681628082508785,
          1.3148083296222337,
          0.45866199437039235,
          -1.1623092894585625,
          -1.763643557229882,
          0.018973316535762345,
          2.489337823103528,
          -5.063055587118979,
          1.4819578506504143,
          0.1927359567218471,
          -0.6875808895029089,
          0.3598603345204384,
          1.2427594564887945,
          -0.7055130561736697,
          1.0172394159011626,
          0.5637187532980854,
          -0.7198663122008926,
          -1.725705170878708,
          0.3226906936902748,
          -0.1816582898203541,
          -0.3252694731532952,
          1.8985586665273806,
          -1.7422269646484727,
          0.9785237632405648,
          0.0901007738117019,
          -0.19501718797539827,
          -0.7657929447496886,
          1.4898075938887048,
          0.2924450763656751,
          -0.2800176527550507,
          -0.059027517535756746,
          -0.39710951938922096,
          -0.08071577887055259,
          0.05132035862337237,
          -0.8675933753118532,
          -0.9607511381765113,
          -2.1089827768956786,
          -0.42319999764943744,
          -0.39046400193387154,
          -0.742421271870991,
          -0.10950500789306337,
          0.691039557581269,
          0.9081584815159911,
          -1.5566335952288481,
          1.5633998474723065,
          -1.4785070903161401,
          1.9667591409560337,
          -0.20592294337565306,
          -2.298269506270229,
          0.9877806654088265,
          1.8323300474816993,
          0.12737005692149822,
          1.44121755103724,
          -1.8237106227324884,
          -0.25531998075098844,
          1.3671843053491732,
          0.11713437661306159,
          -1.106301719168753,
          1.0595014463877759,
          -0.39288709236820335,
          1.74285813495433,
          -0.6736178085780762,
          0.3329741375766127,
          -1.3341795558285643,
          2.3112853000786497,
          1.0939281265437788,
          -1.2164741541781707,
          0.17572226898093252,
          0.5955642808790254,
          -0.3832457234127618,
          0.1672615207184487,
          -2.0579629976686973,
          -1.7379137259062456,
          0.9488407253265648,
          -1.4074451606755136,
          0.18120761944585254,
          -1.0910180787988994,
          -0.8544948329457072,
          0.7633028566559756,
          -1.6061623716185014,
          -0.9173360181292515,
          -1.6900366367684219,
          0.26083694140557995,
          1.4916379526039834,
          -0.7134447776489707,
          -1.3121578046810074,
          -0.46673138714504286,
          -0.15320260128780955,
          -0.9650759535727192,
          0.8382099550822899,
          -0.7608086656618193,
          0.33039579242903344,
          0.4477970270058268,
          0.6662965233529781,
          1.3364370162987993,
          -0.18636729126079307,
          0.8956326561774711,
          2.922005359980021,
          0.0821160317088515,
          1.1215173395316382,
          -2.5337801997919627,
          0.9104028888112097,
          1.1894261395095342,
          -0.3213768553034225,
          -0.2841325631454957,
          0.8057369510779523,
          -1.2708275479368234,
          0.5708747299197866,
          2.296705864709701,
          -0.5111651127491154,
          -0.9039043167204767,
          -1.4490101253131575,
          -1.3808671953017067,
          1.8141803160799863,
          1.0063852669695807,
          -0.7883900841797428,
