{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "14",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          1.8816938824720426,
          -0.30860881718723643,
          0.8567655043897302,
          -1.2721579948644695,
          -2.0494918819470715,
          -1.8004520527230525,
          -0.19518897864322393,
          1.0195286953923308,
          -0.024444813114350313,
          0.1907701313509117,
          -0.5828787639145178,
          -0.04501779895409537,
          1.6251993950965382,
          0.5472159484047591,
          -0.5691805108842318,
          0.6567919337777338,
          -0.29850898627593625,
          -0.16197586884765797,
          -0.7897426176178752,
          -0.4853850769082955,
          1.3253721820899858,
          -4.188279732361361,
          -2.154596176430531,
          -1.2193372691175652,
          -0.809287436167634,
          0.35145443915141733,
          0.6260204112261357,
          1.8850998919662547,
          0.38082707905072133,
          -3.2687526751768057,
          0.6892807675195605,
          -0.2681348802728445,
          1.2547301210096942,
          -2.5140406926895236,
          0.17224198992937156,
          2.9884397665713895,
          -1.1388906791338298,
          -0.4484867774438142,
          1.400577888510785,
          -0.05824309676009183,
          0.4575337803805123,
          2.3045035601132353,
          -0.22596727600048783,
          -0.40184208409099964,
          -1.5715750050760096,
          1.2161801965697867,
          0.3207140131469366,
          -1.7190449075531795,
          0.4425605874192806,
          -2.0562450311234906,
          -0.6096485235488939,
          -0.789348680673663,
          1.030545731298419,
          1.5242943079095603,
          0.6405954059563808,
          0.22430378750463073,
          1.2665979870988333,
          -0.6495870700471521,
          -1.2238368310550782,
          -0.1440189220322021,
          1.8611791627478838,
          0.9811646550917338,
          0.4974580030303783,
          0.7978383174551584,
          0.4514459439797894,
          0.2092769884330041,
          -2.258174848635618,
          0.618386069608613,
          1.164180577225571,
          -1.7650287950839492,
          2.1657466089889548,
          -0.6802139247043553,
          0.35297359047439875,
          -0.14520132071640543,
          0.40270651323972306,
          0.9361251805985525,
          0.9030933041385891,
          0.3902960105666203,
          0.6888643224010419,
          -0.646266945524774,
          0.05257917939492293,
          0.47545214498962085,
          0.12526001781204396,
          -0.7922622259658202,
          1.3931329603631188,
          -0.697698840622348,
          1.8501192815049508,
          -0.4931560474594937,
          0.9583719073257125,
          -0.8672369558560805,
          -1.8292805451005434,
          0.3457202630894481,
          0.7318332739096387,
          0.28208499472583193,
          1.2058534110668968,
          -1.6366178385493675,
          0.22528854145581145,
          0.5019517833534703,
          -1.2705129340079637,
          -0.16095876567655015,
          1.5226815430174239,
          1.6166955866394668,
          1.0267417487383588,
          2.248611220675454,
          2.4521921061596252,
          1.440756990976792,
          -0.4469213671493092,
          1.0436090076427575,
          0.031018655355751604,
          -0.5144445942433804,
          -1.3326183889783887,
          -4.622707943992807,
          -0.4417616551106926,
          1.2733035397842423,
          -0.36762436687851413,
          1.8794748953971265,
          -0.22593692473413549,
          1.3068548913960767,
          2.3732730901549153,
          -2.7167488569418383,
          2.8889318293244877,
          0.45421004614233185,
          -1.288718489953016,
          -3.894532746227153,
          -0.6516012762815875,
          -1.0734498473271916,
          0.2527469477315608,
          2.0940571663455096,
          -0.0708140131573811,
          -1.359928181024536,
          0.7677444682398902,
          -0.09623282735144807,
          -0.6655177161415904,
          -0.8125348339399341,
          4.116727590421916,
          -0.0675990600067222,
          -1.6541295477733875,
          -0.6689512906456185,
          -1.1664679842328292,
          0.12160473513182767,
          3.1833116975055917,
          -1.632974202282256,
          -1.4368216741480593,
          -0.3617908456157216,
          0.15660461560688343,
          -1.1571318749865982,
          0.38224478744944024,
          0.14240796809293982,
          -0.3943475013846217,
          0.5042111772478254,
          -0.6104168023407612,
          0.5346715984412688,
          -1.9891550554179553,
          -0.6260012785843222,
          -1.2779497668570812,
          0.1827221325617176,
          -1.4066527550325272,
          0.6543567624352548,
          -2.8241355544459297,
          0.3125158822619906,
          -1.9933173838101188,
          -1.1813114460572531,
          -0.6479172861804455,
          -0.0961721811964326,
          -1.2163325199156976,
          1.8293368813038062,
          -1.41300861937647,
          -0.7638587443435434,
          -0.9593297925506608,
          2.1112994575744195,
          0.7070507914392354,
          1.1859510426789914,
          0.2900189570676186,
          -0.26018448136476324,
          0.7622271782964982,
          -1.9464207741598503,
          1.4712588096304222,
          -0.9415624032258211,
          1.4928734909783854,
          -0.18350544906059937,
          0.10336722911629036,
          -1.1724911097119368,
          0.940170320370514,
          3.548952897032087,
          -0.25616546804613644,
          -0.8792254116311581,
          1.2504501140107813,
          1.2361417048133818,
          -0.7348354012702983,
          1.1549577449742046,
          -0.8031453742072062,
          2.2389577738887985,
          -0.5719205128990872,
          -0.00916672600894514,
          -0.8367850454603217,
          1.655830273252003,
          2.3687840725972573,
          1.4482090996187107,
          -0.2569284571130665,
          1.8855658454624535,
          -0.6744546154102077,
          -1.0113047117439822,
          -1.92212978831144,
          -0.6261110648151244,
          0.34200468469589723,
          -0.30818178835692844,
          0.49631182452532313,
          0.3887050442399641,
          -1.8879838874389652,
          -0.9978942499872737,
          0.2246750753639597,
          0.9300428007571423,
          1.1308759868071814,
          1.3142905068248665,
          0.9349002771901674,
          2.676138764014047,
          -1.1296219115057058,
          -0.32062023942948153,
          -0.04426241049511134,
          1.924879076565721,
          -0.01141998016480515,
          -0.5422693455607143,
          -0.8367087911530959,
          0.1248975266639176,
          0.08442432564861628,
          -2.8539782755503578,
          0.9700799281934098,
          0.8146106803093313,
          1.2895268390832861,
          -1.4015113619976873,
          -0.8392838760185113,
          -2.1047390391413483,
          2.136313150959104,
          -0.24669453470050967,
          0.9758246541563595,
          -1.0841293481511283,
          -0.13044640554589074,
          -1.3082158349653514,
          -0.3396930121671857,
          0.3463286313172477,
          -0.7886539193876339,
          -0.7657666292373785,
          1.6530648263359262,
          0.2853549398377472,
          -0.44603190045078234,
          1.1746154880614939,
          3.91643960235691,
          5.5269605011638046,
          0.8106822847236596,
          0.5663882642447234,
          -0.41960936260684567,
          0.846587374042808,
          2.1906924073341103,
          -0.4273683456713556,
          -0.34770470318248164,
          -1.0309990785883718,
          0.6778834208905165,
          0.20870402014218664,
          -0.20109330992487903,
          0.3753172759299629,
          -0.20216556864303148,
          0.23076207646258465,
          -1.8323096145065842,
          0.07767060791959376,
          3.9289221965126053,
          -1.363299308249757,
          2.0940991844144237,
          1.2142907361784738,
          -0.10492305030604758,
          -1.6107814779250933,
          0.04080754269750523,
          -0.2202259129364891,
          0.6404272460484443,
          2.459369590205813,
          -0.4393696233994996,
          -2.0859967321847885,
          0.8898561825136145,
          0.4010709854582098,
          1.3846254379664058,
          1.6251933737793953,
          0.37518553239246116,
          -0.015059727273079113,
          -0.7309208791771455,
          0.06785442538553745,
          2.2199432553637606,
          1.6772427513480268,
          -2.0044301141956904,
          0.6248712363036647,
          -3.3123935745846045,
          0.1397106802338799,
          0.7880413959595818,
          -0.11723904268800603,
          0.9990551534106199,
          0.38546891143801176,
          0.6222354025608254,
          2.848855442130974,
          0.04738833939763293,
          -0.8728554719938763,
          -0.4657130658742751,
          0.47531506019814734,
          1.259304794299543,
          -0.563765270991885,
          -0.3350559674500267,
          -0.002866414341005867,
          -1.913385358418988,
          3.8839058832376763,
          0.010086654049063323,
          0.8041454335002488,
          0.4363481175593561,
          4.329278352309504,
          -1.2304657306866018,
          -0.8928828139461475,
          -0.3918743131391335,
          0.9277870549461005,
          1.4541533858353168,
          1.8198239072938898,
          -0.13410179737285066,
          -0.9603923926691817,
          -0.5549896640537919,
          -2.656905971972013,
          -0.5989395731637601,
          0.9650517073191304,
          -2.3674419598415235,
          0.15988476562321247,
          0.5329872090284755,
          0.8290077785909791,
          -1.9636772841609895,
          1.4564372723923695,
          -0.6487219385982518,
          0.8094637899742545,
          0.5688372075477177,
          0.051280095296835776,
          -3.10446174852816,
          -2.976512403334116,
          -1.4799809820024554,
          -0.7730573332952341,
          1.0148380472771694,
          -0.273228037454612,
          1.414230558569998,
          0.5648521994144482,
          -1.3974924554571293,
          0.4995735296868967,
          0.8633478467327963,
          -3.0772106216234687,
          -0.9004859776185523,
          0.44708602707623335,
          1.0442170971111107,
          -1.1604905448852583,
          1.0134529131975145,
          -1.0172534620701192,
          -1.7104472351725022,
          3.1762176321172992,
          0.6104603537284371,
          1.0951778716246723,
          -2.516589770404407,
          -0.40484876203242764,
          -3.299793982613429,
          -0.5144584269698347,
          0.44749464973364755,
          0.12156652008099819,
          -1.6914726966136364,
          2.33061726071674,
          1.6271169298231902,
          0.15168396824565838,
          1.4408991149504253,
          -3.1285844937460854,
          -0.8683338048886581,
          3.1080143104125346,
          -1.8072180924644878,
          -1.2145259834365996,
          -0.9676590096949157,
          -0.0422145013922252,
          -1.4576507338717404,
          -1.3535611617574463,
          1.2743745404108098,
          3.778942973834161,
          -2.29045865055103,
          1.2007522000444184,
          -0.29713158918642535,
          0.8660321709832767,
          1.6696050678016425,
          2.2335431072582637,
          2.556701587474154,
          2.0665559711439005,
          -0.09532991714625133,
          0.230503381373166,
          -0.36869985485931045,
          -0.5632847849619582,
          3.0486750483802547,
          2.66600489608164,
          1.1102715252867446,
          0.6311398681325254,
          0.4745969607793192,
          1.2679300545285932,
          -0.5671494688480181,
          0.89168673620414,
          2.011076682365991,
          -1.1297105067133424,
          -0.7686148919446816,
          3.6271568868009156,
          -0.797092834123667,
          -1.1406200670846967,
          -0.2688033630177214,
          1.8687293103678304,
          -0.4177512229136008,
          0.7262381540101639,
          1.753174029366838,
          -0.05238228730928102,
          -0.043432991328249924,
          -1.2831197836181651,
          0.5405299419591205,
          -0.38180784036312687,
          0.9975541984731523,
          -2.082140640837906,
          0.026728917213325435,
          0.9732415245922157,
          -0.4581314109518568,
          1.5348911524351034,
          -0.9513125744554219,
          0.5528194347557146,
          0.4347491533716601,
          2.063905311570485,
          -0.09506796448499205,
          1.114208893549969,
          -0.16980669585118585,
          -0.3978018476570805,
          1.1064896923337229,
          -0.4926369905195016,
          0.6210314063756811,
          -0.3050920844294931,
          3.3602089597848517,
          2.1470813502615678,
          1.2605860436683276,
          -1.912245099002467,
          -1.122303970583988,
          2.2429365048950323,
          -1.2016302883710932,
          1.0419266979245008,
          0.44634791729998996,
          -0.41100984194649004,
          -1.9353990179820184,
          -2.874127584538477,
          1.775382472181013,
          -1.8132101676959975,
          -2.0294032439184173,
          -2.9563136378221326,
          0.7720499496863313,
          -0.19713189064597575,
          -1.8896267804743643,
          -1.0759670794673006,
          1.0573776085868825,
          -0.831655030888816,
          1.6906394664239783,
          2.294016227195005,
          0.009168463201715726,
          0.5995423352974272,
          2.4956838128753955,
          -0.16234738547172367,
          0.13067144221086832,
          -1.3148481140063162,
          -2.098067578676388,
          0.44025836572930327,
          1.023496791632754,
          -0.3892833430298421,
          0.20723363095172623,
          -1.70005778948463,
          -0.5538651481112211,
          0.37833073989903027,
          0.5412168453316866,
          3.425207045031908,
          -0.7010043731701088,
          -1.0189875389772276,
          -0.5698550087418064,
          -1.878778118978706,
          -1.0422338962617745,
          0.3820405675383442,
          -1.9198920310513525,
          2.59905611837961,
          2.7987658312146495,
          -3.5151746120725065,
          0.18783438931804203,
          0.241501004855474,
          1.6852535638424884,
          -1.0967921651085408,
          -1.9503523957742068,
          1.21324360093897,
          -0.31372222549876366,
          0.49225164532099336,
          0.9541267526930699,
          0.31162721941475696,
          -2.23814810446966,
          -1.0202108157184901,
          -1.3006963551688968,
          -0.5374141127893887,
          -0.09664637703147523,
          -2.4224323986162872,
          -1.1403944957174534,
          0.8010929048617044,
          -0.5605808728133268,
          -1.8708709957617304,
          -0.1376379449737612,
          0.04480011258610875,
          -1.790268929089358,
          0.34840299546848036,
          -1.0697052630249615,
          -0.6148125223194313,
          2.5500068901263093,
          0.7007494715380188,
          2.5756776324741923,
          -2.26133104093584,
          -1.3803891210553827,
          0.1816193372025803,
          -0.001765122163488414,
          0.10583139936792413,
          -0.5741903263821527,
          0.5295026169106474,
          -1.120161062127125,
          2.3208333209710106,
          0.9100882668010645,
          0.3774185392909353,
          0.6392015044565819,
          -2.3373358116447553,
          1.8701167471557578,
          0.7553310497651403,
          2.6726624584674976,
          -0.25306529985266646,
          -0.37491163428354635,
          -0.9701109419427572,
          -2.23825324919274,
          -0.027134892050436645,
          0.3280513708580942,
          1.0156211282457026,
          3.6659634144616757,
          1.4726311966360974,
          0.5558864964115586,
          -1.3877446533830589,
          0.00763570919950086,
          -0.5880869707537778,
          -0.9662604699918147,
          -1.895514119448182,
          1.0082511545096466,
          0.4336835675354262,
          0.5671895428427687,
          0.3740489412450876,
          0.3690276970090669,
          -1.2409107052416775,
          -0.7621918960567614,
          0.859754402842723,
          2.4763969954648615,
          0.6949691911571428,
          -0.27865651322725504,
          0.2726329463480349,
          1.9812904040861288,
          0.8499306151985339,
          -1.2201634743916798,
          -0.10857885113761176,
          0.4568315496934319,
          0.15720841728363524,
          -0.39527968209251396,
          -4.573266620075164,
          1.9845686251924408,
          0.5972978843682364,
          -1.1236366487687286,
          -0.9298853167458133,
          -0.9537357980631617,
          -1.8833554385307014,
          -1.5867405385984243,
          0.3270374632073817,
          1.6199231555241627,
          0.49137589307223684,
          0.2890917667747218,
          2.0609683883655086,
          1.0232679528427422,
          0.31179231284196995,
          1.9589214292987902,
          1.1226893914068956,
          -0.6040239615586854,
          -0.6049567265855201,
          3.556975463869497,
          2.879635334157507,
          -1.1439897474003573,
          1.248094347313006,
          -0.0677492743328794,
          0.3037821028679099,
          0.01708023171444342,
          -1.4129922401738404,
          -2.553828549456759,
          -0.04050819208662702,
          -0.3311838947493138,
          -0.1761145082771369,
          -1.595402678160714,
          1.1799752186636767,
          -0.9527082742260444,
          -0.6419651244031374,
          -1.3754337844289268,
          0.25347627427559405,
          0.04280620878350572,
          -1.4385312651898632,
          1.0556729556820004,
          1.010704757296531,
          -0.22462192969005268,
          -0.20970454072576233,
          -0.38881534102983295,
          -1.2338634304112452,
          -1.2287949985305282,
          1.9579715131508764,
          0.027836273958527374,
          -1.4166658916031982,
          -0.6461157066354879,
          5.47915481841009,
          1.2926651330933832,
          0.40502629693418685,
          -0.4480462636739772,
          0.6144585599223922,
          3.7073987800032717,
          2.8756553733584402,
          0.609518112907151,
          -0.27230950916576085,
          -2.338084170255247,
          3.507484323730486,
          -1.071569138922452,
          -0.17459263109296144,
          -0.03329045357260955,
          0.3458021517054778,
          1.976610595732513,
          0.38096340111437493,
          -0.3135949309164309,
          2.0865463022526707,
          -0.735023167644923,
          1.0920483893506479,
          1.8287531285667835,
          -0.19545626418949177,
          -1.5490825696917696,
          -0.6449880651061128,
          0.6029989828906916,
          -1.2426336265932125,
          -0.4630906763445401,
          -2.4358066892881634,
          0.47787895526291435,
          -0.6696204782971686,
          -0.6041569347877298,
          -3.7574387419767823,
          0.7713042791532997,
          -1.251913589171708,
          1.4737877165001547,
          -0.44412973073923584,
          0.618938164416603,
          -0.3968021165551802,
          0.9239158913626123,
          -1.8051185821486146,
          -3.434644337981259,
          -0.01613400216813965,
          -0.9227322941105514,
          -0.12715527293206597,
          -1.164027370968564,
          0.48965475345601517,
          0.32202216955242846,
          -0.023492579337025442,
          -1.7116182865195486,
          -0.866948236433694,
          2.22257078950967,
          -0.024706666518808772,
          0.37610368120080234,
          0.6041667837428502,
          -0.8198348908374437,
          -0.45403031291235774,
          -1.8028327754488718,
          0.22943190519978188,
          -2.0217996575859547,
          -1.201406803608823,
          -1.4179074277433592,
          -0.7506408196873678,
          -2.1860500685049464,
          -0.9090599440112364,
          -2.190305163593213,
          1.4458914954792148,
          -1.3158801021163713,
          1.0504775900396126,
          1.6606961850868291,
          0.8517163653244965,
          2.2411591821713155,
          3.209756686864832,
          0.6015232472861451,
          -0.2418515695155855,
          -0.3201628973966195,
          -0.04528817260973641,
          0.7305301486188235,
          -2.8292611459211723,
          -0.4538933301474925,
          0.3391841958636902,
          1.6867171469334528,
          1.9097062234450204,
          0.4939215375094037,
          0.08932048673782055,
          -0.5742560412581621,
          -0.3395897620044982,
          -0.5053094372285636,
          0.5824633006584558,
          -1.1598171189731805,
          1.342843735244105
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -0.42407511520576063,
          -1.4775238802607866,
          -0.2676980071021341,
          -2.1938872711202126,
          1.1335670781113516,
          1.2918447626736937,
          0.09865217258691156,
          0.5270820403257702,
          -0.14343382306050226,
          3.161133735677364,
          2.4889987489232612,
          1.7757261396352402,
          0.12527728528166993,
          -0.6268616524634715,
          2.603788122932859,
          0.7246410960307411,
          1.6089851986837118,
          0.9804494281384586,
          2.9203924739972744,
          0.6054795618564307,
          0.020948355127711395,
          -1.3619503841247917,
          -2.0601436995638296,
          -1.9637719685193562,
          -1.087653654047024,
          0.36619248931671755,
          -1.012147329073637,
          -0.19350920628201912,
          -0.3965809854690348,
          -0.9778283502489177,
          -0.8140278861397479,
          1.2673072385799593,
          -2.2141646104063755,
          -0.8039309424233189,
          0.5282186921452862,
          2.0448840538102946,
          1.3017163991770382,
          2.3185189409251667,
          -0.5312102076459696,
          -0.9430403827526116,
          -1.683641444916778,
          0.09884575180059824,
          -0.8348444365297494,
          0.9478655610786889,
          1.80965162533946,
          -0.053289623893131764,
          -1.709532798237691,
          -0.17347860234918625,
          0.5612280120114667,
          0.8425031527851625
        ]
      },
      {
        "dims": [
          "50",
          "30"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          0.03216596925546297,
          -0.3693854563225563,
          -0.8397863489404163,
          -0.28108467294449435,
          0.1272534893078479,
          -0.3757736936532256,
          -0.48575448982204905,
          -0.9724658493310578,
          0.39681372216576377,
          0.2029616956698616,
          -0.8044311461509173,
          -0.3094813127750731,
          1.0407133426753763,
          1.4582064357284068,
          -0.013827423788331798,
          -0.31323972498777436,
          -0.641171881080014,
          -0.8709656103146338,
          0.023271526902483675,
          -0.8451739978459605,
          -0.6947086060009879,
          1.415122168175388,
          0.07743714894709217,
          -0.32131332105295274,
          0.405415936906417,
          -0.10735403548104902,
          0.22846018811786203,
          0.9066238112733486,
          0.12704881526729725,
          -0.3892477262010436,
          -0.41961294124499404,
          -1.0236041889879255,
          -1.0706458714091844,
          0.21857238908135043,
          -0.3571556079773574,
          0.3281496993071096,
          0.6213758505996978,
          0.5520211163712548,
          -0.5308612364115493,
          -0.1516883273254831,
          0.11651057269987398,
          0.10475175677514542,
          1.618515155942848,
          -0.21366717366053048,
          -0.17974727920448386,
          -0.8939086570404993,
          1.4296967503313245,
          0.4327232449508232,
          -0.22187927130295718,
          0.696138512505901,
          -0.15594573962522915,
          -0.11271572236738601,
          -0.10228479037517389,
          0.15936108835243853,
          -0.16755914417136766,
          -0.12560026316291456,
          -0.5556718394914743,
          -0.07515576750752972,
          0.20773833336360356,
          -0.40362321522536504,
          0.01489372236178657,
          -0.2777988848164581,
          -2.623094371662382,
          -0.391948435670844,
          1.156482619513818,
          -0.6587518025459318,
          0.8110307247612262,
          -1.0742952561703607,
          0.2216186003507482,
          -1.181770901656152,
          0.057704011950500914,
          -0.6127100061339324,
          -0.6577644720074654,
          0.22238070603368942,
          -0.34904960564234033,
          0.5828275443300927,
          0.4794196349487228,
          -1.0222264335743936,
          0.3326263624033731,
          -0.28583408897499596,
          0.16433054932881622,
          -1.4322982957229178,
          -1.0805050462646382,
          0.09761702944878689,
          0.4009886154848701,
          -0.5797588099967669,
          1.0972914589623624,
          1.641277156230249,
          -0.216709820949022,
          1.375682781499563,
          -0.7055319692796083,
          -0.8784981040186054,
          -0.6352177640125418,
          0.12044937265190865,
          -1.7203977086439675,
          0.9064124126819748,
          -0.7339960414921483,
          1.444978747824684,
          -0.18978206545184018,
          -1.1135964873172177,
          0.25493127454150716,
          0.07134436143192675,
          -0.13604584372249706,
          0.21268572657386256,
          -0.6698109067889202,
          -1.665947313747515,
          -1.3341029539919353,
          0.9677098900136314,
          0.006819800107774045,
          0.20428420511492296,
          0.7128551506549569,
          -0.2155761940564207,
          1.4790801854291176,
          -0.5828191977316478,
          0.23694468034766245,
          0.27420451164390297,
          0.18484104887703204,
          -0.9264203018309998,
          1.510300549241838,
          1.490260363148203,
          -1.0413550194921581,
          1.2795964717768575,
          0.31648802649620705,
          0.14405182511093073,
          -1.7788770538119891,
          -1.4878874641838837,
          1.5830115880921583,
          1.1118238146004669,
          -1.1137528227388849,
          -1.3180756387780872,
          0.4000408419366689,
          0.3234637665499869,
          -2.3982427024660655,
          -2.141186486606273,
          0.014218174204770605,
          1.0744007982251353,
          0.30497672528935627,
          0.7319940273829683,
          -0.3299225311994992,
          0.7150618537144596,
          0.9902642850724529,
          -0.21546558162477675,
          1.0155697418885317,
          0.2675266923826359,
          0.7060907066249195,
          -0.38560526361351305,
          -0.29823448687383125,
          -1.2071825065858746,
          -0.8100215621009257,
          -0.10965287053021491,
          -0.45500882634073586,
          -0.794631670459614,
          -1.1326513497055477,
          0.06135288528007386,
          0.5420014652761463,
          0.9176137605763297,
          0.6249360108123644,
          0.5430606517815023,
          -0.23688173109478924,
          -1.836879333366531,
          0.4495974415344464,
          0.024720566776086642,
          0.7180712473948285,
          -1.9444973005940016,
          -0.6452852588748155,
          -0.16239926185063347,
          0.559248955674947,
          1.285621634583827,
          -0.31392721105913884,
          0.5901491730954959,
          -1.2632611954342272,
          0.06002710027871362,
          2.166476185218598,
          0.026890104078272956,
          0.33777244081511376,
          -0.9595681391135606,
          -0.2438962895598144,
          -0.14431553799589406,
          0.252180499547817,
          -0.1731526980610268,
          -0.3623955528716686,
          0.04854241133744619,
          0.7547348231006134,
          0.7414120028580352,
          -0.3921736555339818,
          1.0041588891224285,
          -0.44778208722199114,
          1.6200108435831424,
          -0.2535300232022093,
          -0.3495595628920377,
          -0.4218847641227342,
          -0.2970815184667535,
          -1.6180707572602246,
          -0.9326932374871147,
          -1.3266952955740225,
          -0.33874878444448003,
          -1.0158829524905328,
          1.344264407099255,
          -0.5408228518350326,
          0.010185556191231642,
          -0.011952120714692194,
          1.4217489026444468,
          -1.0335538615492235,
          -0.8704256929179278,
          0.030201817053121,
          2.059760792400431,
          -0.5308983570685331,
          -1.7656232941126089,
          0.9612651802577897,
          0.22599150607622337,
          -0.1005971255907261,
          -0.7387767771813609,
          0.9263801667374151,
          0.2462116693776747,
          0.5083775379158625,
          0.2073091379646372,
          -0.3634032235143255,
          0.29288056844483956,
          0.23475180307511637,
          0.3889791992472599,
          -0.10035902645128866,
          -0.3337774420135492,
          0.34773860180259863,
          -0.6746474659101162,
          -0.6802753396713189,
          -1.1390484371590175,
          -0.6643051576072708,
          0.2751406283180934,
          -0.33088280018257027,
          0.25084589187829476,
          -0.5483974539238141,
          0.6118328512720558,
          0.12543073809451993,
          -0.2642673824242266,
          0.22606866894257813,
          -0.3303215740761418,
          -0.20415119149726782,
          -0.43228072321818833,
          0.39285940443198664,
          -0.5034582547156433,
          0.13125323072949902,
          -1.1893975591626762,
          0.4006444640704571,
          0.16773431322796512,
          0.06580304882441182,
          -0.09585118448313491,
          -0.345152479875005,
          -0.3833835399156416,
          0.23830033070474038,
          -0.09031888571058011,
          -0.3559204083054295,
          -0.29338863940413756,
          2.943942267197129,
          0.7209217675026877,
          -0.2526207006229059,
          -0.9447001912477866,
          -0.5922697894064748,
          -0.6102611415671557,
          -0.0828084299205885,
          -0.4701754743952793,
          -0.1600520087983062,
          1.7097419375549965,
          -1.8340374883558344,
          -0.3410177849479759,
          -0.3383061706244277,
          2.9338924397996773,
          -0.2766210285852227,
          0.2595574504242362,
          0.49079133264483915,
          -1.364608439126572,
          -1.244163852182608,
          -0.0449161219208853,
          1.803980567451121,
          0.7392160307732718,
          -0.6170617521364806,
          0.9498768245148057,
          -0.0693649860678524,
          1.9815346964872957,
          -0.9568249519508046,
          3.2341762120682533,
          0.3299894130102885,
          0.6324812468859685,
          -0.7051599917657235,
          0.1456078739452569,
          -0.3430922660511744,
          0.35363584913048696,
          0.7768258456020981,
          1.219060554277087,
          -0.5032046342144665,
          0.8366797482402774,
          -0.0215257923220367,
          1.3547294512072217,
          -0.5128031262250667,
          -0.5375997902054178,
          0.2862841154331258,
          2.7529081295818325,
          -1.444293591757106,
          -1.8404612220117116,
          0.8367090679224264,
          -0.05466208262129563,
          0.9666619785457293,
          0.643373678830444,
          -1.5975313215067442,
          -0.5138052119065097,
          1.954965701059183,
          -1.312649668374482,
          0.6451445865467239,
          -1.8370355394645634,
          0.9630130817759109,
          1.9630182266503358,
          -0.12221809776884617,
          -0.23942263343594156,
          -1.0802118227733972,
          -0.062422360936984445,
          -0.5330709001778112,
          0.06468093654824948,
          0.695064912399762,
          -0.8269732881465445,
          0.38059688874713116,
          -0.6496292211340483,
          -0.09682511317506802,
          -1.151857345430489,
          -0.5193387656509174,
          0.531424516502232,
          0.16676892091998383,
          0.7021783479515524,
          1.6072292881436043,
          2.8143591459446258,
          -0.7090342156492517,
          -1.0971653590140162,
          0.6629112527963974,
          0.4923358544173293,
          -1.229677922900555,
          -0.2552890195469955,
          0.6801036820747526,
          -0.8130388798071776,
          0.26818462748550664,
          -1.4143351928418912,
          0.2317334187327503,
          0.06133032262364806,
          0.22511245787347425,
          0.8530187015092158,
          0.26776528476189904,
          2.0058662330218864,
          0.7440055164905464,
          1.4031098306728014,
          -0.6341431317887589,
          -0.6248382496721167,
          0.7994830595458856,
          -0.19449718179794462,
          -0.012564860612679273,
          -1.5839159349485556,
          0.6800870361533735,
          0.7726623168839419,
          -0.30565973796369394,
          -1.1461898747057186,
          0.9199794802559311,
          1.9559950150637408,
          -1.2267342254453737,
          -0.7378428099317037,
          0.4330609553761782,
          0.4223264901490502,
          -0.4856185227398143,
          -0.36134620473217727,
          -0.038320244847309386,
          1.3446848944997654,
          -2.5079174574865983,
          -0.23336522558224512,
          0.32026102089356795,
          -0.9355087314684108,
          0.11644049699847209,
          0.390360638388507,
          -0.3656043943467909,
          1.9480858162491228,
          -0.28521033077686186,
          -0.5503240816132613,
          -2.350948244148454,
          0.012168341675248905,
          0.4033811560027041,
          -0.23119458894414172,
          0.5995299676173461,
          -0.40731675975241705,
          -1.2147548723316135,
          -0.8853197165676295,
          -0.1540664069985215,
          -0.3609218045646225,
          1.0271162852995492,
          0.930781119435012,
          0.7382357205946634,
          0.7925191550577612,
          0.9195578174742169,
          -0.9889583538337834,
          -0.5197726630538128,
          -0.34182867933270517,
          0.7464364659091182,
          1.1727726089348365,
          -0.6245410415146138,
          -0.5239835189254128,
          1.1432777113526706,
          0.8975113774833192,
          -0.5432240201466206,
          -0.7052196552823379,
          -0.41562944337406377,
          -0.14278034423839578,
          -0.44644134339362535,
          -1.1088494134731384,
          -0.10174069279561515,
          -0.020719392128893583,
          0.22643151005143644,
          -0.6924444672556609,
          -0.2983372517298819,
          -0.0803286186860718,
          -0.5929528781263523,
          -0.3276930090977442,
          0.5598609727079349,
          -0.22347124157347675,
          1.0466357922501426,
          0.623185291883697,
          1.014518070909349,
          -0.4522927786466812,
          0.1416992146789344,
          -0.08978357990130895,
          -0.032506423324660125,
          -0.8118240685900837,
          0.5902124380383282,
          0.06856068572800933,
          0.681829961514294,
          -1.081662953849144,
          0.4770637365280318,
          -0.3074832487869853,
          0.33714775965388516,
          0.1426752973570155,
          2.1335142340645907,
          1.7683831460273116,
          -0.20857926149175932,
          0.43905118770035856,
          -1.2905720037798123,
          -1.3294797849662783,
          0.5309280010810701,
          -0.2597258078388308,
          -0.911095309867921,
          -1.2450369723365655,
          -0.9451711748969686,
          0.43534172053203346,
          0.06846264698218656,
          0.03253325390505679,
          0.8996520743485414,
          2.1497116215773366,
          0.20748357945368248,
          -0.0483553890609191,
          0.920614415332497,
          0.40760281806286347,
          1.9098206067857184,
          0.08976649434042853,
          -1.0759061718368264,
          -0.3080775983286583,
          -1.2889264547540566,
          -0.2646518667734992,
          0.3339614968253504,
          2.4510898514461448,
          -0.4192610272885847,
          -0.04803652349209849,
          -3.4401959196791023,
          0.48810979650566644,
          0.6593386610017853,
          -0.12553788457776938,
          0.06830891571845174,
          0.2375980389400757,
          -0.037998433674674016,
          -0.21824709199415265,
          0.43410321759652054,
          1.6235908974267228,
          -0.21043376663635896,
          -0.016459887347627766,
          -0.5215146319621764,
          -0.07754201043930169,
          -0.2938157796477678,
          -0.6332478328138588,
          -0.7555742771950458,
          -1.1425015542390093,
          0.19517838330728357,
          0.3394363875455694,
          -0.458670355578928,
          -0.2290021527042399,
          2.036006414501266,
          -1.6901328820641537,
          0.8250671437152692,
          -0.15866042256824858,
          -0.10311984777084252,
          0.12113210874795516,
          0.7685756882821397,
          0.7851027457101428,
          -0.25047758925251157,
          0.9123607202045562,
          1.1236293735067455,
          1.3538569624594368,
          0.34162449332170464,
          -0.6630815114455111,
          0.6112425505329556,
          0.5346605324318062,
          0.4478563468307705,
          -0.6870480919095369,
          -0.9092604800369644,
          0.7776223737027907,
          -0.42764258681053413,
          -1.1922916935788257,
          -0.2307758986520153,
          -0.2935037444600432,
          -2.1738788613655915,
          -1.2969874721276726,
          -0.27013511114883865,
          -0.0472492937629486,
          1.7125317173589023,
          0.7683234588331491,
          -1.9921832086575901,
          -1.3725427794924019,
          1.2195232733136376,
          0.09931781858684173,
          -0.8761521824792019,
          0.18721045586417545,
          -0.012628224407578102,
          0.7446295714653174,
          1.2569956834193314,
          -1.049477452989346,
          0.8746027271962977,
          0.679245708720899,
          1.3375535857489578,
          -0.2867698486557259,
          -0.43353984226522474,
          -0.12572437655274357,
          -0.5050423595885198,
          1.2205555625824196,
          -0.9663908793710747,
          0.09565519028715208,
          -1.289057079603469,
          1.4882930101167855,
          -1.5119567651231915,
          -0.905531375806224,
          -0.8903381149263733,
          -1.9408108930316457,
          -0.254715882638546,
          0.49705426121515717,
          0.07611776899598112,
          -0.44650378361529613,
          -1.1559083654059472,
          -1.5844379489260698,
          0.055251496466820975,
          -1.0482478035821288,
          0.036498513021008976,
          0.04425909159713277,
          0.2621145334974533,
          0.16755445442925185,
          -1.9347618227397685,
          0.11482254932711886,
          1.0208411842308058,
          0.7394230579897674,
          0.5006384902397739,
          -1.0424619211070396,
          0.37716667350884525,
          0.1132357058725548,
          -0.2050664641980864,
          -0.4694201413038541,
          0.38135450568660756,
          0.9820719544511142,
          -0.0012931667668662616,
          -1.2806279688246451,
          0.5781577815721962,
          1.3484270397377043,
          -1.629401411166875,
          -0.8443593709360329,
          0.6147247235034498,
          0.1946906308886644,
          -1.4997552229862148,
          -0.5866292307045683,
          1.389764899663719,
          -0.8777338800624871,
          -0.17692691053633697,
          -0.972882323391003,
          0.04571325776757759,
          0.22800845370386966,
          0.10964287644341189,
          0.6867009753661327,
          -0.9679862100311407,
          1.3468660862018642,
          -0.3937880850163923,
          1.2298337915314983,
          -1.0670084833530709,
          -0.6255436699656338,
          0.12167900756932469,
          -0.74861434312077,
          0.642520711709836,
          -0.15715177920754175,
          0.16578500698665308,
          0.2679173026511116,
          0.565492786778931,
          0.7200795459942982,
          0.8714442869109114,
          1.7901635358465946,
          -1.0841275474781868,
          1.0219560829036298,
          0.36639308929730235,
          1.1988836799659424,
          -0.219814996383312,
          -0.3495524641793518,
          -0.9417051524847699,
          -0.07039925144812169,
          -0.9411385855230125,
          -0.3344486485029964,
          -0.30322725250468113,
          -0.3737821661879842,
          0.5376962560920123,
          0.23354250316446074,
          -1.67649433121839,
          1.023032230877939,
          0.9864644629922978,
          -0.2770742829334576,
          0.7470059310081935,
          0.04624827756396158,
          0.5253058299000762,
          0.16472455115857582,
          0.8918631514855061,
          -0.48552057967773143,
          -0.029214824711090704,
          -0.5738747596422681,
          0.0994632344130147,
          -2.054662240271997,
          0.4008302796513593,
          0.49335485904337173,
          -0.6807312668226793,
          1.0084491834617062,
          0.327077922323644,
          1.0385091231173185,
          -0.43991625757509484,
          -0.763847765944805,
          1.9732034956232016,
          -1.363392518922054,
          0.07359503443427626,
          -1.340348109763044,
          0.21330937860509533,
          -2.0625906063675874,
          0.2725019404456642,
          0.7309892310807594,
          0.056743035533840955,
          0.63051722858152,
          1.289244879783461,
          2.8209916846079026,
          -0.16548304006556216,
          -1.6626388326543085,
          0.6119493836797162,
          -0.18770923618815546,
          -1.07544207802019,
          -1.4696323950054173,
          -0.19536604862492443,
          1.173434356896694,
          -0.17291521795413914,
          -1.0799908044229583,
          0.8575029560033718,
          1.484388240635044,
          -2.200771371072062,
          1.167539572752407,
          -0.5828247422044651,
          -0.7276158804295405,
          -0.7362082003394762,
          -0.07130405008384263,
          -0.30202958424388077,
          1.2306428690353686,
          0.8134242621322784,
          0.612184452048361,
          0.1497322024255097,
          -2.137359455127577,
          0.12322134371543796,
          -0.5377819152799826,
          -0.32636511874245167,
          -1.0006234657236737,
          -0.6263814624664217,
          -0.8799389279187542,
          -0.22631712653906783,
          1.8378252364284573,
          -0.3456886409892567,
          0.654026232594242,
          1.153556074475646,
          -0.7920813128214077,
          0.8921851162177699,
          -0.10691207164718995,
          0.427024092448163,
          -1.0302602620843884,
          -0.0562403865030124,
          -0.9681890511077688,
          1.1649406293371467,
          2.033373896740323,
          0.5202213229179198,
          -1.5939709640038344,
          -0.2826279027494882,
          0.2573151404522593,
          -0.20513035552196499,
          0.5180691568348689,
          -0.1180033259715666,
          0.6513439041567338,
          0.41947319015932366,
          0.1957689445579562,
          -0.49224066001543376,
          -0.8835192039943545,
          1.5705196484549948,
          -0.9584386806089579,
          -0.9836690694327191,
          -2.890940316454113,
          -1.1535499212439637,
          1.0333642015347217,
          -0.4258568836614113,
          -0.2594267158899043,
          0.5978783059062671,
          0.45735735286721557,
          -1.1419401701443463,
          -0.9165752110342054,
          0.2837767251980367,
          -1.253322553949338,
          0.09830248689485706,
          -1.3246731520038197,
