{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "17",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          -0.7400108138599004,
          -0.571257112800311,
          2.072282167367354,
          1.1514967830014022,
          -2.028799896695485,
          -0.6837924705209335,
          -2.888564347016692,
          0.35415345062525433,
          2.5586794434505027,
          1.1793033552661725,
          -4.0316290117039815,
          0.08206057851389238,
          1.4928703627356228,
          -0.3226727690189765,
          -4.034024606714572,
          -0.7197115663678809,
          -4.469201259549769,
          -0.37659068021624925,
          1.6001518892734252,
          0.22936796222610273,
          1.5350747773217057,
          1.1831297177746563,
          -3.8432969615249113,
          -0.5874106977835485,
          -2.310429967506148,
          1.5901516785782808,
          -2.9994104551617773,
          0.6240556062624466,
          -0.4452070062302954,
          -2.1830592353606515,
          3.767932278452408,
          -0.9535892518793373,
          -2.102245537769625,
          2.7749714529460534,
          0.19261013945990954,
          0.8340432254897236,
          2.466044447642988,
          -0.43586256093509057,
          0.012643392082705637,
          -1.9636370382317594,
          -1.2405951736982126,
          0.5349719008287939,
          -2.7257058082929135,
          1.7106096769583363,
          0.003481096160115677,
          -0.9753709633326895,
          0.949792824498825,
          1.7702710982177754,
          -0.20798551248969366,
          -2.3793466389348072,
          2.0809714207572245,
          1.4445795902028982,
          0.3959386860350046,
          -0.4577812953008724,
          1.854722055576684,
          0.12132819198879556,
          -0.742993597591526,
          -1.3708579347997532,
          -1.1180729861034386,
          -1.559947317747576,
          0.7037419314725895,
          0.05000464528551031,
          0.6627523512283994,
          -0.2966059505520788,
          -1.1515924663698822,
          0.22487730358880215,
          -0.8473111927690303,
          1.982783424192689,
          0.08864343299654263,
          1.8850204860847308,
          -0.7252177407921829,
          -1.6721795497202143,
          -0.7789023571432616,
          0.4498018781844996,
          -2.894779277047122,
          4.163491534119534,
          0.0815673524993262,
          -0.4396638773955683,
          -0.40660337449758727,
          -0.9316424815336997,
          1.834645385145086,
          -0.21053041785280233,
          -0.3320245278838965,
          -3.5499914949637925,
          0.9172511030926804,
          0.10524394474818709,
          5.125960523684969,
          -0.03423340809108303,
          0.9898959496410441,
          1.472019537756225,
          -0.46775682954806563,
          -0.8356886084445913,
          2.5293211974710585,
          -2.1504653949915857,
          2.576649147269703,
          -0.5751341234502039,
          2.4079234468509654,
          0.39522058841802843,
          -1.5281959006127925,
          1.5023779335374081,
          -1.6313013292023857,
          -0.6612217951841368,
          -0.14136686819557942,
          -0.32905663551766773,
          0.9122417134792545,
          0.06799630026924841,
          1.0921075576091928,
          3.4786734477233083,
          -3.5871957053318813,
          -0.3435793737153633,
          0.7505281337080529,
          0.2878256606564236,
          5.667175560954642,
          1.6085068244587757,
          -1.2084398604219098,
          -1.5830675988293208,
          1.4920920605081724,
          -0.4146653301756113,
          -2.5804227927675547,
          -0.27604626808673677,
          -1.1474337325687072,
          0.11579530245681495,
          1.4998956150893776,
          -5.187062002591643,
          0.8841311977944136,
          -1.1721612958400711,
          3.2180565537658143,
          0.0785658863181478,
          1.2534610296886228,
          -4.268263062508476,
          0.14009702481940706,
          -0.2339871399892458,
          -0.11222727631006811,
          -1.1920245237661102,
          5.381830109689092,
          -0.45997562654594304,
          3.2034191635716507,
          3.922189080397029,
          -0.5844860010952997,
          2.6270573993695305,
          3.4518589915516595,
          2.702246545196138,
          -0.8742634003160704,
          0.7463045468677832,
          0.6966763591321278,
          -5.093590988242095,
          2.5922749725664924,
          0.15988404914981091,
          -0.706777240899511,
          -0.8674295834754758,
          1.2447151656823687,
          -0.24447466058186287,
          3.460866005422888,
          2.7855591508164457,
          -1.9854066611864454,
          -0.9398792091388558,
          0.36976897084756083,
          -1.1904517261029088,
          0.785539530911644,
          5.425672405805081,
          -2.4741593989879136,
          -0.14440670190140514,
          0.5236578798620972,
          2.6601442755483005,
          0.04847821050137384,
          1.045624336481799,
          -1.90003883028817,
          -1.7102485121252249,
          3.0678423573923994,
          1.3277558927221629,
          -0.3418458329893448,
          -3.1244214711929392,
          0.08515532478862112,
          -5.31628436679721,
          2.8825753703205943,
          -2.5169936560716337,
          0.6757260833752062,
          -1.1044377611465115,
          2.1404694229405217,
          -1.3872067283284022,
          0.22767105071677043,
          -0.6971087886074682,
          4.4804046033562965,
          3.1433380152120027,
          -0.3090566812832809,
          3.470513142012302,
          -0.271341773128056,
          1.3064849907676372,
          1.5947413941108677,
          -1.584659818309137,
          -0.9807763115369712,
          1.267305581305807,
          1.053856121066947,
          -6.536623766037261,
          -0.6863900592712671,
          1.5654156896479416,
          1.0361307448317238,
          -0.5707927345900438,
          2.671370876143919,
          -2.4110253836030036,
          -3.1794694348462444,
          -0.5684597263288778,
          -0.6377315058678408,
          -1.7742445022647657,
          -1.8629583976378679,
          -2.6191516686480925,
          -4.967781309707699,
          -2.778918979993372,
          -1.7161028635513529,
          1.8909843193020908,
          0.4964156506267028,
          1.2437233388222322,
          0.7635352414019818,
          2.590880824158734,
          2.6201616230239675,
          -0.06417455978097013,
          -2.13867120933774,
          1.635029987892895,
          5.263983810816927,
          0.5919602515356464,
          0.6756379277478537,
          2.2011360025971483,
          -2.4429092336587797,
          -1.6614079682612557,
          -0.9892545288136472,
          1.1446637068540084,
          2.951334876564914,
          -1.9840887422397662,
          1.4409816076444217,
          2.3872412403697925,
          2.290218091330223,
          -0.5404744014365748,
          -2.233012700185679,
          -2.386087011147104,
          -0.34070809532879914,
          2.4452055731421427,
          -3.15717878959105,
          -1.200502095746577,
          0.7985147599109705,
          0.8235370888439991,
          2.014720854862617,
          1.6975515228399491,
          3.4931124120027572,
          0.5000387263898005,
          -3.34393949491868,
          1.5968290462786512,
          0.876273033854672,
          4.601769452402673,
          -0.45222470338024956,
          1.3646920596340126,
          -1.7623171760307577,
          -4.143506972817102,
          5.346100139786313,
          0.4651330642300482,
          0.813667867098423,
          -1.5664827779609842,
          0.6390866859720407,
          -0.2291773715458962,
          0.23860848670884346,
          -2.98639331643867,
          -0.33427573832200036,
          1.062677748100904,
          -0.34048523255060037,
          -0.5402307674926092,
          2.3774988152534893,
          -0.753567348155048,
          0.1481880648523392,
          -1.2091693585096426,
          0.19132246016242413,
          0.14943681278377074,
          -0.700295706804955,
          -0.4069027420628288,
          4.174523602872733,
          2.610120164150944,
          4.49966675389942,
          -0.5916509319343831,
          -2.7339607679285147,
          1.0236515149698788,
          -1.3412297929281758,
          0.16948863634001834,
          -0.3264850116814792,
          -0.7096904486053114,
          1.3239264031847566,
          3.349738006674573,
          0.9056881181172259,
          3.062803382969222,
          1.8339556709520606,
          -0.20093224316162062,
          0.8446780106862463,
          1.1810564631167606,
          1.238458108946515,
          -1.092471675935442,
          1.1823454118902466,
          -0.20216620381649777,
          -0.08538851732257885,
          0.6193452885151709,
          5.629932350939042,
          0.38327287521744685,
          -0.37711734003833886,
          -0.027243341805003665,
          -0.6201210187145377,
          -0.5547680188810878,
          0.8569905592688903,
          2.517323172200124,
          0.2333149924858699,
          3.0767613836813794,
          -2.756930671323129,
          -3.503245687790098,
          3.8452187340930344,
          -1.771859138699067,
          -1.7783860059249015,
          -3.5870646311593766,
          1.3034325721210769,
          4.65066521406972,
          0.5933937299961002,
          1.3616398905038178,
          1.251384044932078,
          1.6563376695833965,
          -0.8127418862712786,
          -0.33048181389219927,
          -0.19964203111622256,
          -2.0053822883937,
          -0.27593283752541997,
          -0.9787307282817352,
          7.299897434581848,
          2.840731177291577,
          0.4909864784269672,
          0.5586722473924074,
          -0.49679210906721316,
          -0.18723958193158366,
          -0.3615483258532127,
          -3.3889601471346262,
          -2.2883978327633416,
          -2.070266959826311,
          0.7988875742555257,
          -2.0912889804797414,
          1.5316418674155998,
          6.883229908616474,
          2.216812130130872,
          0.721861027117735,
          -3.521324829684241,
          0.6501706626263813,
          -5.5866795165739,
          -0.27102667076513204,
          0.9139456376329631,
          0.726488701500589,
          3.406264024726337,
          -3.186797127391627,
          -2.289819483200522,
          -0.5609328378294712,
          0.08112379749469856,
          0.18078761335602894,
          4.6920660339962454,
          -0.6778063923050215,
          -2.5120112577176603,
          -1.0592058269596598,
          1.4220395974383386,
          2.170821193251557,
          1.1559627161647685,
          0.31681934787092436,
          -0.8743426884629346,
          -1.6056420930379094,
          2.2811950568829,
          2.660687411087492,
          -1.425640603933786,
          -2.3950182456208253,
          0.6776240860564633,
          3.1304015303486583,
          0.8347381477473645,
          -1.583951584933652,
          -1.972713138499585,
          -2.074429210389558,
          1.5649247414181628,
          1.1432471016519807,
          2.442786715453781,
          -0.7602232064499894,
          -3.8707033742044787,
          -0.6254084412309904,
          3.094633748300955,
          0.6991507906654729,
          -0.6689227428984207,
          1.4370350426893193,
          -0.7978130714557634,
          1.968433741887282,
          0.6532645018688633,
          0.93982508221597,
          -0.5604111360440056,
          -1.313752612102582,
          -4.11438721637854,
          3.154485457884247,
          1.0560394549536276,
          0.520325497141616,
          -0.35493674968249284,
          3.8483212646985177,
          2.494772302765771,
          2.611355289685014,
          -0.9596693997855258,
          -3.5664828931788493,
          0.0069400198732122624,
          0.13428222206915055,
          -0.7004305038929008,
          -1.548975923153077,
          2.080160479175467,
          2.9881510568724154,
          0.0270052872633063,
          -0.8489558835135579,
          1.589138458619286,
          -2.301921367217301,
          1.3828661136316804,
          -1.295864528197516,
          0.292839051450378,
          -1.0686465876065911,
          2.2564873548649675,
          -1.5440977941415284,
          2.439085510365164,
          -2.6855017570771675,
          0.6142816522200149,
          2.5832328112566367,
          -1.0252605330629794,
          1.8224094330669125,
          -2.3330475641612263,
          2.076506086110351,
          -0.013087064852518638,
          -1.2746524313399556,
          -0.8782223694038959,
          -0.7832748667848188,
          1.192544608251622,
          -0.7515480849940809,
          -3.0497451443939236,
          1.5854264523235064,
          0.08707599808203904,
          3.6359494997187523,
          1.6791216408697534,
          -0.04533256930207021,
          2.48646262321832,
          1.0988547778801543,
          -3.922709888012772,
          -0.7184303898157636,
          1.4127222865128237,
          -2.6152113266560355,
          -0.15499663135926853,
          -0.8165615472900459,
          -0.45581601097404256,
          1.9479155858566897,
          0.12007033594609853,
          -1.2817178458949408,
          1.1719792490262655,
          1.1378220362874105,
          -1.048125372356354,
          1.6522095943007997,
          1.3834738545223988,
          1.7061683141035864,
          0.33510297431809594,
          -0.4662067626251506,
          -2.227826912517594,
          1.3647785507001207,
          -0.22592079281536945,
          0.62199234272135,
          -1.4922058641391027,
          -1.8888189695953201,
          1.3341671346664106,
          2.5535079885164587,
          0.7973336868201192,
          -0.131130642877707,
          -1.3466405831604658,
          0.43582493001462547,
          1.8529701102201477,
          2.541660119800637,
          -0.7645613766632977,
          -0.28871803950641606,
          -0.7653110828317944,
          -2.4240669169233984,
          -2.827556363714129,
          -0.19191962544225527,
          2.3632114765658985,
          -1.2677931195078145,
          -0.7658081311053738,
          3.068790114206503,
          2.9977078576518554,
          -0.5442164751537174,
          -0.18859264554491947,
          -0.5300393348682831,
          0.33834076811281844,
          -0.27689179887295023,
          -1.957888760781775,
          0.48220853787598544,
          -1.3733022986909162,
          0.06648025741154157,
          2.721190742740912,
          -2.2564101718617433,
          -0.37296779143774045,
          3.031279932441544,
          -1.7296388012376511,
          -2.4184257723222826,
          0.5436013260000094,
          -0.5278624674162381,
          2.235916238457976,
          -0.3018464813132272,
          1.776769448518356,
          3.9806329844983326,
          3.266854569211334,
          -1.6886713633068773,
          -0.20866562396304766,
          3.52277384105402,
          0.34794820226957096,
          -1.8760005892412703,
          3.3527796654854454,
          2.2030375543175036,
          2.0172800112090075,
          -1.1955829311326989,
          -3.978530334855318,
          -0.6885968028435616,
          2.184171476908209,
          3.175510066471722,
          -0.014654618394317514,
          -3.8168698226401334,
          -1.6658101347945076,
          1.2700954233767612,
          1.4509899688558232,
          -3.7015003552992414,
          1.4386932744181338,
          -2.1010876443002022,
          2.6196935016002336,
          -1.339845931590389,
          0.6187511737355291,
          1.3262185191538578,
          -0.44947246925284706,
          -0.8956451711821125,
          -1.635918958745164,
          3.8169604152869896,
          2.936556728069577,
          3.3963273856631035,
          -1.3885801400685072,
          0.5987314691069475,
          -3.274933336434614,
          -0.7472738133418906,
          0.07730767779134338,
          0.6868234104879227,
          1.080459714861065,
          -5.236610129867116,
          -1.1261815231039516,
          4.410684213806973,
          -1.2875559580828697,
          -0.6569956956886643,
          1.175789141648767,
          -0.12938498604737655,
          2.4093454657415005,
          1.9987562948430415,
          -0.11936840401559455,
          1.7882551514905156,
          -1.8698476435913252,
          1.2308090610447553,
          -0.18646631981150344,
          0.1581655023105696,
          0.8426976936519862,
          1.0259829005606802,
          1.2332196642894586,
          0.33191417002959606,
          1.2620768134480176,
          2.0366311085408255,
          1.3306419366100073,
          1.7383841361533905,
          -2.7900081040849645,
          -2.425771928522717,
          0.698824944367851,
          0.7215630481909621,
          0.04557850849538976,
          -1.0062330454966226,
          2.7362390151964595,
          4.265077323290474,
          1.2145094369705298,
          1.190404937099505,
          0.15434765833859793,
          -3.0970530288268936,
          2.48551215340214,
          -0.7065991898924218,
          -0.8408111837091559,
          2.3669043291885403,
          -0.7545403176638931,
          -2.2821142360903353,
          1.8418569078280727,
          1.854021906156173,
          -0.42204810767696904,
          -3.662167639793842,
          2.467719579793547,
          1.2647047714039092,
          -1.7331441572459811,
          -2.1893412064376023,
          -2.590578145855601,
          -1.3998417808485937,
          -1.1645409528833053,
          0.3328220962041356,
          -1.0395698110240406,
          -0.6565866087769529,
          2.766994280002088,
          -1.120815951688308,
          -1.3086874223629372,
          -2.2469514029998576,
          0.23288608253610216,
          -0.3341946535531295,
          -0.8113799824757041,
          -0.38078874505408233,
          -2.0159372012492356,
          -0.7373085487525837,
          1.3895456774611465,
          0.4436795391882155,
          0.9494155370324584,
          -0.7143774660225192,
          -0.13465976188881187,
          0.10427119295806417,
          -1.6192358552886335,
          -0.006564981555170364,
          -1.537498021602113,
          -0.34007807253245165,
          -0.17725347035798777,
          -0.09346373777686742,
          -1.5408381931030717,
          -1.4616090837531346,
          -0.36015295032670114,
          0.3146625734229267,
          -0.6516966611036686,
          -0.05373479885630778,
          0.7458001195415757,
          0.21534496419805857,
          1.570854209408304,
          -1.9926956593118477,
          1.6362201210153153,
          -1.1973800660716891,
          -0.5918818296250201,
          0.3862005342468786,
          -1.3004997793526223,
          0.5372540061144985,
          1.8753349202899179,
          1.51172653217179,
          -1.0210314982506223,
          -0.5852644556405113,
          -1.8977499911852604,
          -0.6684269858854281,
          -1.7578502675873053,
          0.7608583766858382,
          0.14605330439613626,
          -0.36606182382319535,
          -0.6547062939083593,
          -1.0972877281030466,
          -3.261854216640663,
          -0.6430400154207451,
          -1.794353051245926,
          0.5878480862001754,
          -2.620547435212309,
          0.1367351247675485,
          -2.9058514644476707,
          -0.015099772759439191,
          0.734945572914416,
          -0.013136028708672153,
          -1.4441825054427844,
          -1.2169010665816802,
          -1.4868576152982096,
          1.0122375338404732,
          -1.913520943001757,
          2.411612418336238,
          -1.5304148118447496,
          -0.46702497856689507,
          0.17436145878021178,
          1.09928832446472,
          -1.453015705092894,
          -3.2954839964464084,
          -1.7715357410380383,
          1.5678225228934557,
          -2.5992452012555525,
          1.925504043830205,
          -0.8696203813892737,
          -2.6219429904552842,
          -0.6160047331428954,
          -1.8825424883027317,
          -2.797382734322119,
          -0.9737485904180228,
          -1.9439541827538125,
          -2.5755401218785354,
          -0.9017839487058924,
          0.8127736413532238,
          1.1470604263262905,
          1.073724289801701,
          1.7389554486207588,
          -1.0107403589369195,
          1.9803050907925248,
          -3.6552482696524664,
          1.9517771718907673,
          1.0905695402319855,
          2.952000263869367,
          -1.257683105406008,
          -0.8090868056804537,
          1.9128480260185399,
          -0.036738279088358416,
          -0.34728360849100776,
          1.8254746415999166,
          0.31167621703342413,
          2.0624538845263363,
          -2.9510694794067063,
          -1.1509794073011215,
          -0.8960195183221148,
          -0.366276142945737,
          0.6097403477190453,
          -2.9995587322533694,
          -0.584307724012233,
          -2.1779352521274453,
          -1.7268785648009597,
          -1.823878123119344,
          -2.563705655143474,
          1.3720194532810144,
          -3.0492854870608577,
          1.294616434258228,
          -0.365011543759481,
          -0.6549182770801368,
          -2.6032206807205323,
          -0.07017898332613913,
          2.8065370041117745,
          -1.4827171309572913,
          -0.6821797764407207,
          1.50291303871874,
          -1.4321381435562484,
          2.0991237030664407,
          -0.4520771354229139,
          -2.7203859932245624,
          0.041665566529689786,
          -0.3297859414767599,
          2.1837567248772656,
          -2.5655890235034056,
          2.7121044214739016,
          2.2852797900877357,
          -0.33141318687720833,
          0.6614714495040224,
          -2.1114996914595414,
          1.733874808650726,
          1.8869949757145839,
          -0.006676659299037884,
          0.032755350987283806,
          -1.2990680244866046,
          -0.0921127800168148,
          -2.1089321090282525,
          -0.03637580252671278,
          0.7253370136830665,
          0.5836827775370453,
          0.6976802438809625,
          -0.135441901046567,
          3.8733284317082504,
          3.9649063481509343,
          0.04882092846983283,
          1.6906731632869167,
          2.204766533875859,
          0.6686522985811147,
          1.050210419601817,
          -1.4319900244282402,
          3.456259139741995,
          1.3120823135406092,
          1.3200797304871346,
          -0.29811166488419505,
          -0.24942595038823387,
          1.174536317183727,
          -2.674199216924446,
          3.45716332599046,
          0.8689605860137446,
          0.5682145693029492,
          2.0207429075063956,
          1.8528626345582089,
          -0.0032453174979854473,
          1.138083023082309,
          0.37780053960502086,
          0.8340342311365989,
          -0.11288252735195596,
          0.025673568377346037,
          -6.305437651959229,
          -0.35008460513494183,
          0.3592119434386969,
          -0.8999414904305288,
          2.0359279892974995,
          1.328646673720315,
          -1.4336247650756808,
          -0.7302032761347853,
          -3.10106657332971,
          0.6053683381139405,
          -0.36672235862272523,
          -1.6069659041217745,
          -0.12295504194897397,
          -4.571104438580488,
          0.6570149293424573,
          2.472442678155688,
          1.3863617244435318,
          -0.16775414039886904,
          -4.600300038798567,
          -0.4267083021721557,
          -2.1753894945485004,
          1.8571502148520829,
          1.4025969099651379,
          1.7082227218683863,
          -1.1780734142720595,
          2.0829182390551986,
          -0.9613004311377817,
          2.3291038924305836,
          1.5485650965200206,
          3.1558920425993144,
          -3.503218382368926,
          1.166714341537588,
          -1.597625762411566,
          1.3884353023572962,
          1.4928591226455334,
          2.985571914130669,
          1.4580813898459135,
          1.4323504441655488,
          -1.746886167731756,
          -0.1735342272801667,
          2.2574589721113,
          -3.0323672829386283,
          -0.12056844062671378,
          0.7614747973348047,
          3.3721759171745953,
          1.059943894122528,
          -0.3591430185194854,
          0.5492851467864935,
          0.5360290734124716,
          0.8000444483734279,
          -0.0914617624178289,
          0.6783381551667184,
          -2.192510555921662,
          -0.35002156422930303,
          0.9192467650833702,
          -1.6494200022637406,
          1.7187580854443267,
          -2.1371647945837733,
          1.1524095887160837,
          1.715020837731889,
          -0.7275728852870089,
          -0.8691588554901434,
          0.9629134170154148,
          0.52018443740213,
          -1.1044643973140322,
          -2.139513233406089,
          -0.49467952470295545,
          -1.1878334018246823,
          -1.4688154942230043,
          -0.5315438510839428,
          0.23012632178218384,
          -1.7747487174934828,
          1.545597364516718,
          0.4762719954936975,
          -3.2257614651721416,
          0.44197234842444166,
          -1.2047795460211612,
          0.8197172916343376,
          2.0340891430223675,
          -1.087074073537921
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          0.17089037584560007,
          -2.9651171145432724,
          1.1962887680222622,
          0.40769102199170243,
          1.6866585444327942,
          -0.7122347468895823,
          -3.567670180965937,
          2.2997143262455766,
          -0.6464268148246239,
          2.8049433542434343,
          -2.8774442369380497,
          -2.1907373459346546,
          -2.1420501700777868,
          -0.5313337686743803,
          -3.357238769659827,
          -0.517065896980012,
          -0.0027944725878736943,
          -0.19216656320358255,
          1.9635641432451272,
          -0.06901949107872163,
          2.215680907444811,
          -1.226108429053776,
          2.32189387574315,
          -2.698104946027525,
          1.8937307431827883,
          1.2058846282093365,
          0.1102409305074752,
          0.2886562546627021,
          -2.3051339958894377,
          -0.28005862121312614,
          -2.577514304626402,
          2.6051988733068816,
          -2.8482330296279645,
          2.039719519876594,
          -3.6116407389736347,
          -0.9596870620019835,
          -0.8698313164476106,
          2.4470732786028497,
          2.3924257058374145,
          -1.6782922451902786,
          -2.4254175638093165,
          1.21589799564295,
          -0.29453036876816957,
          3.440247901126015,
          -0.7463722496046434,
          0.03445479480375661,
          -5.022947005659057,
          0.4737296939213156,
          -1.684492510377213,
          0.8029648338392846
        ]
      },
      {
        "dims": [
          "50",
          "30"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          -0.9910807382667483,
          2.7680233142315593,
          0.4369568818651719,
          -0.15872723343563164,
          0.34379494891328954,
          1.5645716920030073,
          -0.4337990985496502,
          -1.949796109841411,
          -2.4682612708962735,
          -1.2022261525755409,
          -1.6367800609258796,
          -0.1746557303400184,
          -0.6627305291499378,
          -0.6626475224737538,
          0.6970599290051579,
          -0.8553399308826798,
          -2.0435853207278982,
          0.930789195182471,
          0.8943812095314383,
          -1.5615628430931685,
          -0.3043256227029431,
          1.1983383132602186,
          2.617697149042129,
          0.18423352044705843,
          2.1447557275446165,
          -2.0729280764023086,
          -3.364649958659383,
          -2.704250300499935,
          0.6946824781494957,
          -0.5479710638071944,
          -0.2778369694145651,
          0.8170424840793943,
          -0.2314288460688715,
          -1.1221954972173787,
          -1.6481724888648766,
          0.4983407610277996,
          -3.6900567509735827,
          -0.42113909972722396,
          -5.455666473295427,
          1.9363929006855585,
          -0.9641083818345163,
          0.31384633558304437,
          0.5379891658707591,
          -0.060876755973460414,
          -2.3651424693611274,
          -2.2154953646971554,
          -1.9257052716666077,
          4.394920340013673,
          1.2628392923734115,
          2.402718569014876,
          0.1186351532052274,
          1.7442415132992017,
          0.39310545312916073,
          1.2745522979380568,
          -0.1985330838503208,
          0.4779016736681773,
          -1.109040943616597,
          -1.1380264579080805,
          -1.8512248729393876,
          -0.8602297178529433,
          -1.143918181364987,
          -1.8046848377248677,
          -0.8937329524282979,
          4.084693179492265,
          0.27416219533409364,
          -2.1287585304372483,
          -0.41584013435687645,
          1.654610364961147,
          2.1123125022302887,
          2.1113185039950557,
          1.1187470923783673,
          -1.0827198135301712,
          -1.9183352457904785,
          -1.088578449164204,
          -0.5879683129148243,
          -0.8718028387161741,
          -0.6501643984608223,
          -0.030287023863631805,
          0.3880912920508148,
          -0.23046832936969058,
          1.5058891850804892,
          0.987850471580065,
          -3.924293093608524,
          -1.4121611880693938,
          -0.03338440297137491,
          1.6411272279257296,
          0.6835755820572501,
          2.4675276154088146,
          -0.4741705338622966,
          2.1199955011642055,
          2.8836557429724854,
          -0.07813803531400945,
          -0.8386602136211844,
          2.1507098519607246,
          -2.4257415351414564,
          0.6942765693527495,
          2.7417464155404545,
          -1.669030468974154,
          0.10638146722182862,
          1.1409311293150808,
          1.6073863206680787,
          0.7239849990051197,
          0.10034591316029709,
          -0.41441357905623644,
          1.2427507898594712,
          -2.0718450205144108,
          -1.3937762428242078,
          -1.020591791578357,
          -1.0444857898647548,
          0.06102550099565096,
          -0.6052541768048295,
          -1.199762821632475,
          1.6998523453810384,
          0.3901860149886062,
          0.36641395359325984,
          1.2324728115309458,
          -3.482884630976912,
          -0.8120380261295455,
          2.20264014024061,
          -0.06671450531631974,
          0.5416772882881958,
          -0.5580410965539376,
          0.4565828874526126,
          1.0731895148233406,
          0.6236541067463134,
          0.4700780047807842,
          0.9039130302099565,
          -1.2951038135447437,
          -1.0798736886570202,
          0.45065666822499106,
          -0.7186182244621176,
          0.8535675644849491,
          0.44356459328863196,
          -0.28150566923160997,
          0.5372610752345188,
          -2.1988618296955815,
          -0.8338914726417508,
          1.1436376469490086,
          0.30182774376872334,
          1.2524127779946579,
          1.3589692007652057,
          -0.7382474208846851,
          0.5869359562848526,
          1.0046482316341667,
          1.614240651964788,
          -0.43848059206282575,
          -0.44679113445775265,
          -0.21446576067904602,
          0.42368641547335567,
          -1.7691980798155562,
          -0.25024693327894393,
          0.49081174814368417,
          -0.24852086618903652,
          -1.1344203004703501,
          -2.1494440369249284,
          0.7570435165412223,
          -1.6717217022326678,
          -0.33893026595707226,
          1.1614980073206282,
          0.46683005614234147,
          0.6664378742376635,
          1.9167840814720727,
          -1.3508548296556933,
          -0.8349119440983276,
          1.2297016924983821,
          2.9480062889171728,
          1.4470579792723028,
          1.328553438893281,
          0.4543941912960057,
          1.2127242317890397,
          -1.3365071635023023,
          2.8199701780855926,
          -2.0460693929041405,
          -2.48971610931201,
          0.2529178444669282,
          -0.7481708284556211,
          -1.3475315658504847,
          3.2771952452047812,
          -1.1996880209646699,
          -0.3813453514646784,
          -0.24790082618150303,
          1.3855391137668793,
          -0.08087366541153317,
          1.0711067058391701,
          0.6729920726074764,
          -0.41372680252924343,
          -0.7241888973171293,
          -0.6222820430088039,
          1.5061749725326377,
          -3.400008449303193,
          -2.295999941966188,
          3.4691445347174183,
          -0.6461075025942417,
          0.7647237320875836,
          1.6764595797358919,
          -0.6828559659014426,
          -2.3081460803763694,
          0.7048680532440701,
          -0.4562856776336257,
          -1.5666662769258106,
          -1.6332763018197158,
          0.9616500634260137,
          1.7465432468678395,
          -0.39209967724573896,
          2.065609788815505,
          -0.9563736632848071,
          -2.132211483925462,
          0.6906909945594433,
          -0.5147716376232986,
          -2.1649438298849866,
          -1.626020046188802,
          -0.7494156029096133,
          -0.6353832908973736,
          -1.2032285581027764,
          0.8598847580319879,
          -0.0495980766959916,
          -2.1165469024137433,
          1.5809272026265933,
          -0.884816540123302,
          -1.0099912509055402,
          -0.21139782099310014,
          -2.292477677198975,
          0.7014783449737865,
          -0.6726926454487547,
          0.06275536085494617,
          2.42784662095316,
          0.12221347654592651,
          -2.586593247037375,
          0.4256593296295814,
          2.6813202757264354,
          -0.7640608958908749,
          1.8161246742681574,
          -3.5170276011160615,
          -0.8297036247016706,
          -0.2550509153091505,
          -1.7790398742530424,
          1.3932191892246444,
          2.2995429193195176,
          0.09853909081700332,
          -0.33385742829092824,
          -1.7261671567730157,
          1.6529804444949656,
          1.0079725296748072,
          0.4521546636341144,
          -1.3657380232815555,
          -0.04645225910016467,
          -0.7245164691350652,
          -1.5432667806915152,
          -0.4464496797507696,
          0.1916518435015324,
          -1.5149285839296778,
          0.15856238293800354,
          0.3279162750068503,
          1.263627011972697,
          0.976880051321128,
          1.2339239278409877,
          -0.6271782681927963,
          4.803152322501724,
          1.1495848267293398,
          -3.715432103751949,
          0.9068861430911562,
          0.29102852014349356,
          1.2858539564236116,
          0.9669652002758481,
          1.3948811221204769,
          1.5384954412295395,
          0.08961751679161692,
          -0.15808798545117111,
          -1.5647258286302916,
          -1.2087771894507113,
          -3.280662031109015,
          3.0775733202614077,
          1.1499672649830337,
          0.496602405660473,
          -0.7016776187652667,
          0.41808419755443293,
          1.21172901118056,
          -0.87429862918978,
          1.231073213158902,
          -2.132418826555669,
          -1.770743396754211,
          -2.093125115888204,
          -1.6676859899241676,
          0.735222457383488,
          -0.48851261671973195,
          -0.9700970572016268,
          -0.3826698367304586,
          0.9817790606609174,
          -0.03256465262154759,
          -2.0900664184059687,
          0.16811946729619856,
          1.8217347628523775,
          0.8898306389948742,
          3.1705303858150122,
          0.2690029815423199,
          0.4939017772642105,
          0.6031098549345774,
          2.420151204607114,
          1.2299960800871454,
          -1.9067090266758104,
          1.6337747104614655,
          1.6041253288597708,
          -0.39990809264813365,
          1.9233631677722516,
          0.48716918560536615,
          -1.3598457638594637,
          2.4191509353250513,
          -0.6450926394513995,
          -0.36059554537553895,
          -1.270342583564201,
          -0.637576433895642,
          1.9345502760327928,
          -0.5663818941702476,
          -0.4940647194795626,
          -2.1699878158658907,
          -5.16595965691758,
          -0.7320717430509041,
          -1.565274806940336,
          -1.212607182917683,
          -0.9738668640484885,
          1.1835386268791068,
          -1.1765964030193437,
          0.8389219150140111,
          0.416206437114182,
          -1.5362349432211855,
          1.201857217168596,
          -0.14601205408571302,
          -2.058434159471508,
          -0.6120864126823438,
          0.7725299741348213,
          0.3169512386145783,
          -0.7967764633628683,
          0.042151231986660515,
          -1.2892399415442983,
          -0.8845577108892033,
          -0.8528686025626863,
          0.17923288832229098,
          1.7807864946708816,
          0.10786382450387841,
          -1.546689234770128,
          -0.014668242043456332,
          -0.5606274366954663,
          1.4473406879743984,
          0.9570808424105839,
          0.009637753985345695,
          2.106122272632795,
          0.630164587055956,
          -2.268953154189315,
          1.7807451501600362,
          3.3575918428459035,
          -0.21126964751257624,
          1.2935446437089886,
          -1.6346799228155828,
          -0.7741298309006852,
          -1.3529725615124764,
          -0.18951445170333595,
          -2.1380106467500486,
          2.0448618946965755,
          -1.491805317524086,
          1.65504216712793,
          -0.3305163501574392,
          -0.992492873301,
          -1.1794252086991452,
          1.4086310500205186,
          -1.715836894415269,
          -0.027500698900385645,
          0.715579752278563,
          -1.373691219966896,
          -1.1513423448908802,
          0.24055511064688195,
          1.811136145182066,
          -0.5686228355314553,
          -0.7869391645476164,
          -0.8016899348940129,
          -1.9650580944487464,
          -2.552807461210554,
          -0.007155878400314674,
          -0.6163955286539996,
          -1.153902694223432,
          -0.09648977046353163,
          -2.352067719528481,
          -2.617955687433897,
          3.0003801203948117,
          -0.0656344959429504,
          1.5092201245460388,
          -2.087883377875637,
          -1.34629744783345,
          -5.368673225792291,
          -0.2364787977281662,
          0.3584452016862113,
          1.1321427795750014,
          -0.3361607938249063,
          -0.5275486467414032,
          -0.9015082201025413,
          -0.1662568303357984,
          -0.04887466896069199,
          -2.023645152212662,
          0.11613843992388397,
          -2.551968474399338,
          -0.6526792191837091,
          -0.18783478557387795,
          -1.5958546023192324,
          1.9814773867389102,
          -0.6802494613085344,
          0.7800461825371132,
          0.011603676854219518,
          -0.5263789151310971,
          1.8939553800905917,
          -0.9164509437773477,
          1.1068896785901388,
          -1.4138900077241698,
          0.46082411581433175,
          -0.9949637891613609,
          3.8173159813632553,
          1.4584512102344838,
          -2.156985185905985,
          0.5848828115505748,
          1.0975595992572433,
          -2.4615895129322953,
          -2.518658518403956,
          -0.651061933350208,
          0.5281474589232816,
          1.084565850036597,
          0.6202559019811226,
          -0.7583295568356399,
          -0.17335916838775137,
          2.6194334209373906,
          -0.5207698707758646,
          0.5995121625829891,
          -2.155032436899372,
          -0.7120496083802975,
          -0.4530301660915451,
          0.08587641892360957,
          1.8243482520159449,
          2.048590336220422,
          3.192544182589298,
          1.3536658858548065,
          2.102012267912092,
          0.6592388433899279,
          -2.65888942211463,
          -0.25227473597045497,
          -0.37305435830628997,
          -1.1448343872539388,
          -0.48424274675108425,
          -1.217599044622573,
          -2.179449677489816,
          1.0449836723841914,
          2.588453112020164,
          0.2940115543690052,
          -0.5607349995778913,
          3.4731682394244774,
          0.7930252678390608,
          0.1530852496468925,
          2.4416419003976157,
          -2.0061599958106395,
          -1.045265937033039,
          4.3613580156584995,
          -0.4400733187744532,
          -2.227821172643741,
          1.0482185915621538,
          0.35912336896559893,
          0.9877326512794974,
          -1.2454402216751896,
          -0.31736422827623906,
          -0.989492441411326,
          -2.417543019343729,
          1.2917779469246273,
          0.7277549347542137,
          -0.6306160300846028,
          0.06912513411366707,
          1.9651675639519877,
          0.05825146054237768,
          1.0787912906069559,
          -0.6068582200319278,
          -0.8294748850182826,
          1.3903756527621611,
          -2.309017697821672,
          0.03217170699578797,
          0.10350475895409447,
          0.2261812342530496,
          -1.3880350381290971,
          1.541201952537879,
          1.7249577767956508,
          -1.5651687301201533,
          1.2650635154366165,
          0.7932401338485155,
          -0.9432949026851668,
          0.8980486403856673,
          1.1423076378661718,
          -0.872554420374563,
          -0.9269537406304232,
          0.0026248188462561564,
          -0.6489663218284997,
          1.961900763628003,
          0.39604859613703824,
          1.6278116067326316,
          0.6488290698388569,
          -1.8244136575529877,
          1.7779814819919442,
          -0.0002238207322561606,
          -0.39696662831859286,
          2.388592929383789,
          -2.097956222769534,
          1.2825281025802941,
          0.803476834565385,
          -0.6985590928049134,
          -1.3151114204971206,
          4.0664134470280375,
          0.9286798819580283,
          0.5994963411064149,
          0.5112192058434013,
          -1.3608052946539966,
          -0.8532785238659092,
          -0.057146016597533295,
          -0.09203779865256287,
          0.5909495997965589,
          -3.442040647207042,
          -0.5423395881212625,
          -1.9545677391299927,
          3.247646675698634,
          0.22863539569555003,
          0.6900994249007943,
          1.244836276022159,
          -0.45857707005492376,
          1.0839173489162504,
          -0.6301558333194798,
          -0.6711159689723463,
          0.4407988615481562,
          1.488840855250847,
          1.9974437872054027,
          0.20527665807677084,
          0.564598627833801,
          0.07561785281567582,
          1.4849532387806408,
          0.33176558529554817,
          -0.7492165698287807,
          -0.47736425352499934,
          -0.5148313649045991,
          -1.3154864783846207,
          -0.2939292311034857,
          0.8803953475335248,
          -2.337045664118939,
          -0.3640039923838401,
          -3.4123225806480066,
          1.266520140454109,
          1.3194338223624291,
          -1.8924673407053554,
          -0.19075561553268994,
          0.2198480571932191,
          -0.30858994475917445,
          -0.6523327862502107,
          -0.7381078789399562,
          1.9796075566385718,
          -2.519463052935301,
          -0.8268020941924604,
          0.7253690150178284,
          0.8281345824716609,
          -2.41276687522067,
          0.11839994198835053,
          0.043151593195169556,
          -0.47720565126839054,
          0.25991908455920404,
          -1.260815982665719,
          -1.305393347653679,
          -0.5088956782177974,
          -1.7301742065751264,
          0.7575593220415666,
          1.066582208972476,
          1.4963423103300098,
          0.864661917653677,
          0.6134415523469656,
          -0.0864627461793574,
          0.5434829636653611,
          -0.7534335149285561,
          -0.176408935866445,
          0.16587721637166722,
