{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Relu",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Relu1",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Relu2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "20",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          0.07505669050153913,
          0.111332842472778,
          1.8292603754847323,
          -0.2519635461007149,
          -3.8164407064026955,
          -1.0151416707095124,
          0.39151108978104193,
          2.0027654864678377,
          -0.10723330214727936,
          -0.8524959727340221,
          -0.10360266626262414,
          4.383710251798201,
          0.47186069080982185,
          -1.7776590474058118,
          -2.247940454247883,
          -1.5522223026287048,
          -1.0074679716443227,
          -0.3092440160713322,
          -0.7075144994871975,
          0.142075367779012,
          2.575368791078304,
          -0.008224718458590784,
          -0.4807500966039759,
          -0.9034861543938716,
          -1.4896584520590883,
          1.432213587584794,
          -1.6269292095308072,
          2.262426216142631,
          -1.4744376347135195,
          -1.5702086321221203,
          -1.3087291633856968,
          -0.17927651914399942,
          -0.18928486645476666,
          0.8123251828569935,
          -0.8390893624009934,
          -0.40267203330154944,
          0.8082245668767241,
          -4.013701829641643,
          -0.5361279748414409,
          -0.4543968207228904,
          -1.120830607137766,
          0.06564187721511194,
          -1.1268356848228873,
          0.2227427287146663,
          -2.084674507787865,
          0.5436660919106001,
          -0.8952461596134582,
          -2.121366051494325,
          0.7450536343279082,
          -1.421378088967544,
          0.7877483465029812,
          -0.43264960923880585,
          0.6453246686590399,
          -0.10866847114543876,
          1.589043567294173,
          0.14261353437035715,
          -0.889890374989184,
          -0.7351424946162917,
          0.5607615204315357,
          0.21922104763435668,
          2.648245841848051,
          0.6374582768536875,
          0.7277468614151811,
          -1.80332686759134,
          -0.391811675625921,
          -0.24541160937930767,
          -0.009109065425842482,
          0.6037991124523081,
          -1.3207640032472578,
          2.1305327504413074,
          0.21449280792764125,
          -0.9725148636773637,
          -0.7941703704039329,
          1.0058817959646964,
          -0.3207193429011697,
          1.153102102070515,
          -0.20375609138467438,
          -0.9320230791010081,
          -0.0522958004941256,
          -3.711773574863751,
          2.8497512963195346,
          1.1783057418846987,
          0.38106586254499886,
          -1.0255824901625803,
          0.7001619917513192,
          -0.2169431070868942,
          0.9925536326804947,
          0.8249317367550004,
          -0.9132021182659004,
          -0.27520410703970355,
          -0.851428747211156,
          2.778252821058511,
          2.951910855928647,
          1.5357635350074512,
          0.8350394815799889,
          1.078191460717803,
          0.9688378661638826,
          -0.5120828510511318,
          -0.34644393622041647,
          -2.346608484015874,
          -0.7344472974292848,
          0.507347146196096,
          -0.31497357155940003,
          -0.4893653093460251,
          -0.1973915706009528,
          -2.0245273141644566,
          -1.8301075462196286,
          1.6789707317608287,
          -0.18550555700575283,
          -0.7131566845758819,
          0.16918143051681742,
          0.2657335271838968,
          1.6069981888040903,
          -1.2034775643950661,
          0.16508714720607012,
          2.2168476188080555,
          -0.43676833506087537,
          -0.8487584356129495,
          0.7808829735296263,
          -1.2071910166720388,
          1.8667645408402762,
          1.3441234976063035,
          -0.10673305866046491,
          -1.5279624894224495,
          -2.16666585541966,
          -0.5381237906609302,
          -0.6510824289031147,
          3.025619409522557,
          -3.248224094904827,
          2.345659877298793,
          -2.177875481012371,
          1.1880830649082905,
          -0.7618211115527366,
          -0.814475413780195,
          0.9133572818690768,
          -0.13934684943272782,
          1.8280651362113105,
          1.2322131893293446,
          0.21668874577071212,
          1.0300878049484377,
          1.9442576070596287,
          -0.8062351653649943,
          -1.656873678810582,
          -1.2962586756982473,
          -1.0528481655308084,
          -0.6919084563209206,
          0.1310036901550072,
          -0.5659066908607027,
          -1.9065440867201546,
          -0.04602617724201177,
          -0.08650213848800234,
          -0.9007151699666874,
          -0.48851028114520845,
          0.4521358887564198,
          1.5453981895792104,
          -1.6258490863797954,
          -1.2197528267680604,
          0.8221876892356996,
          1.1674754259425364,
          -0.45164447083745307,
          0.34660284892879173,
          0.5183563792425224,
          0.9657878541774052,
          1.2942550700057327,
          -1.6617948434977532,
          0.8870286692251518,
          -1.590193160138534,
          -0.560122717527235,
          -1.3142913204078162,
          -0.16416150778657734,
          1.6404761981115452,
          -2.192309734536046,
          0.47047882366159205,
          -1.556457422271782,
          1.1180590234804204,
          -1.2446002534555691,
          -1.1668065216113412,
          0.042036473411528386,
          0.11297821114042952,
          -2.109688392457673,
          0.3307099403567209,
          -1.6613588654358327,
          1.1911920702281114,
          0.7190738899195539,
          -0.8658043980566411,
          2.1083132387525656,
          2.320789243537906,
          -0.9475676605740322,
          2.4222882800512924,
          0.14452598529067928,
          -1.7263008572004523,
          1.725008068183655,
          0.925876651431201,
          1.0416012826537124,
          0.27500840156392825,
          -0.98147879393503,
          -1.4457787740451122,
          2.2420712545836303,
          -1.7082196018605442,
          1.7104845459415061,
          1.651429562396851,
          -3.8841073603074574,
          0.09763390137767035,
          0.36088801097857715,
          -0.0917917920418094,
          0.4389944391331516,
          -0.9761160593632414,
          1.0961213948119848,
          -2.6964648635937416,
          -2.3501307011182315,
          -0.40536845163340557,
          3.1625989210152072,
          2.615021476382568,
          -1.4684432501057547,
          -0.981057802212003,
          -2.823088090415514,
          0.6341739487843616,
          1.5022438790966421,
          1.4452049769482846,
          -0.5158626435870031,
          -0.00018205934314603466,
          -2.97493660904789,
          -1.2589828131311471,
          0.7472501645894595,
          -2.4987894966736426,
          -0.19711206890648567,
          0.8463275353416335,
          -2.6581613154354944,
          -1.971302907463435,
          1.6852870745362265,
          0.8236404438110403,
          0.577354624848031,
          -0.3375307594440648,
          -1.3524125129807567,
          0.14020347387764343,
          -1.2609582086535134,
          -1.2650618753964238,
          -0.8209612602056426,
          1.587889498121658,
          0.8610205003116019,
          -0.9245739412598688,
          2.0915416355011014,
          1.1269453710240633,
          0.3307589715599632,
          -0.26442643396004684,
          0.36764149912165345,
          -1.1201849206854944,
          1.7954587482368918,
          2.3218150376141593,
          0.2821608239950053,
          -0.22956731432870253,
          -0.33318449191744254,
          2.796714807521351,
          0.043836271965571084,
          -1.8096109495258648,
          -2.958114422666515,
          3.087136702171869,
          -0.13385184245979487,
          -1.3520020115606008,
          -0.22554258681385123,
          -3.1212874786238425,
          -0.27955251104110995,
          -3.965028732116218,
          -1.689442977141239,
          -0.5082152709019961,
          0.8336131275156398,
          -1.2340773855423846,
          0.08983432468897426,
          -1.5742209223371857,
          1.826264474750506,
          -0.10812987288843541,
          1.3917542772035443,
          -0.02172372960629899,
          1.3664160041620466,
          -1.1679005686411945,
          -0.061986765910607776,
          1.3463192868961602,
          0.2243639871797506,
          -1.3823746455398374,
          -0.5302172897514053,
          1.6891270745035392,
          0.44439091892259186,
          -0.03674306889774651,
          -0.9351154018015542,
          0.49989947015660063,
          -3.4733041393269337,
          -0.5253256074014776,
          0.36127257021541664,
          -1.7314356276286271,
          0.5017421549502615,
          -1.2936676341617928,
          -1.095683786593546,
          2.181771121942701,
          0.08322543129772034,
          -0.8312924011622528,
          -0.42576577250298403,
          0.23611773349998233,
          -1.7142530617018361,
          -0.3184005202244818,
          -1.9353328549522772,
          -0.7459091598738745,
          -2.444733056211539,
          -0.34734574962071024,
          -0.1674557076793155,
          0.27999463683737835,
          1.2146303600351096,
          0.5439593454395355,
          1.0232691415708746,
          -0.5922894273217328,
          -3.3841371891067005,
          -0.4058980372387482,
          -1.8856538694534069,
          0.6641365022330307,
          0.28053471737061814,
          0.2992825524705243,
          0.7424284771263729,
          -1.300778874312554,
          -1.8421278859402272,
          -0.909851641300474,
          -1.6361548704055884,
          0.7517848158230814,
          1.3678430063342772,
          -0.6560342879442427,
          -1.6125504099961576,
          0.7194390871066998,
          0.7219475627667197,
          -0.062351150433689995,
          -0.9273938548151881,
          0.4598210182784686,
          -1.5866515448229666,
          -0.8270309431039621,
          0.511571913180335,
          -3.2088542171155408,
          -0.7982105517845729,
          -2.0297977410489927,
          -2.7793231859131993,
          0.8548339039665994,
          0.24628450361806356,
          0.8867873387671641,
          -1.9603124139769814,
          -2.975942507876667,
          -1.083232907412151,
          1.6797855029139381,
          -1.464393605410024,
          -0.2604045053372832,
          -0.15655147537929393,
          0.8161543844357192,
          -3.7258814127749864,
          -2.1304710645198885,
          1.1772514099923936,
          -2.286612575884216,
          -0.8045363087113757,
          -1.3408964254404516,
          -1.3538768392147662,
          -1.9932094213872835,
          0.9000095150405383,
          -1.8528005404426666,
          0.19011952279462907,
          3.3255955625170337,
          1.0057586054521295,
          -0.7967327777578708,
          -1.0216112009903773,
          1.0472236757589508,
          0.6153114158076042,
          2.555846736291848,
          1.289989166973981,
          4.478272788186006,
          -0.20132692921706838,
          1.090075239958824,
          -1.5957834416054122,
          1.0126379845404323,
          0.035500130749916176,
          0.8857271603625184,
          -0.15912025892980386,
          -0.1730989261388139,
          -0.08715446265093725,
          -1.4293533416501176,
          -1.3992354578165431,
          0.7179821993859252,
          -1.9023390190670568,
          0.6938272064862507,
          0.6653337599890757,
          2.4467970644156827,
          2.123485837212905,
          1.5776987524195385,
          0.9549477686546126,
          -1.4006537725552812,
          -0.9012623130092925,
          0.022950440128624145,
          0.3184678153759622,
          1.1578770661774003,
          0.07146865160772804,
          -2.226757905501696,
          1.384462732935239,
          -3.431233556742593,
          0.42842311402814254,
          -1.781246616293604,
          1.1903035454903128,
          -0.46986209178608346,
          1.0454003799239011,
          -0.23233132794213257,
          0.2356545129121237,
          0.0030747393703912393,
          0.19110823418638068,
          -0.10534298203744627,
          0.2315393385814926,
          -0.06486134864799276,
          -0.2863556890603972,
          0.2373106506284293,
          -0.2392608213838678,
          -0.10577381511098949,
          0.2634663217331312,
          0.2637854700945496,
          0.0429905472494588,
          0.07717751754392527,
          -0.030179996728504768,
          -0.12105443548513856,
          -0.10029979273669308,
          0.10099232190502437,
          0.1477400754514124,
          0.17069040214164294,
          0.1695424905356863,
          -0.23930798925801877,
          -0.0032663542001427587,
          -0.2590051473246395,
          0.028994212798912875,
          -0.0342280505007919,
          0.22696206840357644,
          -0.08727436696314317,
          -0.22416900791018085,
          -0.20899270599080372,
          0.15308835066469179,
          0.06920486640619139,
          -0.23350282636231812,
          -0.24346391841226955,
          0.11764735019552143,
          -0.25010457995141494,
          0.18841691176334638,
          0.12073422095838933,
          -0.24507846680721498,
          -0.24303604481139102,
          0.2848788592318721,
          -0.07360188907662497,
          -0.07572610039191656,
          0.18311289879695222,
          0.2618193631325849,
          0.28450507267344805,
          0.1483276156723636,
          -0.07243765133823969,
          -0.24381872321889142,
          0.16224183304660877,
          0.03418985379348189,
          -0.044360443569095416,
          0.2378798987666508,
          -0.22760503378739194,
          -0.004317264705526412,
          -0.2860536265363252,
          -0.01834606339515119,
          -0.2597401079835031,
          -0.22314403096388497,
          -0.2239001744164979,
          0.08734772618246303,
          0.1440346975905017,
          0.04880408364981296,
          0.27055585734122534,
          -0.07325077559758321,
          -0.12544416669799666,
          0.21577796749695163,
          -0.16180702451722562,
          0.2711705221612009,
          -0.285584820617449,
          0.2750671134108853,
          -0.2674342344614095,
          0.2289752189291212,
          0.016216232103971853,
          0.28858164227538785,
          -0.24949953477461567,
          0.03152630361935133,
          0.27472975254846455,
          0.013521480349326825,
          0.0757499760536336,
          0.11459130263483921,
          -0.026611665353528283,
          0.0746725131812085,
          0.04935760685882589,
          0.23483794054015136,
          -0.2660957356308747,
          -0.12822417130751096,
          0.26367092903541717,
          0.22846045916971916,
          -0.02595854147324792,
          0.0703256350904423,
          -0.13032107834546394,
          -0.18257390512756244,
          -0.021250957476284128,
          -0.08584762077399831,
          0.04897229646893768,
          -0.24719418688700254,
          0.27771076912711656,
          0.2846278197521606,
          1.2142373734230327,
          0.17848959173490359,
          -2.045394842260758,
          1.0823903900213774,
          0.07700538450772584,
          -0.49102296972965154,
          1.6808638721756322,
          2.431273733166162,
          1.474882073179589,
          0.6812967063216772,
          0.4023391902034043,
          -0.18375046273952458,
          2.0220606354943094,
          -0.42317023541543136,
          -0.9468402876675134,
          -0.5625361839089539,
          0.08909330228161742,
          0.35188224918894245,
          2.0482555311148842,
          0.41387830341138704,
          -2.659718029538794,
          0.3786002947294807,
          2.108116221751966,
          -0.14323717456337212,
          0.8684121327981277,
          -2.09864563241615,
          -1.46983013874467,
          -0.31212476294970276,
          -0.5398269059203586,
          0.5723676538370935,
          1.679233217107138,
          1.0550062232866073,
          1.2886047230352584,
          0.6744195292654621,
          -0.9042177420921178,
          1.4173333251809652,
          1.5514513514535353,
          -2.9802800346246485,
          -0.5149792554638585,
          -4.566652618113638,
          -0.6174769683612618,
          -1.6376006830878915,
          -1.1756989965378069,
          1.119187001085458,
          1.3199343453605847,
          -0.3917353638702156,
          -0.12029778050264471,
          1.0690651215959825,
          -1.9065145890929358,
          1.1382811843941363,
          1.2368219561018599,
          -0.6773866875873059,
          -0.20576744092338972,
          2.303775165782657,
          0.5019606272834409,
          0.3154961948852351,
          0.6250735432227069,
          -1.0855208622242476,
          1.745801589526255,
          0.5790886154295354,
          1.4987160580562864,
          -1.1801746642334814,
          -3.176197180594944,
          -0.831624297862848,
          0.05285024206005747,
          0.5374565351401145,
          0.6270033002687999,
          0.47384261230502367,
          1.1812260526605585,
          -0.3702579141149116,
          0.28545750007622844,
          1.7937385491246434,
          0.5531873365455269,
          0.2961689294259813,
          2.0805490829247466,
          0.8756450936888717,
          -2.063480260101513,
          1.8591918268735088,
          0.03520865356191632,
          0.8204315664006158,
          -0.8521065688172405,
          3.397013140632816,
          -0.5674328303505725,
          0.1619310456867387,
          -0.13512771900881057,
          1.6712473363541513,
          0.10600793549674313,
          1.7275372773094615,
          -0.5257301630408809,
          -0.08232616512333218,
          -1.898874473024442,
          0.5753389861163919,
          0.2216622218779145,
          0.026061867215767406,
          -0.8238270709921061,
          0.037226802132599296,
          -1.9121231301414334,
          -0.25013548195190904,
          3.384824333205248,
          0.5919940819401385,
          -1.3802109601291253,
          -2.892757244884459,
          0.046965641018966955,
          0.5221375252077788,
          0.731608065850779,
          0.09322067072617503,
          -2.1035912789718294,
          -1.698313172298709,
          0.8439558215016975,
          0.35930677258632926,
          -2.147250978602165,
          0.6679394799430297,
          2.0360308347860663,
          -0.5465651538532963,
          1.1307500231931844,
          0.5202206588128205,
          0.09715066917047581,
          -1.1376699746046688,
          1.5941790651279992,
          1.3650814623784706,
          -0.041748175161254404,
          -0.14798618620934625,
          -1.1112823735457564,
          0.3164623541022199,
          0.2980240592809904,
          -0.9585911117963507,
          -0.5677416164589506,
          0.29426298755295865,
          1.1042601971981618,
          -1.150531654880626,
          -0.14667887233421198,
          0.9657758983071326,
          -0.40365030166585153,
          1.4946696925070244,
          -1.442339199336691,
          -1.7748843116204178,
          -0.19701349845402186,
          -0.4305399698280446,
          -2.160757737533371,
          0.5219235856149016,
          -0.13383211003223183,
          0.3680835403791715,
          -0.03264533343346849,
          1.2205214177541217,
          -0.36405176670201805,
          0.49145039584906025,
          0.8075153222841761,
          0.9178938987343807,
          -1.1458166780004047,
          0.5941818360660435,
          -1.976651992092042,
          -0.27721376782168433,
          0.1828549449666858,
          2.4117462020890117,
          1.723049228382392,
          0.35901732619251775,
          -1.0623751508127521,
          0.5717681234377762,
          0.9708596623148201,
          -0.36055197402285555,
          0.2946959107954094,
          1.1479091759067528,
          -0.8111666944148584,
          -0.40492445207689687,
          -0.6878657381125055,
          0.009305209334387183,
          -0.7163552497191937,
          -1.1133494049560846,
          -1.9866014471683182,
          1.1351854460716226,
          -4.389327556137834,
          0.4686409629085984,
          -1.5249099181676369,
          -2.1787280937089375,
          -1.5317435890110116,
          3.93034532006586,
          -2.0616899450974047,
          -0.4285130528537502,
          1.2512795345569478,
          1.406210542918341,
          -0.5012029121487339,
          1.529484348434081,
          0.5837953578599425,
          1.6433660994862693,
          -0.3951129618415596,
          0.9755578449993424,
          -1.8352529602567504,
          0.315249388338119,
          1.9725201508407857,
          -0.8709803639365742,
          -0.11771782531424907,
          -1.3094994816635144,
          1.5736520604800144,
          0.6050203676683626,
          -1.6939082253513706,
          -0.1896908523117742,
          0.042121558628160825,
          0.7636090054579061,
          1.5081654512683436,
          -0.14885888817502538,
          0.8452862358760973,
          -0.36713125305375066,
          1.042151726799134,
          0.8893807734304888,
          -0.5501018948316736,
          -0.08629319990029688,
          -0.32898820111737176,
          2.3862274881702987,
          -0.4878137763474471,
          1.186693639345164,
          0.4668245295058864,
          0.7806049137402317,
          -0.8146103529397543,
          -0.6230776681539753,
          -0.9755936526003921,
          1.5179661823173787,
          0.5441438707920012,
          1.415177547550169,
          -1.0470563552349768,
          0.3934707226815884,
          0.5837320380815723,
          -0.9958990370087123,
          -1.8039575228770777,
          1.2894646518998936,
          1.2984921626466803,
          0.9109056827999414,
          0.933561770335534,
          0.23125054172875603,
          -1.1002573984774937,
          -0.8920741632484545,
          0.6920226996679171,
          0.6964541679521957,
          -0.3451863804584485,
          1.1172505110213866,
          -1.8124924879695514,
          0.9422385288854395,
          0.7959306780897882,
          0.7125790624266324,
          0.25240264412216856,
          0.21177631176563755,
          0.39685027440911674,
          1.238788721716191,
          -0.9125481145175318,
          -2.004453299021234,
          -0.16106741007295577,
          0.40196607127687994,
          0.09652728764755732,
          0.07400057889672816,
          0.15197334251956907,
          -0.32424701628444225,
          -0.21347706629943905,
          0.4281590898335754,
          0.5401400098082227,
          1.7398643291297633,
          -0.3006619744714822,
          0.6107928279007548,
          2.1383353966498317,
          1.3162720222493995,
          1.171096466974682,
          0.746299935497475,
          -1.1498454429926852,
          -0.10337016856615472,
          1.2387953790642923,
          0.43504894126079574,
          -0.7235687549808555,
          -0.8711560109861796,
          0.066277194029308,
          0.8466144844938644,
          -1.3325669992934708,
          0.9828152141218442,
          -1.2939919828082314,
          0.219876854030918,
          -0.26908612126040266,
          -1.6164154786324016,
          -0.13221177723774183,
          0.15938082125445113,
          -0.7331789845664018,
          0.47927136426596056,
          1.6434253317635046,
          0.3471672963758364,
          -0.20710183848007718,
          -0.23309121911724714,
          -0.39889361933852463,
          -1.2272081056792479,
          0.5886520521352155,
          1.586633660783954,
          -0.905825669492306,
          -0.10985954454375033,
          -0.7980814194093934,
          0.4699861665069549,
          0.515208966044437,
          0.2699311701664004,
          -0.2561669122527826,
          -0.16196879304085143,
          -1.435236425710593,
          0.23074591882940518,
          0.23794882108167256,
          0.6127798091120901,
          1.2721263685123407,
          0.31345660392168656,
          2.041358703337508,
          -1.162930023871561,
          0.4175924794008575,
          -0.35827391560953464,
          0.4796266900159633,
          -0.07832553325094208,
          0.9824758938681236,
          0.931143510754918,
          0.6538318305942824,
          -0.3729888395841774,
          0.9479955818818233,
          1.8114432438991128,
          0.8476364562111427,
          -0.22443452289899415,
          0.3410459058002324,
          1.5852713497687994,
          -0.6037346145846239,
          -2.073421894841492,
          -2.3183291891279354,
          -0.007413558673384087,
          -0.9742342100901521,
          0.36130544753240607,
          -2.071206081390871,
          -0.1660958475073629,
          -1.515671486992692,
          -1.2054350016066,
          0.6041805852720555,
          1.2480674169684798,
          -1.1868852165882031,
          -0.855835381775084,
          1.0354757159505843,
          1.2332330074606654,
          0.017195559369136852,
          -0.39739096917170075,
          -1.9427408437634528,
          -0.10264848234281024,
          0.7699743614447552,
          -0.9374340316082552,
          0.23490422280943765,
          1.5548812093602398,
          -0.6154175638892496,
          0.14904669589683583,
          -1.5999309808576359,
          2.639109805241493,
          -1.727569067005623,
          0.3227146761155568,
          -2.0343874683245833,
          1.5680805516743084,
          0.9341660757167414,
          0.7255425325052539,
          -0.742646705165547,
          0.18047262217354937,
          -1.0391686816671721,
          0.51541555361851,
          -1.4929085650561071,
          -0.4443567742596329,
          -0.0018582296016534953,
          -0.6750379546332792,
          1.4333588448009071,
          -1.236245399297939,
          1.7880369079547893,
          -0.3722387143893125,
          -1.034367668929059,
          0.8446804569249479,
          0.3751242837614883,
          -0.9092628840519403,
          1.6398615754137151,
          0.20921464478637736,
          0.7018825611729027,
          1.726314019754049,
          0.6255928720582867,
          -1.2350074143537038,
          0.6381084242540083,
          -1.1294787252271987,
          -1.3019041183227855,
          -1.038238426939978,
          1.086173039095745,
          0.19636188898081325,
          -0.9790547136213892,
          -1.5072431190907853,
          -1.538109039040161,
          0.7946927185007145,
          -1.503548188844433,
          -0.28315825583620546,
          -0.05911427575052819,
          1.284247483716174,
          -0.156614567076912,
          0.90655897801926,
          -0.4692598462867914,
          -0.7606123275744122,
          0.7645433368538207,
          0.36347078451997444,
          0.6155844777461852,
          -0.2860322706351291,
          -0.29963151509234626,
          -2.6207129677955727,
          -0.009716370385561742,
          1.0284031224321368,
          -1.0266854676953485,
          -0.33856246716485383,
          -3.1700445083776994,
          0.904028293536482,
          0.5667370523976503,
          3.037149006689455,
          -1.0516041574027155,
          2.7108625086115774,
          1.730258034475958,
          -1.933829496855268,
          -2.2777464663131988,
          0.8399565140848645,
          0.18293716194504017,
          -0.4397919216823788,
          -1.3163019629934964,
          0.10377791168780397,
          0.6811017788662871,
          0.20528876559472795,
          -1.4291656080832191,
          0.6903111319864684,
          0.3115644586003884,
          -0.4264199238839357,
          -0.4006076571617096,
          -1.187970081906925,
          0.6693510401133592,
          2.1358980916174235,
          0.002967063240607464,
          -1.7358594690129026,
          -0.8808132088614582,
          -1.2102147284283493,
          -0.5339446481580072,
          -1.1923907514920737,
          -1.098244402792211,
          -0.6756269440913063,
          2.3460554549839574,
          0.38251313550667565,
          -2.926379065104407,
          -1.4178419922892465,
          -1.6897273072694587,
          0.524103927628476,
          -2.8635261593255974,
          1.2286068477656962,
          0.07742729584335507,
          -0.8548218414030496,
          -0.098007638032137,
          3.1747449589151606,
          -2.2216194730029075,
          -2.976084194177948,
          -0.5825565926889011,
          2.2960711297484697,
          1.1542456230513525,
          -1.5041059464561641,
          -0.8968572770523833,
          -1.4140176732731589,
          -2.019582791234001,
          -0.22273029867437263,
          -0.3949025920753615,
          1.0292747063511445,
          1.2534565279474525,
          -1.9308873299246732,
          -0.9260123979081616,
          -0.40850515610111554,
          1.2813950446635158,
          0.9008376093580109,
          -1.0140393048288436,
          -1.4742763862968402,
          0.22290973704049583,
          1.463438240150256,
          0.3742094977066088,
          -0.12001018967619144,
          -0.04373917646625431,
          -0.30278407227485654,
          0.29662159262221965,
          0.3655441035077893,
          1.8971952983932934,
          -0.6560397337416889,
          -2.717308562132901,
          -0.13110075814881328,
          1.286517348712102,
          1.679548154432056,
          -1.2554961495218058,
          1.141509782268138,
          -1.5073762738996501,
          -2.284844664434961,
          -0.7396681824614872,
          1.266013534423963,
          0.4245226295994565,
          1.4019691479414076,
          1.2154463021807866,
          -0.5130481155159703,
          -0.9207623945725357,
          1.1188631606485282,
          0.7797283861175192,
          0.6742276635148012,
          -1.3133254462485267,
          -0.8737543762130915,
          -0.42753855746256725,
          -2.4970482031440264,
          1.1819921372989455,
          1.8666901454696625,
          1.548778477597117,
          0.36283722790111717
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -1.5100549065729416,
          -0.3313474468773926,
          -0.9056369498872162,
          1.4151807709885396,
          -0.9284142075989708,
          0.09167093558104927,
          0.11586375203329144,
          1.6524089571083924,
          1.095753912252824,
          0.40793270825384087,
          -0.6170789261391496,
          1.47904415456713,
          2.91771907310787,
          -2.0260691530523123,
          -0.429733247559759,
          -0.5768522256252058,
          -0.6635903904648329,
          -0.40116305818449893,
          0.1674198054548412,
          0.9667659067899494,
          -0.8916046297510519,
          -2.453788586151141,
          1.9214552511744056,
          1.1894940628802713,
          0.5293343109510141,
          0.5726754689063785,
          -0.4643471642140202,
          -0.003926250432700699,
          -1.3861962318529175,
          0.00708902978164161,
          -1.6221695078049294,
          0.6750964554726291,
          0.7023906562912886,
          -1.9338294283081379,
          -0.10234574905035372,
          0.2471760652771211,
          -1.3409932942330165,
          -0.1744571235488897,
          -0.4318566504204591,
          -1.4062486578570077,
          1.2058386153819822,
          0.02771056209269919,
          -1.5188425401452568,
          -0.8782520946273199,
          -0.5759577417917261,
          0.8271423644441682,
          -1.041983481321385,
          -1.5883664288572863,
          0.05239161275576322,
          -2.8023792768234204
        ]
      },
      {
        "dims": [
          "50",
          "30"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          1.2087916829038323,
          -0.9334190856983394,
          0.8357281292524789,
          0.39985208390982035,
          2.512358693709905,
          -2.1571954159303175,
          1.6375505090751958,
          -0.06569983101098655,
          -2.293033009094573,
          -0.28949892167475605,
          -0.6413700337347613,
          1.5664322354151603,
          2.011666019196389,
          -0.17245477980724175,
          0.5849832525435666,
          2.366689931431698,
          -0.11239356432139425,
          -0.0018061807301521632,
          -0.3077792152903937,
          -0.7065065060954979,
          -0.15013363133033597,
          -0.7223156888465047,
          -0.692339513255393,
          -1.334584784558754,
          -0.5895435889503781,
          -0.5779509442584918,
          -0.9337162282240187,
          0.47303433772672465,
          -0.17558913412383448,
          1.0139881254756125,
          0.49912878610969774,
          -0.5197759892068797,
          1.1077908130438245,
          1.705455747655863,
          0.8843023478510905,
          -0.8767630073165928,
          0.18851863923119958,
          -0.21627874627233065,
          0.8477135776730934,
          -1.0418960937004977,
          -1.1788948574417046,
          1.3043671870244897,
          1.457095361205697,
          -0.24612977663007565,
          -0.09250860012404113,
          0.3948259961074337,
          0.02750611336882574,
          -0.3794721494754121,
          2.605474744282026,
          -0.27006834618013964,
          -0.8450979185239058,
          1.4283230746915772,
          3.3324716805287817,
          0.5027356547677201,
          0.903018421340829,
          -0.6345441423512456,
          -2.122106052171644,
          1.1300601611245684,
          -0.9985859374548407,
          -0.15019509678647108,
          1.5734076384282076,
          0.4849745769994956,
          -0.9259185186019596,
          -1.1829810498903757,
          -1.0996252887595825,
          0.5622890706075384,
          -1.0611235883497427,
          0.19450533420642924,
          -2.0295426033360187,
          -0.07845737205414546,
          0.2762630798883283,
          -1.4721822203936341,
          0.8671275475069661,
          0.7974068296462261,
          0.699781697938073,
          0.01661954783907378,
          -0.7186322876760441,
          -1.3132722828977494,
          1.1375828281932605,
          -1.0534415908021029,
          -0.46392604572309876,
          0.5912127361590845,
          -1.2318241621028492,
          -1.4154453128603492,
          0.8105904958436994,
          -1.8965777876966659,
          0.060374314733209374,
          1.344585957250935,
          -0.04158460944555351,
          -0.3000821767112116,
          0.1758004062392705,
          -0.9428609959208224,
          0.8945321803182233,
          0.3798131996706967,
          1.3624509247926884,
          2.226421236509673,
          -0.08756350153051544,
          0.10998126378468172,
          -0.7673480231273108,
          1.221511082123641,
          1.79582538973825,
          0.6947022072210652,
          -0.29981486765664594,
          0.6075240500095134,
          0.5201042598622606,
          0.8396775472631134,
          -0.7009918492119334,
          -0.5250774403629613,
          1.4390364712368922,
          -0.46166775908060226,
          -0.954486476857932,
          -0.20591745810178563,
          0.43192771031821325,
          -0.08220199899747269,
          -0.3405067366700646,
          1.5603619845781582,
          0.9773658454026808,
          -1.7670283897298449,
          -2.5340436950587177,
          -0.33043144833572036,
          0.7123830457745595,
          0.21699305520997236,
          1.7409076113775466,
          -1.1896973885964324,
          -1.122498781887098,
          -0.22592274682954122,
          0.16835440847338137,
          -0.2499450818701496,
          -2.1244798786499333,
          -0.022785254620817194,
          1.0552057819994758,
          -1.667297369300992,
          0.894179972095678,
          2.6754564654724007,
          -0.027693658883771555,
          0.5217262342871389,
          -0.15622909780170507,
          -2.4488481347341824,
          -2.2274930315496766,
          -0.6118448718084013,
          -0.07468423510082249,
          -0.7050394391165276,
          0.3223716969647412,
          0.682369846261544,
          -1.4142162502771343,
          1.3794824974926874,
          -0.5569854639799517,
          -0.9971781528222808,
          0.6644414803868044,
          -0.44386923382213567,
          -2.0129905176721277,
          -0.3044086360973893,
          -1.5172008223405697,
          -0.8144921061580016,
          -0.9570882049864801,
          0.23733912229841067,
          1.687630778817932,
          -0.17405359918423582,
          -0.7509765392777846,
          1.6012339430523073,
          -0.2234396231050726,
          0.6354061870512223,
          0.14882773385979103,
          -0.6020803335198384,
          -0.08723235033009663,
          -0.3216898671337832,
          0.5027421193976691,
          1.0924654432928662,
          0.8966922327064535,
          -1.3770223854165076,
          2.5923729783149807,
          -0.040401975000884514,
          -2.243756817191855,
          -0.7505610417174581,
          0.7691410106568611,
          -0.4438300821738805,
          -0.7357982792700307,
          0.8219475622428689,
          0.8225259868420908,
          -0.07446056507846653,
          2.7845604005866718,
          -1.2882484879965843,
          -2.2031218266881,
          -1.0548576740977258,
          -2.4733125677786414,
          -1.1027132126903738,
          0.7246559161733791,
          0.20057125643607732,
          1.7970991899523026,
          -0.9270849241125674,
          0.7104895700682188,
          -0.42325317191862416,
          0.2609680264010562,
          -0.3832004090124383,
          -0.2642354063774297,
          -0.270736435837132,
          0.057148057782314556,
          -0.8448757048641988,
          0.9095045819663334,
          -0.31209026400178363,
          1.5189556441863725,
          0.30051349678069667,
          0.3581752256545388,
          0.5971698896408949,
          -0.2170923776311195,
          -3.0781162744639587,
          -1.2732280537486829,
          0.19783612710671725,
          -0.9589879273036274,
          -0.2667159070724053,
          -0.32936890078054054,
          -0.6420041787141638,
          0.9649829472665505,
          2.3915661856927337,
          -2.5788921371803273,
          -1.7654267361713745,
          -0.6225386153753804,
          -0.019860536815819365,
          1.7270812078615834,
          -0.996707448686018,
          0.14549527588750383,
          0.04497067464472242,
          0.013303906684855173,
          -0.6151521017657963,
          -0.3803508556927423,
          -0.8796179436128592,
          -0.5587283130241096,
          1.0360941195080744,
          -0.5009976110114086,
          0.3269441696355564,
          -0.28840539267037446,
          1.1069665909407866,
          0.3647966052563312,
          -1.9674919872223868,
          0.6355626140385279,
          1.1416232190920579,
          -0.8107125298580514,
          -1.5361601246489596,
          -3.083313556954576,
          -0.39262354132404964,
          1.1428489662444308,
          -1.2051808320017579,
          -1.97027812797751,
          1.0197291944866202,
          -0.37853111411032153,
          -1.4626586786783837,
          -1.0890602594250924,
          -0.5082599532200635,
          0.8727280715987513,
          2.095759950754653,
          -2.410034824292921,
          -1.0156522969268627,
          -0.4311151021190276,
          -0.25809230835682245,
          0.4998196605508778,
          1.0371552276751441,
          1.6986919664967284,
          0.0686172860777752,
          -1.029692541033793,
          1.1813551239745381,
          -1.4850801832051104,
          1.3949891568130868,
          1.6230403117435086,
          0.923818165774073,
          -1.403481625987581,
          0.5194543984194698,
          2.2983844183213495,
          0.14326719511381122,
          -0.047864035951927696,
          -0.21437332342995868,
          -0.956084668068473,
          -0.3007389435823626,
          0.8442634046289272,
          -1.2480589150546004,
          -1.9581319121665413,
          1.2468720207770563,
          0.3249945259104762,
          -0.07370021019836051,
          2.575990949632864,
          0.04501123027166869,
          -2.042202318659612,
          0.03215540564862311,
          -1.5499649162804334,
          2.242366649679457,
          0.3636010981342519,
          -0.24690898991517338,
          -0.04643126147774075,
          -0.8908556281315331,
          0.3326840709252063,
          -1.4396500975437612,
          -0.10931888539712777,
          0.22883431181648625,
          0.4899923749258269,
          0.9875067178336053,
          0.23662434307287014,
          -1.0536474411233994,
          -0.3280011071863633,
          -0.32864113800558653,
          0.11705414356820809,
          -0.3237072922984164,
          0.7820126772359091,
          -0.5724979015513598,
          -0.14888783790166482,
          0.13742284654193393,
          0.8382137005166748,
          0.3495088191677733,
          1.782384587148047,
          -0.12299442966228052,
          -0.6776321578727927,
          0.026527641654604507,
          3.256490035105536,
          1.1475648224042163,
          0.4393514148448321,
          -0.15022345266434717,
          1.4747972487689278,
          0.8220115843239024,
          0.5258382249330136,
          1.2528324482404842,
          0.26168144550558675,
          1.1263486203874802,
          1.5437924230693736,
          0.8113168520284614,
          1.7904667041831193,
          -1.1869960615822333,
          -0.114792194702898,
          1.7267373438920104,
          0.8495600776035668,
          -0.9709188156273175,
          -0.4968192739164028,
          0.03587430880898594,
          -0.707054398849923,
          -0.012805018182870002,
          1.6510914796953657,
          0.583676778928328,
          1.7489277317571124,
          -0.7024642256676686,
          -1.9737300442443162,
          -0.1654561596919552,
          2.77956486475423,
          -1.0092024594831104,
          -2.1294747080316894,
          -0.00862375324311466,
          -0.17875654145379294,
          2.3030693075014064,
          -2.519105459665733,
          -1.1311394295798904,
          -0.6001810601176506,
          0.02108719272083633,
          1.1146780249310961,
          -0.5539529888131439,
          0.3941392239555825,
          -0.5333868032265827,
          -0.3576840385646771,
          -0.642196160502839,
          -1.9690179902292642,
          1.9124634559355187,
          1.2801320627557806,
          0.17209512882195951,
          0.7846946689227989,
          0.5226667444507579,
          0.02373173058843844,
          -0.7242511758960395,
          -0.643166718493864,
          -3.6533908195938163,
          -1.6321188928949069,
          3.3567608873375328,
          0.5044503646238967,
          -0.4531499930515521,
          -2.283090633052007,
          2.761423430434305,
          -1.254434623682894,
          0.771063921696767,
          -0.40486773528940206,
          -2.628102580038684,
          0.9634132242479644,
          0.9245651123335622,
          -0.9923575346768807,
          0.0894893078994752,
          0.9577248371260909,
          1.1722362656945637,
          1.2393816284521866,
          1.0973805628879336,
          0.24787444695616856,
          0.45211500359250495,
          -0.8949232206945276,
          -2.5200719485787086,
          -2.043846855660491,
          0.14109362616784019,
          -0.7535763736601976,
          0.5089685307473455,
          2.0814809454375465,
          -0.9734134331317654,
          2.288583559166335,
          0.7647451201279841,
          -1.3809469635665057,
          0.36113076362368707,
          -0.6617127475639631,
          0.18804486967155187,
          0.878311141789817,
          -0.9711595047865602,
          0.9836231325444913,
          -0.5292612793984272,
          0.23877435951602533,
          0.10851667256918186,
          -0.7748429970828605,
          -0.21147159080968572,
          1.1067702565944362,
          -0.1124006997309587,
          -0.7146686785777817,
          0.5868174567691796,
          -0.4601522061900668,
          0.5197887549004033,
          0.43776199553158496,
          0.6141245964251528,
          0.2091784259733732,
          -0.4627302860252885,
          0.43586270300681546,
          -0.608779911422295,
