{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "20",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          -1.479552279160005,
          -2.240539003505558,
          2.5491210604870185,
          5.767728558808414,
          -5.716800663242281,
          1.697535963518072,
          -2.042681049342296,
          5.958807174573133,
          1.167382023898903,
          -4.944327641499482,
          -11.396441847416982,
          -1.4590702611112831,
          9.580833023129847,
          1.3629430498773174,
          -2.830664872007715,
          -0.30143596487027446,
          2.463575751087561,
          5.704455807597243,
          -1.1443612615220382,
          5.173133564837684,
          4.19791111864367,
          3.392191743046911,
          6.953835994636279,
          2.5498689807968415,
          1.1964207955468658,
          4.469765138861655,
          -1.7752741002470043,
          10.061821826564612,
          1.8792094778282946,
          2.440250068207186,
          1.287482584708543,
          3.8305827149222824,
          6.064790041758547,
          10.940333340204957,
          -6.396011963083613,
          -0.1965031597461276,
          0.9757705617666552,
          2.330003889197331,
          -5.624124154818402,
          -1.2300460832315565,
          9.953840821160334,
          1.6560037916729924,
          -3.359388356948392,
          5.706616255742702,
          -3.616716770854244,
          -8.021700728310588,
          -1.8669679904236758,
          -0.980407079804072,
          13.598683277340289,
          0.2262078791199014,
          -7.885676161527152,
          -0.6222220215971088,
          -3.6375767246674693,
          6.398999841086631,
          -6.404613426213345,
          -1.919418586110522,
          -5.43017975025586,
          3.547733783956664,
          0.31623139294951613,
          -4.155097837967173,
          4.239374281883551,
          -7.8112710700757235,
          5.6192859399762565,
          -8.069975935859649,
          8.802224449017523,
          4.114920303320472,
          0.7246313862293214,
          3.505444332962732,
          0.01852544534038022,
          2.728516517186874,
          0.205829827052384,
          1.2674544066398856,
          4.82704386291206,
          -4.176969798631265,
          6.858354456643414,
          1.4192312703055718,
          1.6979932728692724,
          6.958534629283591,
          2.7662945924335918,
          -6.492460959141409,
          3.67176649808621,
          12.18608830889821,
          2.7410804206181973,
          -9.221004158459442,
          8.129823371431044,
          2.7737318368039743,
          13.680232194970074,
          -4.597428898892268,
          -1.2542807635784645,
          -4.773142503675301,
          -7.512593133545028,
          -2.002232624294488,
          3.544033556154397,
          3.4040599127625573,
          4.1143393749319905,
          -3.503878776649185,
          -5.0773689181158135,
          2.8211882684128025,
          -2.388447598381676,
          -5.1758280798128,
          -0.10262371512431558,
          -0.7202482891303533,
          -1.3831975829260854,
          3.1317172002100784,
          1.715055836738164,
          -0.4163331812857555,
          -0.04255587377268623,
          -0.05820679218371899,
          -0.009114855081352204,
          0.8948375795668586,
          0.22429305585609946,
          1.5021952214783705,
          1.3128136604075467,
          2.81460499689646,
          -4.9340632822070996,
          0.2937521558081472,
          -3.386606195316853,
          -5.986295068480997,
          4.625892162643448,
          -5.459780677682475,
          -2.1094890948104053,
          0.0008658511358605791,
          -2.332955845976865,
          0.7456115271266214,
          -2.3114711680228166,
          4.92686809188294,
          0.5999957898532078,
          4.432641329595879,
          2.2272515997176416,
          1.3260176530279093,
          0.206993515533784,
          -4.279348087736179,
          -4.122733254971266,
          0.2526258243553888,
          1.9771677603543945,
          2.9185681119324545,
          0.6469529792171901,
          0.6766588997823119,
          -3.491766747855502,
          -0.07681355401609412,
          5.282855960357957,
          -1.5640247656581485,
          1.1254542669104262,
          0.23956845863741294,
          10.359666635019135,
          -6.4511379749980735,
          2.4857798669117748,
          0.13368658680250095,
          3.063684688574568,
          6.316525617867737,
          8.770226179418225,
          -2.740974201024339,
          1.9009881154881476,
          3.3307233675576136,
          7.764751181779597,
          1.0135488237506316,
          8.552563151899063,
          0.10263039265480003,
          4.143211913345233,
          4.137169971260254,
          -2.7088612888502683,
          0.3215005808420278,
          1.0724091847032333,
          8.607331231667516,
          -1.6627888561538706,
          -2.556049498656091,
          -12.170279531078554,
          -3.591822123005608,
          -0.8533945629924423,
          7.057025875177121,
          -2.4800961591466892,
          -12.394011714604234,
          1.3552059909035368,
          3.3678248847563865,
          1.7093145882875744,
          -2.7501535735075695,
          0.21583504582748778,
          -5.90320921164901,
          -5.830647159323393,
          3.71898043816105,
          0.7243411493490618,
          -5.12165279741273,
          -1.754861167785113,
          -4.85939481707588,
          -6.345565267181608,
          -4.347170642670945,
          0.23702201229883824,
          -0.23440479697270092,
          4.095545478106073,
          2.2549734812649955,
          -7.879028262594424,
          -0.5629924128711166,
          7.843280945886039,
          -1.2493808688601842,
          -4.445774978653554,
          -2.519417655370667,
          8.343011778328016,
          1.4636583534039236,
          6.513295373172688,
          5.592669309475222,
          -3.038086402867605,
          0.4227791898749916,
          15.584702726605915,
          -6.445212447522649,
          0.5045090346321218,
          -8.85907417366478,
          2.1394600829990873,
          0.2553388317614736,
          5.14272110131525,
          5.406780701349585,
          -6.116650377822589,
          6.735073899883271,
          5.497675441058823,
          1.9273508973647813,
          -3.1818055203011255,
          -8.604354203547498,
          2.388569469221914,
          5.399567077115317,
          0.8239778407794789,
          6.842631879742912,
          1.1618913376441953,
          -1.9829418711288662,
          -13.423262222881444,
          -1.9442439035955092,
          3.761426187641391,
          -7.239460613627851,
          8.276094081065395,
          8.356332410296126,
          -16.210745984146765,
          6.768571003072888,
          -0.623985793798603,
          -8.019143519239638,
          -8.306022689496027,
          -1.1034660297933585,
          0.698791778847414,
          2.3417142702613347,
          6.842523342492185,
          -0.2102972585065397,
          2.135505326329872,
          2.7220190595914397,
          -4.311748078563496,
          -3.438621964168829,
          8.463856633055398,
          2.596236412243002,
          -5.773405878985547,
          0.9144664212194061,
          7.394105709020967,
          11.43005142554927,
          -2.3335322619594847,
          -6.279783867703511,
          8.44987108361384,
          7.636822668466195,
          2.2425934960643343,
          -0.7407563923921543,
          1.9929013968779614,
          5.375119814517032,
          12.6761435953968,
          -2.2836445148838806,
          0.2845207802030568,
          -0.49875940700248733,
          -0.9023846349530237,
          4.384512569202507,
          -10.958502527163823,
          9.929328431601375,
          -9.084295581686074,
          -2.1168719444295867,
          -1.872353948033771,
          8.986310125487945,
          0.23929355769776617,
          1.4306094141265884,
          -0.7384485150420046,
          0.013980573583802003,
          -9.996243635378057,
          12.335660633961716,
          -12.809427984280648,
          7.745638993653225,
          5.67129962149189,
          -6.135608837816201,
          2.3507665444756984,
          11.045924243940577,
          -6.148721739059918,
          -1.9431594918494273,
          -2.0251209070072043,
          5.7645329140298,
          -6.865653605498278,
          6.734357002981095,
          -19.816296955802677,
          5.2610658783433655,
          4.02936200915665,
          3.6003297625178172,
          13.29217800683576,
          3.9021676863957406,
          6.421179242363906,
          3.875764002175372,
          10.754598549367987,
          -7.688700041328961,
          6.203238640936662,
          -1.0690679207411646,
          9.593910934491078,
          6.682805354915919,
          -5.143314440542426,
          -2.467478286163539,
          2.800233772632578,
          -0.8607570276047896,
          -3.865661422890932,
          11.555505225182571,
          0.0913809480289525,
          5.081532063853791,
          4.639447775752439,
          -7.818934812066996,
          0.32353442973931956,
          -4.982464012279156,
          4.83056046136672,
          -9.403877643361719,
          -0.0559245677634584,
          6.738069672892136,
          -0.5516625245195554,
          -12.44500633934718,
          1.5568240440711942,
          4.7300146730339385,
          19.461388467394773,
          2.0668674739149258,
          5.476977919990984,
          -2.0464386773474135,
          5.415529884734095,
          20.976976455229533,
          -0.7199662273804616,
          10.12074815055513,
          2.9135299303347106,
          4.051353057924846,
          -0.09785728763062379,
          9.080281100805585,
          1.5447462710424218,
          2.8288974038555144,
          -0.6127529925671266,
          1.6043056723200184,
          4.472999214423659,
          -7.648710100949023,
          0.8366353985431847,
          -0.07148060208510397,
          -4.429164569104025,
          6.354926688714983,
          0.8553821198662058,
          -2.892522161101324,
          7.979179580247817,
          -0.5673324502801763,
          -7.654394323642995,
          -9.691811149810256,
          -9.749718586305798,
          25.040363989144097,
          -7.709660037273368,
          6.474343932338366,
          -7.493244777275853,
          4.132763737241155,
          -4.9631844347095475,
          -2.4915851912038116,
          -6.178394457860021,
          4.399270353591045,
          2.286411478308589,
          -3.6128916152032766,
          9.928957643724805,
          -0.16325664321342195,
          -2.228194913957234,
          -1.0787359874833402,
          6.784254690114706,
          6.298089563429763,
          -4.545296392024467,
          6.305347679078259,
          -1.3298696000453796,
          -14.770421425073744,
          -2.7245202426585875,
          8.790120409301082,
          -2.0722492507316392,
          -4.788528341647122,
          -1.3471618726995351,
          -1.9487482321031493,
          -12.985560864434262,
          -4.289704410340717,
          9.709396733676758,
          -3.934271288643671,
          3.421229857404983,
          6.942964396184214,
          13.126318298245181,
          -4.455000577427984,
          -1.5877287378019047,
          4.0471244526775445,
          4.882703939639109,
          -9.739475982289013,
          1.3628226891132786,
          -6.483118983384238,
          -3.6394095807221443,
          -3.071134424339435,
          -10.99203469194794,
          -2.5857912892183426,
          -19.91096460172113,
          5.569358183741858,
          -1.287895977661588,
          -13.416571303247224,
          4.622213857081602,
          -4.035334746066971,
          -0.07529233757322278,
          0.07636929248368884,
          0.0009964403710799247,
          0.061933041096722735,
          -0.0341388285202457,
          0.0750356751114222,
          -0.02101981941515387,
          -0.09280018066334988,
          0.07690600219485753,
          -0.07753800011063042,
          -0.034278449937153004,
          0.08538235205056045,
          0.08548577945586794,
          0.013932080639431865,
          0.025011158655780765,
          -0.009780525604332084,
          -0.03923048820817758,
          -0.03250446644526263,
          0.032728896531060786,
          0.04787858672529974,
          0.05531617062682695,
          0.054944163335265014,
          -0.0775532859498524,
          -0.0010585375861487485,
          -0.08393660535681194,
          0.00939624491053131,
          -0.011092391007246967,
          0.07355230489842562,
          -0.028283276117358366,
          -0.07264714908014748,
          -0.06772891761537327,
          0.04961181894311984,
          0.02242743675276712,
          -0.07567198871736283,
          -0.07890011086439315,
          0.0381263434593191,
          -0.08105217074724216,
          0.061060855850058895,
          0.03912671528860858,
          -0.07942334259486146,
          -0.07876144853314061,
          0.09232157981788287,
          -0.02385239359444934,
          -0.024540793375922992,
          0.05934196783603169,
          0.08484861704486488,
          0.09220044564253944,
          0.04806899271666567,
          -0.023475095441548445,
          -0.07901509356347033,
          0.052578216508057815,
          0.011080012481168251,
          -0.014376027209294087,
          0.07709048021377904,
          -0.07376067269516341,
          -0.001399109429089414,
          -0.09270229031952544,
          -0.005945465945098446,
          -0.08417478634747393,
          -0.07231498160596461,
          -0.07256002737173077,
          0.02830704986796052,
          0.04667777337317395,
          0.015816091500147008,
          0.08767987995311277,
          -0.02373860715496575,
          -0.0406530820840981,
          0.06992783846035185,
          -0.05243730675312122,
          0.0878790762972799,
          -0.09255036292459606,
          0.08914185676725601,
          -0.08666824589720223,
          0.07420471286466053,
          0.005255244880388492,
          0.09352155225848355,
          -0.08085609187030815,
          0.010216827474578237,
          0.08903252718242721,
          0.004381948280353242,
          0.024548530835932926,
          0.03713596060146102,
          -0.00862412533403942,
          0.024199354084613274,
          0.015995473491706193,
          0.0761046633295015,
          -0.0862344744093783,
          -0.041554006843262076,
          0.0854486597777072,
          0.07403789306567297,
          -0.008412465442357794,
          0.02279064775370456,
          -0.04223355804218168,
          -0.05916729447810847,
          -0.00688686402394319,
          -0.027820906032543582,
          0.015870604753017162,
          -0.0801089905955292,
          0.08999859451669955,
          0.09224022467013303,
          -6.576647689287389,
          -8.145374326749591,
          -7.851596175072006,
          13.522253272158549,
          -0.852463912606872,
          -7.654236559018155,
          -3.0036210454395986,
          6.0167823374000315,
          11.584501279551462,
          2.2402152231627612,
          -2.0983688093854798,
          1.1539315649497046,
          8.858651413353638,
          -2.7527537719314537,
          5.737354507656968,
          3.67858982402151,
          -12.122950006815604,
          -3.073095774756797,
          8.999615577314941,
          2.6001519398392725,
          -2.945219212157432,
          1.6101056353295353,
          9.794552544186944,
          1.698171953273181,
          4.003638343038727,
          13.818941577441874,
          -5.8642183483183095,
          -7.806245977426464,
          8.465358750112246,
          3.833464343059062,
          4.076607497748112,
          -3.496449503978738,
          11.285471971456738,
          7.814039824259605,
          2.5529608007355753,
          -6.548995391950082,
          -10.89037794287903,
          -9.86420092968113,
          0.4988307696383628,
          -3.5130962196274456,
          3.3495531031538897,
          2.146517802357507,
          -3.8283933041973626,
          3.2067765996096513,
          -12.54195257888283,
          -12.402385445580974,
          -2.477930906191845,
          2.9011572751369936,
          -8.275777952512259,
          1.3206970535779454,
          -6.722501003212844,
          -2.2330057400975565,
          2.1765452712899744,
          -9.226165913742175,
          -4.101490205884716,
          -1.3293836586903052,
          -1.7852871921244113,
          7.982469961035771,
          -13.169710156782827,
          -7.551056153001776,
          5.339882567159086,
          -8.097546850618164,
          -6.828218512114146,
          -2.8335700566747657,
          -3.8794189468752975,
          3.8046631552880874,
          6.617370984360737,
          -5.339769126747496,
          0.31983371078651796,
          6.836885850458875,
          5.88280397332438,
          5.98280672202037,
          4.811260330983468,
          -5.776320921453043,
          1.9950554394179074,
          -1.360382403303054,
          -7.887303261822744,
          4.829954348599397,
          2.271105611520494,
          -3.391824242359731,
          0.9849810946493278,
          0.6905636034525778,
          3.254729072505741,
          -7.827014162867243,
          -4.392028179837049,
          -3.676243632610683,
          7.114855105595717,
          -11.167421562705053,
          -5.833134394996144,
          -1.1424173925177965,
          -3.9629817198180777,
          -7.056002038890586,
          4.388260102983875,
          -3.3176517399805587,
          -4.49070093224636,
          -6.34918964679785,
          -2.7219142698103314,
          -7.381659926087333,
          5.94856191282852,
          8.361881177326609,
          -1.3772823446467206,
          -8.365322982887095,
          -0.344211873248861,
          0.5196176747136919,
          -0.6199076602186996,
          -6.2259388413933445,
          5.007697473051179,
          3.2418469290865635,
          12.672040393462959,
          -4.714410943480829,
          0.7057293877142872,
          -0.11839160076339042,
          0.549508285694891,
          -1.3477437238214793,
          3.3136434507127492,
          3.2221003118135156,
          -14.210584973435088,
          2.4457451216576467,
          8.79135130964933,
          -3.2778314506119672,
          3.8250370076105678,
          -2.404967591608195,
          -0.6434014193129782,
          -5.6114913697476965,
          1.6025285446219848,
          -10.076367011242356,
          -6.532389658354738,
          5.735871426011662,
          7.788968848459235,
          -2.9344239763386137,
          8.732178672524359,
          -0.7502958030655076,
          0.24566320444856865,
          3.888652365330734,
          11.120711292806144,
          -10.309022272912246,
          -9.148518510263996,
          0.456284232371194,
          -9.867973157637143,
          -6.534440403037664,
          10.551273539599075,
          -4.458952539890348,
          -6.2500107300837,
          5.179149967444722,
          2.5809169606026616,
          2.2036690099928595,
          -14.463494669978036,
          3.634136419982503,
          -3.8065219766033143,
          3.5863051154830603,
          0.13500753723532072,
          -1.5839900645111928,
          -5.57191469707783,
          -2.298943182496776,
          2.334986744539199,
          5.342561419730029,
          0.7611615522214679,
          1.1062708744853704,
          -10.350175893585046,
          -3.6718047319586065,
          0.9007286565444773,
          1.4687541105878477,
          -0.310332406940982,
          -8.897146979317846,
          7.080838131827213,
          4.796584556061075,
          1.8918982695915627,
          2.460009125545046,
          11.216827736021246,
          -2.462904043681287,
          0.7414878981829846,
          6.2082303930744445,
          12.980323255314367,
          -3.385055029039575,
          5.851881850048279,
          -6.473921811781427,
          -7.583509682825765,
          -3.6304675922295955,
          9.21742505634334,
          1.656971934306345,
          0.3280242797607905,
          -2.436394265864224,
          2.7066944303896205,
          -5.9334962607809505,
          4.829442996598938,
          -3.4588098211465987,
          20.039953039635506,
          0.616713363039815,
          -1.8692238412000308,
          -1.9525927676332524,
          4.848267251503816,
          1.940838456233697,
          8.04328434326885,
          -8.146788049998975,
          -6.748079839929497,
          12.134594727881018,
          9.762444530514282,
          -0.8791389390673249,
          3.769782652390471,
          -8.097341543408495,
          2.6267824581017476,
          -3.116477639699474,
          2.0190118521442675,
          -7.011173159510457,
          -0.5263776254612846,
          -6.929659448658538,
          0.7844696903052726,
          -1.4425449403985853,
          -3.159298409369414,
          6.057363191523638,
          -4.0356889810341645,
          -1.7344770061209578,
          -7.058280040375261,
          -3.462469652562533,
          0.8571154714423768,
          1.2130883480434183,
          -4.034021656112209,
          13.988811032351014,
          1.5500187800177685,
          1.7007925237890043,
          1.6007353938158904,
          -1.6205783243954874,
          -4.548343208649672,
          -0.23476716033908007,
          -2.7679236727388767,
          2.9752200956101538,
          -1.6808188111826758,
          5.76172264885302,
          -1.0833615412463835,
          -1.320690861912714,
          -1.9937499107572185,
          2.7338345392337295,
          -2.2277605731465773,
          -1.407856655418621,
          3.0115793324517557,
          6.320610103958729,
          -3.2391747002434452,
          4.8817037204895675,
          -0.7211886775810809,
          2.755654042742965,
          0.7578549052633053,
          -4.0278126759818225,
          -4.161802351990279,
          -2.5682651069658005,
          4.477513391278254,
          -4.325725875707545,
          -4.349340921597574,
          -1.6764294972858726,
          2.1830260203521923,
          -2.947920620302443,
          -6.963731053075249,
          3.6642462642912026,
          2.3406960146819387,
          -1.1277983191941268,
          -1.4972226620762064,
          -3.088294534585754,
          -1.1402732052320848,
          -0.441266600652128,
          -0.7821354197124646,
          2.301006984255306,
          -6.8737499560972966,
          3.360873611929567,
          -3.202889196581339,
          3.6873239122579333,
          -0.3207444383370295,
          -1.6992262609495636,
          6.977219530595277,
          2.6038969356327164,
          -2.991193191790834,
          2.4372805600495,
          -1.5866422790460837,
          2.524646011628813,
          -2.1791578042846633,
          -1.539331602296379,
          1.9720956684232578,
          -0.5724467538821882,
          0.014884191937076898,
          -1.2249231820906081,
          -0.6201629243933445,
          -0.6222953788971004,
          -0.14693385412758322,
          -4.258251894804948,
          1.1461646483206975,
          1.9875380499670514,
          -8.84290121118252,
          2.7417431755735246,
          3.99577830243951,
          -1.4891619614946483,
          -0.8315278784403095,
          3.1978425884306385,
          -3.589073258712097,
          -1.2313048410855216,
          -0.9078802712914266,
          2.6548415526960896,
          -4.201674656787137,
          0.731354754179523,
          1.0124122330880472,
          1.9028520276697185,
          5.839519611202494,
          0.5516749933380491,
          2.6195740435024426,
          -6.9972243341671545,
          -1.0119248001229042,
          -5.9693139136435995,
          -3.473868024908278,
          -6.280255674774551,
          2.454251878250045,
          1.3461660033327425,
          3.082685660847735,
          -5.5624539224066565,
          -2.771046543096682,
          0.31589935986879736,
          -4.325701196507192,
          5.01442834637424,
          1.3292359470650505,
          1.4955428352846836,
          -3.2968872229447967,
          -7.669316417622074,
          1.0349988338315141,
          6.7413309538634865,
          1.6122645974251295,
          0.7608256056691796,
          0.25847807035374,
          1.6968878019263722,
          2.896768786802686,
          -4.438003388742785,
          -2.04702790154944,
          -4.7003528573657976,
          6.360219524229243,
          -0.6163030726090721,
          -0.607145125239294,
          1.4117925762722499,
          2.263661047321009,
          0.04216416285627226,
          -6.202784116970053,
          -5.888198810734301,
          3.6067804704206297,
          -0.10859293561227609,
          2.3410477350938033,
          -2.339433306380676,
          -6.084071781102939,
          1.7419825573963374,
          0.8027352593385156,
          1.08443847366877,
          -4.9389237425064705,
          3.1585547800094576,
          1.7994276113018617,
          -5.381342269033789,
          2.432474330708779,
          -10.003926242253462,
          1.7395248600695872,
          3.625964442797473,
          -0.8359631720495347,
          8.176281455548887,
          0.9203367265353086,
          -2.6551375918860427,
          -2.0685267617718046,
          0.5299957343411625,
          -4.496320230548898,
          1.4920660709147076,
          8.65085155938789,
          4.83780570674451,
          1.0415431116107199,
          4.06691117382643,
          6.23712797877799,
          -1.7425674554668555,
          -6.891116115542376,
          5.007802383956176,
          -0.006754908880094691,
          -0.1985870426985329,
          -0.7609329908039211,
          -2.696275782662916,
          0.9141745175232899,
          -2.9705394040507405,
          1.4577859514651688,
          -1.30649108041966,
          0.7685851607303744,
          -1.5963266247189543,
          -8.371751217472656,
          -7.037377871601031,
          1.9435370424507645,
          -5.801923431385707,
          5.778134260561965,
          -17.875286553308516,
          -3.0935751233632045,
          -3.598485469891274,
          11.277787062482334,
          -7.258773339805182,
          -4.4133153453783605,
          -1.991759191781929,
          3.6085265129227118,
          6.051625713610334,
          -1.8748251079931502,
          0.26495985940324074,
          3.0942523078167046,
          1.0244144999413718,
          3.10818165632171,
          -1.1435141688211832,
          -4.935060099277221,
          -5.248464730784387,
          0.21653023339495567,
          -1.4685321038814436,
          2.785802723559231,
          7.462362454635132,
          -1.3748017160210448,
          -5.922206630354988,
          5.233718635183481,
          0.04207275473591275,
          2.874853720814832,
          1.0435410294719147,
          5.011646257625795,
          -4.61489733979171,
          -5.456358123846457,
          3.51966480351405,
          -0.6715029398883795,
          2.473817266135368,
          6.457327315217666,
          8.42863476794738,
          -7.732092173899506,
          -7.0872861602384924,
          2.6956699452427655,
          -3.868083547184844,
          1.780992998429519,
          -1.0475096820686536,
          3.0389385050927222,
          -5.588781303324607,
          -0.4120670637620854,
          0.2535700925735319,
          -0.8470860651598792,
          -1.3438022110244028,
          -2.966518820302684,
          3.4717177230707432,
          0.6620395515222407,
          -6.714780894112191,
          0.7831916296147226,
          -6.484027542588287,
          0.1998865699969236,
          2.82607230532282,
          -1.7613286919439994,
          1.7225553570049257,
          3.336802495436916,
          11.33791895273241,
          0.7406639644562498,
          12.096867578887865,
          -4.078417947861348,
          -6.679578321736371,
          -0.7780562239252015,
          -2.855805654427008,
          11.539664056327139,
          5.110702634700597,
          -1.8770277685462837,
          -0.7994125058218419,
          -2.3502265493888195,
          3.9658387803955875,
          -4.0587671225875726,
          -1.3829292666152748,
          -0.6860541028349822,
          -1.3137356893180112,
          2.9472928341787394,
          3.103491999674608,
          -3.509254614878845,
          2.359408027774704,
          -2.89988416715946,
          1.0670319776190458,
          -1.7240191163570169,
          -3.8220130952805293,
          -7.087984382876845,
          -7.0430510037955365,
          0.4450627182779984,
          -3.01748971506662,
          0.8266960579650631,
          6.421949584034876,
          -5.856359345325252,
          -3.5309296648968846,
          -1.2832250220619654,
          3.7951534124829798,
          -0.9431467804588175,
          1.7804123315745655,
          -4.973785003787259,
          -0.9098934518676907,
          -0.9153277351169938,
          -5.620425180593241,
          -2.5818275955123093,
          -1.1983650139271425,
          7.024106312314971,
          -0.7750665666179616,
          -6.905309224120907,
          6.094157268282656,
          -4.2835157131090105,
          -0.17810883710134753,
          2.8478815546765386,
          -10.144501186859513,
          -2.642945370290165,
          -1.9042982486126374,
          -6.526597967825891,
          -11.71265002483123,
          5.908962644595729,
          -1.1983496484317353,
          -0.6218670207608961,
          -4.7413656149034145
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -2.544695582735423,
          4.941224415487403,
          -1.577779469924819,
          -7.712282608349648,
          3.521753901637186,
          0.5379460851268735,
          0.8390918749811143,
          0.7196395743327201,
          -3.9044233564700948,
          -0.5350745277728438,
          -0.818212768258477,
          3.1503995389653268,
          3.85182461337937,
          -2.4092613587092506,
          -0.23622964821556297,
          1.3710706691784182,
          -4.107195715935576,
          4.418082079918757,
          13.44076526509436,
          -3.6543613703091875,
          7.0812055669076175,
          -1.4880881844564113,
          2.3946167531367086,
          4.107066415483101,
          0.8133645531909045,
          10.26010250713373,
          -0.36067251312289583,
          3.6362362119511857,
          5.3442261441038506,
          0.2620624414579279,
          -1.1802369256371448,
          -0.6318622319145674,
          0.7894611707726382,
          -3.598942548178312,
          -2.625688375442876,
          -0.44313233762196835,
          -1.230159556577196,
          2.1165208381178036,
          -2.5050930851587956,
          3.09648188579033,
          -8.558947592631023,
          7.844768478291327,
          -1.0065273355191549,
          6.053424362675714,
          0.5767730291461534,
          8.898428361289174,
          -0.7804977846076214,
          1.919986302744977,
          -4.77908818163644,
          9.043655802110893
        ]
      },
      {
        "dims": [
          "50",
          "30"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          -0.08371956651722727,
          -0.7347349226958758,
          10.72587234787016,
          3.791709806032336,
          0.5870682398906983,
          -5.512375344904362,
          -0.7799357322724035,
          -0.3287801265029017,
          6.3737408113172105,
          -2.706399490483365,
          0.644002309463718,
          0.16621974188123956,
          -5.1721135616309795,
          -1.3261519980377,
          2.1625817301778474,
          12.53723711320231,
          -5.685999753202964,
          0.9750901037564587,
          3.817235383035389,
          -2.986110482695997,
          -0.7625903412917044,
          -2.4652701605973117,
          -3.9492431507496844,
          -4.876332346089732,
          3.3067173033944757,
          -0.5806640831738317,
          -5.556989978199181,
          -1.1411023544447914,
          0.6281865576615245,
          -3.3572115371506808,
          -3.364324236104073,
          1.3651230855686773,
          -5.249951144296239,
          4.001134617098655,
          2.057329073428082,
          0.3122874126645132,
          7.292845883967214,
          0.25626416648948525,
          0.8669683343918796,
          6.078234244806246,
          1.456042255074032,
          -1.9090383389994394,
          4.04219707818229,
          -6.728707945440082,
          -8.062672467798807,
          -5.289490327062966,
          1.1587421323359335,
          8.51219025176,
          -3.81989103651861,
          4.629017044926402,
          -2.7311464550208164,
          2.1772225296749284,
          5.849808007939732,
          7.604876779343263,
          -9.19956451483519,
          -0.9917278755321839,
          -10.94365197682672,
          2.5470045448149667,
          -0.7172148118969675,
          -0.897937481058788,
          6.563694533083237,
          2.0509715219613462,
          -2.585287553727355,
          -2.4179443087987345,
          -1.623539578410626,
          -0.9724060341255378,
          7.679856832455121,
          -0.22107261816059856,
          1.254724901024822,
          -1.3083248799442526,
          -5.765303835314675,
          3.5921634230381336,
          -9.146362503092321,
          -2.872488635428853,
          5.2407295342187625,
          3.932314162651549,
          0.02783442164833737,
          -3.933240375668448,
          7.498220419734572,
          -1.5681247569176036,
          3.7395078793611036,
          1.662045095024101,
          3.3853753147127468,
          0.770373325946451,
          1.9136461112811378,
          2.3787299778651385,
          3.803028620123917,
          -5.830038597140762,
          -0.35240664589098325,
          1.2966251883552018,
          -4.680580806974653,
          6.7450719684933045,
          1.4422334248876276,
          2.516073291495518,
          -4.728882102043736,
          0.22327701438638595,
          0.4518464287448368,
          0.041895278482276095,
          3.290304457501211,
          13.977336541069691,
          -14.473045000537917,
          -2.3388883323847844,
          7.085455500939486,
          -0.9691222703212468,
          -1.9223093006538685,
          -6.495977669757057,
          2.945613103451754,
          10.109826747447215,
          -3.86866310653194,
          -1.4363866064822624,
          0.29132380728713797,
          -1.9151398927718846,
          2.8732656660721543,
          -0.13376641844578205,
          3.1217923796565037,
          3.436130517824858,
          3.4481348328813595,
          4.4458877182303596,
          0.2570620315269523,
          0.04542864536549192,
          -0.09400066683574113,
          6.045911550042711,
          3.092950317082825,
          -5.560609917513356,
          -3.7580638031006126,
          -1.687917295868432,
          2.451381869947612,
          -0.8419287509749127,
          -2.4752185282167996,
          0.20536563791971918,
          -0.5395872720904159,
          1.3268615989843953,
          4.846373370695721,
          1.7891750239174813,
          4.106862638665934,
          3.5347364758175916,
          -6.802927330409838,
          -0.17533230480017456,
          -4.217794127065665,
          0.30540452766292886,
          -0.09583181119472638,
          -1.4796135300336208,
          -1.2180508553562128,
          -1.7398692471298176,
          -0.7024037615118783,
          9.179163264297484,
          8.3202306869391,
          0.10066730010111626,
          0.6749415945103041,
          2.576204093043322,
          0.41582883222090966,
          -6.381432148759711,
          -6.27575057282079,
          -7.111521135646531,
          -7.856454559999784,
          10.160076466484158,
          3.259492474332854,
          0.1915568306072501,
          -5.893695424448918,
          8.509091741926637,
          9.368082162180382,
          -0.01233260811587824,
          -1.545932206570266,
          -11.894182084143152,
          -0.47477984267039147,
          -9.23076657276809,
          0.648982331539143,
          2.461981026472651,
          7.8498279063911385,
          0.8220056103133817,
          -4.60423686104852,
          9.5919498084535,
          5.2179315893129745,
          8.235691944115896,
          10.43589825456648,
          -1.8021047390961265,
          -6.022125261001914,
          -4.529887983020311,
          0.08803899160703026,
          1.7292610388335925,
          3.5653114339683794,
          -4.151052633816577,
          3.4543597772917365,
          0.2926942615299882,
          1.3748906155434895,
          -4.829834239125356,
          -2.601570036778699,
          -0.8130323385017091,
          0.026439213659556426,
          -5.915611799179542,
          11.289655752956138,
          2.3982916540840593,
          -2.859459473205052,
          2.5716500322141562,
          2.9717860015092925,
          3.9579125853066626,
          -0.8528331170433502,
          -1.9586231768849396,
          -3.2203583332955428,
          1.6342760628571928,
          4.862952349660433,
          -4.951269859606469,
          -5.736532465858565,
          0.2879937204226812,
          12.389751335626347,
          -4.559213866694125,
          -5.3850324078755385,
          8.165281642603508,
          0.6207753339202438,
          1.0330623247811634,
          1.6832504217216289,
          -1.2629891644895683,
          3.3606976138029205,
          -1.758146877468936,
          -4.982927713726413,
          -5.684577968939713,
          -0.07577498571754533,
          -0.335811107100951,
          -2.027268776795118,
          -0.44816816899158035,
          0.05350376368363644,
          3.796830940760721,
          0.46399293527998936,
          2.549343075182094,
          -1.1360270758087423,
          -3.9419688091977862,
          6.471541720051868,
          -5.478320581022579,
          3.5278596446077866,
          2.013545520032869,
          3.0471985778309643,
          0.32774250576923314,
          -0.8609518971958322,
          -8.370318552570836,
          5.264071406735922,
          0.38148089837647964,
          1.9037567042401289,
          -0.5779541780863391,
          0.4604414202097288,
          -0.16420658321221643,
          -1.5428629676198564,
          0.054454927168351694,
          -2.590955589136478,
          2.8528432996547397,
          -1.00792231959737,
          15.737796190690997,
          6.018997823780955,
          0.049510009119170154,
          1.4297855675136897,
          2.5923211167306026,
          -6.239934999460677,
          2.6028218552808413,
          5.488341510721222,
          -12.06311273553813,
          -4.298009161860731,
          -13.199663423498393,
          -4.869440279402702,
          3.369222112895393,
          -6.314696901895295,
          -8.474593808433001,
          0.5130528176917722,
          8.077409220068029,
          3.515350026088735,
          1.7535069926349884,
          -16.23295249434385,
          2.6823893706341018,
          1.2222494897671385,
          2.0471277450076535,
          -1.2703275897709574,
          -1.0018066945597504,
          -3.447727764951286,
          3.962068495719434,
          0.41253726094253257,
          -2.8566566860879874,
          -0.5967504893719733,
          11.37515496681801,
          4.606107332453606,
          0.06989214448303582,
          -0.3608918129218473,
          1.9860953205112317,
          0.5162902472973698,
          -3.079795212919497,
          6.1592786854713095,
          -5.447598906151818,
          2.7423601658811174,
          -1.2649935477151697,
          2.9749252808100577,
          2.0620193368458413,
          -1.2431538422926611,
          -1.5681986088271458,
          2.289936433796629,
          -1.928488938664944,
          -6.853378785247595,
          2.6254391861753508,
          -3.513124498611221,
          0.4427304412067983,
          4.9112722107574385,
          -3.918728620630495,
          0.10021283510967964,
          1.4091922432163821,
          2.69292362524529,
          -6.286945800535737,
          2.046686290040411,
          1.1565768587843874,
          0.7256419722429063,
          -3.639859472804034,
          -5.842187188159055,
          -0.028993571977501967,
          -2.996921352992608,
          2.2973576278796037,
          0.8335836035593042,
          0.01782013423840457,
          11.237179638646701,
          -5.652500479929541,
          -2.3633642721559567,
          7.482835522857831,
          0.6312389212287487,
          -7.621198087417367,
          3.1144308576773736,
          4.345067549738433,
          3.321968229332278,
          -4.4743557882294835,
          1.0884996314033146,
          3.5645053616685463,
          8.683641073219581,
          1.7196417033282734,
          -5.798781127252323,
          -0.13890032139205583,
          1.2945050355651704,
          4.659873754535134,
          -3.2066055826393822,
          4.271524650274576,
          10.396463370502097,
          -1.0060970142645498,
          2.117343033950971,
          1.2555297863933168,
          3.7855795161663512,
          -0.6452439095675236,
          -2.0293896972569225,
          -4.45244363514693,
          -8.502584090669894,
          -2.3191721419950144,
          7.003140981855359,
          3.207964922226476,
          2.0439921276846134,
          -0.7110095367982645,
          -3.5627809795687964,
          -7.00924763454065,
          1.113313465988098,
          -4.3246765117121155,
          -6.1275876043461786,
          -1.6178827914915077,
          -0.04634137019503885,
          -0.9432125154704692,
          -6.7982922671544035,
          0.8757761457323698,
          4.039261978404042,
          3.7178134102139704,
          1.0824031535057534,
          -3.0670942199179057,
          -4.632404764350831,
          2.2866402663898353,
          5.764396553859097,
          -3.6011164020620536,
          0.8163432549070138,
          -1.4026215756878146,
          -4.1391789088043724,
          0.4582562040562192,
          -1.03178234606833,
          -2.2017066353155443,
          2.484193272130099,
          4.148396925162549,
          -3.6339842888670666,
          -9.870006776305921,
          1.570726925539826,
          -4.186046207507175,
          -6.324093999945315,
          -4.061396781762221,
          0.8306025547794447,
          -5.289142335400548,
          -3.6693770183718595,
          -0.17928107825323833,
          -6.718706160753554,
          -0.5327711521846936,
          -4.15982470346122,
          -5.472462015428871,
          9.867902513136796,
          3.738026141051461,
          -0.0842096237005079,
          1.3319054809350668,
          3.9454176767357807,
          3.9708096540161373,
          -1.8046341047008727,
          -4.422015065604405,
          -3.822532284458529,
          -16.04576050237965,
          -0.6993461631016945,
          -1.05185763336182,
          -0.7161212584985508,
          -3.4388757483888557,
          1.9440846577246786,
          -3.8807986011791655,
          -1.8494315596088693,
          9.133266523312205,
          2.2501161091714468,
          6.345372178909366,
          5.365835945399991,
          -9.045522995488579,
          -2.628638475234337,
          3.923733880328476,
          -0.6803161317012663,
          5.794356233448394,
          1.1852596772945463,
          -5.73816459821399,
          5.077897711917949,
          -0.9745303395615389,
          0.6654795197403303,
          -3.2915569649368273,
          0.555365290862666,
          -4.713123421161671,
          -0.8049215093751421,
          0.5054842460305812,
          4.709402629064614,
          6.588477315076078,
          4.849796349060849,
          8.906261589999378,
          -2.2326396726283506,
          0.4594903109814459,
          2.1412231384331264,
          0.39832928590531574,
          -0.8107072102385499,
          -2.1952140333145262,
          -4.15434084805471,
          1.3608004040094266,
          -1.1799449676542761,
          -1.9106659551370848,
          0.8724526450048414,
          0.2805106337186217,
          -6.740430424531472,
          -6.67852962972089,
          -4.297937388545521,
          -3.2661019409466925,
