{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Relu",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Relu1",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Relu2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "20",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          -0.5801456058310795,
          0.5606086914050179,
          0.09953353289983533,
          0.37340986330256465,
          -0.1140502936944283,
          -0.3677565987992346,
          -0.897720028211898,
          0.3241985397901588,
          -0.2532654162563077,
          0.26301667522767846,
          -0.3283062266147094,
          0.6218232998464245,
          -0.029553174138252102,
          -0.3407620645142814,
          -0.21695768463163848,
          -0.31067942333238174,
          0.40366633801021523,
          -0.18394632718419382,
          0.03281985978067817,
          -0.08077129433147197,
          0.5233443777121203,
          0.08016241067108856,
          -0.5653502536534328,
          -0.030915906280532014,
          -0.5080993797583963,
          0.26079510513372045,
          -0.24159959886822474,
          -0.5584196787095608,
          0.09101080682490839,
          -0.6323781127355405,
          -0.09506205681191965,
          -0.15035525415562664,
          -0.43677875159199053,
          0.6260681673310793,
          0.41469431668782636,
          0.09801767834003186,
          -0.11348617075512633,
          -0.6163553339173079,
          -0.11074761657929504,
          -0.05413848240619143,
          -0.35063164326925894,
          0.08082056750577839,
          -0.7225121916128432,
          0.2542514248952871,
          0.09847346031795769,
          -0.007913094626983454,
          -0.17643402609726105,
          -0.09280223228160912,
          0.09532863224056169,
          -0.29892904079038984,
          0.3200488192987597,
          0.41603161778335174,
          0.46951628153804315,
          0.4253822616711135,
          0.11068653602497072,
          0.3975601435759585,
          -0.40215856453784016,
          -0.11947921998117472,
          -0.4732257677656963,
          -0.5957800463836787,
          -0.06287621561382206,
          0.0023386244077813843,
          0.31173038216975013,
          -0.24614953042857207,
          -0.24451703279792247,
          -0.01405593012145196,
          -0.002769002825435661,
          0.16192291793894298,
          -0.19272557250082026,
          0.27489854036391326,
          -0.18234284661153052,
          -0.20706030426514271,
          -0.2975847567100206,
          0.17102398726340817,
          0.4465777102158698,
          0.2496499156553109,
          -0.013315195098971675,
          -0.6706151566180646,
          -0.3143329774366912,
          -0.5005623919175949,
          0.4404094103467417,
          0.1753042712996869,
          -0.27761798656992914,
          -0.44497623830661986,
          -0.03452196743993974,
          -0.176964679148512,
          0.2006004155070208,
          0.2329631338416524,
          0.3981216422051185,
          -0.5203378633686374,
          -0.43692443331095626,
          0.38353564790698114,
          -0.06151549027131702,
          -0.09507507890132515,
          0.0686607483860092,
          -0.3155054652424777,
          0.2908179381721232,
          -0.0992563422123621,
          -0.03210608447191484,
          -0.49148463583683627,
          -0.6136305668437863,
          0.3046359788609135,
          0.002318740250912052,
          0.09536084343067927,
          0.31926204832462074,
          -0.5640853359406334,
          -0.029274183143029837,
          0.2283571644321768,
          0.09413722331796973,
          0.006349245187424894,
          -0.46201385191311223,
          -0.02240077744381477,
          -0.06820607206875144,
          0.15500239970839816,
          0.12523123134629116,
          0.68465287382387,
          0.12783537283094346,
          -0.42363399529138546,
          0.27104746474870056,
          0.09397120849074028,
          0.31943506691363827,
          -0.1450713793241207,
          -0.45345614613967183,
          -0.9997725114845855,
          -0.4125082883020057,
          0.028767101916946543,
          0.5708761473077196,
          0.41970409185694507,
          -0.9568959278522849,
          0.1353556375068037,
          -0.587897274930476,
          -0.15487462209263828,
          -0.24053704150559918,
          -0.1700696116355478,
          0.15746221726856863,
          -0.06147758405437539,
          -0.18228518823633258,
          0.031247964406253874,
          -0.17470952261710992,
          0.6354299483908774,
          0.4543064124195498,
          -0.32947120161262117,
          -0.1437044623659444,
          -0.15642591567654957,
          -0.10557758668706657,
          -0.3819826403007908,
          0.1692302557935825,
          0.22728890660656592,
          -0.7096599465594065,
          -0.1704471480790298,
          0.05640432379170801,
          -0.14151836098121282,
          -0.5157045951624017,
          0.10876406105599784,
          0.33860378296256677,
          -0.18477017656828082,
          0.2074544384332342,
          0.23290752108016188,
          -0.28784302818807955,
          -0.017963560805318968,
          0.27359241701569564,
          0.6481153237959909,
          0.2153457900899722,
          0.14108978816933873,
          -0.08101561118626044,
          0.21648730411804934,
          -0.11041701972660369,
          -0.19820400914918107,
          -0.22775841995286758,
          -0.052255881707792176,
          0.018189654752107477,
          -0.8190215423876834,
          0.24941511049578802,
          -0.2632540416392804,
          -0.010442913709284157,
          -0.4159152377019872,
          0.5067148660174304,
          -0.03646481274351912,
          0.3255697063103441,
          -0.07683011262113078,
          -0.1924577234724249,
          -0.611561398589172,
          0.31323133567810024,
          0.6920674523091299,
          -0.40464781680157763,
          0.41396531979499096,
          0.3315578984559587,
          -0.43153721716561105,
          -0.1943590989211108,
          0.034559050458149033,
          -0.4621059008065872,
          0.49850842108452065,
          0.5863407180038251,
          0.18415969117781078,
          -0.0299889650662668,
          -0.36223567199292644,
          -0.018982026757487478,
          0.2874956925446739,
          0.7856516506532522,
          0.438993555029585,
          0.3013254361968031,
          -0.903661745911223,
          -0.3940836756712969,
          -0.09084521680279002,
          -0.18892351227783716,
          -0.4991377594258503,
          -0.49329346384216904,
          0.2075060197721253,
          -0.04828760060624966,
          -0.006203838582923323,
          -0.2890933595126195,
          0.4375656678993103,
          -0.3376651975942834,
          -0.6309782454759814,
          0.2544373113180881,
          -0.950426572433865,
          -0.3320698110208755,
          0.008660425217530484,
          0.3150658183801777,
          0.640813062042595,
          0.15310241191160542,
          -0.014920777017880518,
          -0.3146203653727517,
          0.06067655387722354,
          -0.5220033191994929,
          -0.2906619261418181,
          0.6455293809461369,
          -0.33165803743934086,
          0.3812354014161639,
          0.19735166140109842,
          0.4625363612072853,
          -0.20924442958927345,
          -0.10644019158779888,
          -0.02512431952425918,
          -0.04328874585109527,
          0.05756652464215977,
          -0.7580249953435004,
          -0.6011990029658945,
          0.18482857379553455,
          -0.20919705704723984,
          0.2719849366578513,
          0.24601274354730457,
          0.2370069918672491,
          -0.3886245586815927,
          -0.6851925815667966,
          0.32689104282998244,
          -0.41936676204931334,
          0.6681113863876234,
          -0.15504253684122943,
          0.11523075900317226,
          -0.22475371802624433,
          -0.05933038073254304,
          0.5165591527815737,
          0.3593615544596925,
          -0.24445482201571644,
          -0.34920090410875926,
          0.43363262919754186,
          -0.2269594462391311,
          0.0516477547222353,
          -0.18951720159590799,
          0.31511437954139265,
          0.4839028739590787,
          -0.5191302770257226,
          0.2796495859122979,
          0.3401684411295198,
          0.2461280988715758,
          0.02041355183480686,
          -0.023001634637286886,
          -0.2657738719199093,
          -0.39571987496541344,
          -0.1754432643862418,
          0.7460590602794839,
          0.561029192047897,
          0.2054266097065593,
          0.020083802978367024,
          0.34852588103519716,
          0.48854444556353943,
          0.15852403415273292,
          0.32746238404904043,
          0.2042740792337605,
          0.6379990637910423,
          0.14234024510197296,
          -0.4988715506629297,
          -0.4138722059211851,
          0.5040519498791526,
          -0.3296077230335734,
          -0.5781607566230823,
          -0.1483093829759371,
          -1.2001844314691843,
          0.2838504078637691,
          -0.8426087882711975,
          -0.5599562737015337,
          0.09082260195318166,
          -0.2990015094531438,
          -0.3579813327660344,
          -0.12453750635491492,
          0.41624689184618463,
          0.03297327733641276,
          0.5470926562197819,
          -0.3367630872696172,
          -0.6451233471625832,
          0.12389998880801155,
          -0.022789609675294767,
          0.27544861918728447,
          0.04470806555755072,
          0.6329476027799426,
          -0.6109053575333355,
          -0.13634888857712982,
          0.5303167298843455,
          -0.4797279724451171,
          0.13124891069825803,
          -0.5055006076860448,
          -0.8173200672537275,
          0.44819041558957673,
          0.3309043718183753,
          0.43237968147229555,
          0.27205773716144527,
          -0.35623741015457294,
          -0.44728133984653795,
          -0.0880865795403107,
          0.07669493256887326,
          0.27698753761520156,
          0.005376900816284021,
          -0.22360348814431846,
          0.3989935261652253,
          0.5928090667831037,
          -0.06714370393636299,
          0.054098818767792024,
          -0.24698786099349654,
          -0.19102147080321988,
          -0.40043915159622456,
          0.3432331800828568,
          -0.7998329414878026,
          -0.06381780967067205,
          -0.8518459702462,
          -0.3326588551251333,
          0.6192535863522725,
          -0.4117603278015903,
          0.04239455352837495,
          -0.24573787519448795,
          -0.14209456448126398,
          -0.4116239214364229,
          -0.23816597874198736,
          -0.07583208414321266,
          -0.06513987984394914,
          0.20142427106384203,
          0.12245289681771573,
          -1.1439680369762117,
          -0.24035200046889255,
          -0.6994293917769207,
          0.26169552901551235,
          0.5074669660483099,
          0.3914869895050422,
          -1.1059904333502162,
          -0.1365367993859728,
          -0.0014508417961900904,
          0.14880803926340425,
          -0.19257378224910562,
          0.13281877185403557,
          -0.21603400096988665,
          -0.25386583121372325,
          -0.35193753500890135,
          0.09162963986560285,
          0.12208410754786897,
          0.46397918976216107,
          -0.3629445799443375,
          0.17350991385759895,
          0.19650801402483953,
          -0.5606216372766757,
          -0.6184669815088302,
          -0.1605057986380338,
          -0.501992652151229,
          -0.3323354271677572,
          0.3149121478289362,
          -0.2509613099423199,
          0.10938050559824264,
          0.18954440723026886,
          -0.20683709333642414,
          0.06877580938285834,
          -0.285539308551286,
          -0.5630271827948586,
          -0.10396428267091305,
          0.6118891023676303,
          0.4439825927188507,
          0.28237921057043414,
          0.2981150036856709,
          -0.5341166553573111,
          -0.2292566352703056,
          0.11134482130712318,
          0.4673142233526751,
          0.827272715496755,
          0.03271905953797104,
          0.4725875088527821,
          0.37433775508125416,
          0.30804536488050976,
          0.33626275013536894,
          0.36715170341542375,
          -0.1364287760233613,
          0.2492494152135014,
          0.05238340431499547,
          -3.157562260542012e-127,
          7.332775850554427e-127,
          1.2199273487875727e-153,
          -2.7199773651509798e-135,
          -2.4970779241661037e-147,
          -2.0022012906008123e-128,
          1.442181986540566e-151,
          4.78352484354061e-118,
          -5.775388346700421e-127,
          -1.6958003008580046e-126,
          2.8375333205677256e-147,
          -1.7657332148331112e-122,
          3.042189885650648e-122,
          2.5482085343412283e-152,
          -7.487216599624875e-150,
          1.9681885831832023e-152,
          1.8253447782694347e-145,
          -8.048488938851456e-148,
          -6.952766421702869e-148,
          1.1361506558865965e-141,
          -2.0072394466359135e-138,
          1.511047901293671e-139,
          -2.1390013076053042e-126,
          -1.1267704865291273e-153,
          6.222143423552526e-123,
          5.750002856031306e-153,
          5.226748906507014e-152,
          -3.647743073031009e-128,
          -5.526962620383062e-149,
          5.0098087006424734e-129,
          -1.353810561930719e-131,
          -3.885887980922499e-141,
          2.2986753049687682e-150,
          6.617901650480892e-128,
          -2.292162968357489e-125,
          -9.064963562229764e-146,
          4.278489164038461e-124,
          -3.119349566829141e-135,
          6.903251462129966e-146,
          1.661189532569343e-125,
          -4.160402095808717e-126,
          -2.9847537697357355e-118,
          3.9555935778397035e-150,
          1.3619112071985104e-150,
          -7.108186655533263e-136,
          -2.773669412482651e-122,
          -7.611944171502027e-119,
          8.843773938204895e-142,
          2.3812584636436163e-150,
          -3.4823801051119334e-125,
          -2.285364894592955e-140,
          -4.689257879407876e-152,
          6.443723079009648e-152,
          -2.9149994900450233e-126,
          2.831641445741114e-128,
          -1.4910736061779833e-153,
          6.345109167956328e-118,
          1.597710265172097e-152,
          -1.3932428896063777e-122,
          5.980522453327555e-129,
          8.464091614454329e-129,
          5.305053971651194e-149,
          1.9897210951812454e-142,
          1.6381269262208628e-152,
          -6.480297933665066e-121,
          1.427350556154204e-150,
          -1.873956997809445e-145,
          4.733262607259842e-131,
          -2.0059051948772736e-139,
          -2.019132289300942e-120,
          6.391201651948909e-118,
          -2.8775295877878384e-120,
          3.4967148340440657e-121,
          8.263942898644773e-128,
          -1.3745620786338743e-152,
          1.6265693662081724e-117,
          2.8566147504059507e-124,
          -9.477600315479807e-153,
          1.4452003784566644e-120,
          -2.852525058145233e-153,
          -2.1209734458668693e-150,
          -1.2328250868858657e-146,
          4.450277787410508e-153,
          -5.184700611053913e-150,
          5.205895195654805e-152,
          -6.314661522814495e-127,
          1.1744389723740863e-121,
          2.055864416157321e-145,
          1.1936336588431182e-122,
          5.223282398099645e-128,
          2.7931217278944576e-152,
          2.3127429996088535e-150,
          2.7995839196239245e-144,
          -9.491515738994212e-137,
          1.3623194797811763e-152,
          -4.071289939170308e-149,
          -1.5781202407901077e-151,
          -6.502517685897798e-125,
          1.8444407539697043e-119,
          -1.4679131406595023e-118,
          0.09065925127356499,
          0.31133448166741745,
          -0.23578077110647508,
          0.06588643476321451,
          0.1100351074112743,
          -0.305145088511548,
          0.24976093754512557,
          0.38747279473129104,
          0.33585805095490684,
          0.167922407338162,
          0.013336735252260796,
          0.2660160026465105,
          0.16910324534139093,
          0.07727947158774222,
          -0.634526598390655,
          -0.31843971864078235,
          -0.23471415708996657,
          0.40158137411367983,
          0.531566090833323,
          -0.6622906054897583,
          0.34058112476148256,
          -0.09560494533955712,
          0.5416330141423992,
          0.4301171726237513,
          0.03566276108053988,
          0.16050897838839373,
          -0.0895408691879035,
          0.3354018222456391,
          -0.38810420384905214,
          0.3902616405091918,
          0.4337203983384575,
          0.6253018318525366,
          0.2742460608999916,
          -0.26069283484384154,
          0.2027631157209567,
          0.4633931789762142,
          -0.06783013910319878,
          -0.42680792086263813,
          -0.3617209692044502,
          -0.22952395670268658,
          0.12966326225846023,
          0.26555005588284186,
          -0.8004325165524264,
          0.08201726871367973,
          0.35714753364181906,
          -0.020781897115317968,
          -0.09074021259523204,
          -0.05759475753953087,
          0.36980376643591883,
          -0.19998074430048302,
          0.14059539968324283,
          0.40195823882204,
          -0.16532097144958038,
          0.01406464627000194,
          0.2915498183161579,
          -0.3177333085078485,
          0.068085283178853,
          -0.31913832048860913,
          0.1795794985205512,
          0.4105313415626829,
          0.3291651386575984,
          0.19181608950464435,
          -0.5142300878132077,
          -0.572383640957468,
          -0.30991767608317844,
          0.01669876819365761,
          0.0923849485855715,
          0.24400839389692988,
          0.6244511347152626,
          -0.09928330804285691,
          0.45727178193730555,
          0.5306152279426556,
          -0.018839636393261833,
          0.3183972456824775,
          0.3155229825004899,
          0.6858820403688664,
          -0.4871559513310991,
          0.519296620022005,
          0.32010844071758604,
          0.13062491403942378,
          -0.3004005028855102,
          0.6424069798899411,
          0.005441967349054874,
          -0.4277428564971033,
          0.22094151184975896,
          -0.01073218454664175,
          -0.22150855862014343,
          -0.2382075967880435,
          -0.4095234866417312,
          -0.45689427383765097,
          -0.5197140303158968,
          0.09017841413145161,
          -0.10998189720959538,
          -0.11167605483571062,
          0.6287660395347691,
          -0.01899525735701891,
          0.06220994907644668,
          -0.13703884243440317,
          -0.1834680220739609,
          -0.16219910056181316,
          -0.46228242477302894,
          -0.35780134319144824,
          -0.014772658163770408,
          -0.3755532772520936,
          -0.2608930372320049,
          -0.021411264706136773,
          -0.2735423372819851,
          -0.38775679121746465,
          -0.47272272118370806,
          0.059786392534488884,
          -0.3625391876213507,
          0.316845356250469,
          0.37972048165715205,
          -0.5074309192740438,
          0.04413051356239664,
          0.3381158688563796,
          -0.7981856268346279,
          -0.11621344993106768,
          0.1994979470483298,
          0.3096889612913013,
          -0.2749688210275068,
          -0.1216392060674718,
          0.11479028893014874,
          0.20484409237768697,
          0.44325887634126754,
          -0.13658250856204882,
          -0.28019197701550164,
          0.3585740034856986,
          -0.19374466018887784,
          -0.06436774641928425,
          0.02270314214070955,
          0.238701373870216,
          -0.12009784550778917,
          -0.03897209198107141,
          -0.21928916375802668,
          0.06836269902314221,
          0.306505569969216,
          -0.33614530976436885,
          0.1817103626874626,
          -0.18033002828279862,
          -0.4865526008050344,
          -0.0876043780330393,
          -0.09806123197360118,
          -0.38552149344162695,
          -0.3560262312639945,
          0.27822785805398076,
          -0.010015518754312929,
          0.486546219876684,
          0.5948001338663363,
          0.05274914505015925,
          -0.33111995001913447,
          -0.30638406332917456,
          0.09542294369908938,
          0.5530840874809202,
          -0.09750669017974366,
          -0.29745541712286844,
          -0.2225710443497593,
          -0.13757685422794955,
          -0.22697735528479418,
          -0.1011253668632324,
          -0.19242135876991276,
          0.3759114340680608,
          0.3549177872270246,
          -0.016747712363913106,
          -0.6463193980991226,
          -0.01203781310800113,
          -0.3337303785370343,
          -0.17629363673135914,
          -0.3645473052949087,
          -0.37247020417634014,
          -0.3713729975678043,
          0.2282945016665616,
          -0.36702256690657736,
          0.038472010115728726,
          -0.06980181426612188,
          -0.005882528393646626,
          -0.28674184073573333,
          0.12467346319108263,
          0.5063993266817736,
          0.13287065353160774,
          0.22004795794272022,
          -0.06841395534558609,
          -0.4538708782474983,
          -0.2774751625782011,
          0.36309135795165653,
          0.1630349661102853,
          0.21641352673759223,
          -0.05931951439560482,
          0.4684359920700349,
          -0.22124727430902458,
          -0.06807733137612104,
          0.19683706994069727,
          -0.09553580737509805,
          -0.4446707077142329,
          -0.4350098615121861,
          0.056268806330499216,
          -0.26463720765186033,
          0.37666712269980246,
          0.02045032347782978,
          -0.09885900872597154,
          0.19305755153027332,
          -0.5906371618918643,
          -0.2489784140986024,
          -0.150956340148819,
          -0.7161914134689682,
          0.4213144686449296,
          0.31170698659428253,
          -0.06806409438171922,
          -0.03965417204712013,
          0.23769713312105817,
          0.14251289188871155,
          -0.05113120685711651,
          -0.10662988231413147,
          -0.21432298834709135,
          -0.10755369742589604,
          0.492950989698728,
          0.028605875804073592,
          0.09110478853825014,
          -0.12883127576590675,
          0.18286288044040527,
          0.47397103692457737,
          -0.3069434615347067,
          -0.0663939047715981,
          -0.04907554180529835,
          -0.08882818478726033,
          0.33623890236088877,
          -0.6102942995900085,
          0.2941816383852901,
          -0.6055526161849455,
          0.11804510315339832,
          -0.2851390936657074,
          0.426406763595941,
          0.34893287873762124,
          0.19439986814087254,
          -0.24738577700355835,
          0.5900596807297607,
          0.06553121994172983,
          0.30885695531921226,
          0.08155606988441427,
          -0.21674428551356792,
          0.017999826972655935,
          -0.2931741863962897,
          0.1639562006599505,
          0.23480894960678877,
          0.1632572039170467,
          0.19228322266942766,
          -0.19844833505111883,
          0.07657705637006607,
          0.05488875259532269,
          0.362379524102042,
          -0.2521067902244793,
          0.39010919446230247,
          0.2245256928911779,
          0.061869680876924404,
          -0.3287499633005524,
          0.2153593013487546,
          0.16500347430691828,
          -0.20519055876231407,
          0.4448880859274875,
          0.11919436106517012,
          -0.29674846917180425,
          -0.35144488610301106,
          0.20440159939636238,
          -0.04718797768761267,
          -0.11122768547367834,
          -0.11699181201227106,
          0.17912847840943813,
          0.3613769262097848,
          -0.16164755086914082,
          -0.03835202058600386,
          -0.23161123273276293,
          0.4348651698146329,
          -0.3796188329697049,
          -0.14513530892256024,
          -0.01486828482685962,
          -0.4804907285685079,
          -0.14101290478798242,
          0.13884929811293395,
          0.32527941653503295,
          0.24355450183487024,
          0.2907818884368796,
          0.2992788121246108,
          0.08434910703451633,
          -0.12926572137471204,
          -0.06649590923779868,
          0.4102300709040245,
          0.35529563817896226,
          -0.3126531232389523,
          -0.40130593983679014,
          0.6264566535618952,
          -0.14356165157287865,
          0.08715650946817582,
          0.14531239004044505,
          0.6094469386694366,
          -0.41973178583179416,
          0.38020903977325693,
          0.3757533817232156,
          0.06058306662706682,
          0.04884708961633398,
          0.18751292578765588,
          0.4425607308817256,
          -0.4821633798590638,
          -0.0227380523355488,
          0.4503396836979505,
          -0.20479549748870957,
          -0.3931753972288201,
          0.19762438758925424,
          0.366059347710597,
          -0.37608321314508925,
          -0.9436224597323607,
          0.45129539919724787,
          0.03013040561560669,
          -0.38607462433798573,
          0.25760337939861105,
          0.4684221260791049,
          -0.23056410865293492,
          0.11540879074872837,
          -0.3363018353792568,
          -0.665248803863672,
          -0.17232735132590227,
          0.40179909174138134,
          0.08427282647565462,
          -0.29684141130315456,
          -0.054133375689265614,
          -0.17024259919745582,
          0.30449551485301046,
          -0.02009419656806643,
          0.23920616027962271,
          0.24256814782957584,
          -0.2927110647674643,
          -0.3262162892820253,
          0.22741395598927272,
          -0.5567313483844349,
          -0.07781934876267545,
          -0.02844512365105177,
          0.09029072531537265,
          0.3613223928756676,
          -0.26392423369135737,
          -0.22526985967884386,
          0.249432632541758,
          -0.1826683504253601,
          -0.06816599992833353,
          0.07112111004351922,
          0.26365370277020117,
          -0.14446132525921487,
          0.27602076337962755,
          -0.7261127800172212,
          0.30954280291372316,
          -0.5401426658093151,
          -0.07227025970768247,
          -0.22738356073620072,
          0.101807831152855,
          -0.5808801989735622,
          0.12533628461530033,
          -0.2932841699938597,
          -0.5292625341612698,
          -0.6942451488346152,
          -0.07772406811331262,
          0.11771133920649592,
          -0.25017459290359634,
          0.05870710145813065,
          -0.10705301124666593,
          -0.0509110972184506,
          0.003530539755988566,
          0.1442041207300886,
          -0.02164534603056531,
          -1.0928348432183792,
          -0.0653910373101927,
          -0.08572527513113277,
          0.12490464570258517,
          0.1868136472381385,
          -0.2279062264120762,
          0.11827003938466903,
          0.21220827075932397,
          -0.23069580046628166,
          -0.42565700506654297,
          0.1684731793502243,
          0.04715979052148266,
          -0.38829169981685646,
          -0.5323305434055294,
          -0.06376909144711405,
          0.6162888457278128,
          -0.17268966454966544,
          0.10904312631109499,
          -0.04222801681528836,
          -0.4109261432376018,
          0.4371403849861633,
          -0.7343424244815964,
          -0.6894222107987933,
          0.1068312063325499,
          0.2177895286951137,
          0.3927649647762163,
          0.3346597626443751,
          -0.32254958991775834,
          0.20067720234159594,
          -0.5041251934134761,
          -0.04718633458450397,
          0.2578610440935788,
          -0.6039780492423243,
          -0.007886036825764796,
          -0.488839889059762,
          -0.22332478521787733,
          -0.12241128519941363,
          0.05818077511939557,
          -0.2166010400155457,
          0.4556387912348926,
          0.5523040321732704,
          -0.41537530699379055,
          0.2039261110388471,
          0.19073819602040534,
          0.3279122061740621,
          -0.2578499052621155,
          0.1249301989939576,
          0.3428841043592693,
          -0.03856836041788129,
          0.12637883544285808,
          -0.10656213545736785,
          0.8366750753197061,
          0.4889780851195793,
          -0.1304245235506529,
          0.2690304872822369,
          0.08398496438353932,
          0.2776503544476522,
          0.12353748357978564,
          -0.0781807914373429,
          -0.5816513351700976,
          -0.02534351842353775,
          -0.322767583075176,
          0.2878347913222669,
          -0.2108405863918097,
          -0.3742956585787202,
          0.10088112353235223,
          0.47928299855659406,
          0.0013457776800757577,
          -0.29291336187251965,
          -0.6771069783465452,
          -0.1854122475590743,
          0.1786225038602191,
          -0.2037204570429912,
          -0.033132494598023136,
          -0.4042018643062521,
          0.40734126342351773,
          0.28015456451716464,
          0.36482151791968953,
          -0.31896583129142403,
          -0.9288999920057998,
          -0.5827441145345696,
          0.11086171854205104,
          0.26386232962879264,
          0.16115747269141067,
          -0.19444577663332185,
          -0.08864291305046317,
          -0.3317952190905562,
          0.25945130176833037,
          0.17170591605521515,
          -0.06428228922168731,
          0.46161869427084956,
          -0.36561384762097826,
          -0.06605626468183669,
          0.028940477046471527,
          -0.7132057976075423,
          -0.4023962344614946,
          0.21620490192606054,
          0.09726605365347538,
          -0.18829435590030458,
          0.05688244800231646,
          0.2295996089379843,
          0.004670329111476649,
          -0.31786515577974406,
          -0.3519041435916752,
          0.6441779215383742,
          0.2749441546982543,
          0.08204363266540997,
          -0.3240542928533471,
          -0.5343054689516116,
          -0.4639515469421378,
          0.03476046577661013,
          -0.29949010274986215,
          0.14267752746098356,
          0.3146819478402208,
          -0.3589854207008454,
          0.3650729142639124,
          -0.6067275894636446,
          -0.5294348942608758,
          0.3913029537902592,
          0.1720367349098771,
          0.5985632604521054,
          -0.4236130411807885,
          -0.1776342638662637,
          0.7800736069249882,
          0.19358408960761553,
          0.47467037404732887,
          -0.3670797962203526,
          0.15120118250071277,
          -0.15264372103732687,
          -0.6860816107970916,
          0.4778260632386179,
          -0.23711349145226124,
          0.5380461710899401,
          -0.2506658469161039
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -0.25732817941822633,
          0.28897396103771567,
          0.32580774429733,
          0.33980119024512984,
          0.5384499214604912,
          0.4464455737647538,
          -0.06677093923985103,
          0.12185645548963132,
          -0.17389487996470365,
          0.0642343202154582,
          -0.07790996178387043,
          0.21413642532413424,
          0.5954973568912952,
          -0.6105003327821356,
          0.33394242500752636,
          0.41267928847099333,
          -0.08144485804411454,
          0.12663103254215716,
          0.5722903622731907,
          -0.5575873127674476,
          0.3533242735377923,
          -0.3864240070935793,
          0.5002135474973106,
          0.5472768507862574,
          0.4673207930193053,
          0.26675442741549754,
          0.08376418563394736,
          0.2959513642135615,
          0.008077316957091456,
          0.3366274223426736,
          -0.41850441590442683,
          0.11188454274434925,
          0.04808401027294791,
          0.28113983065743686,
          -0.0890568131401662,
          0.05404827469364307,
          0.02249709278773851,
          0.36207839154097965,
          -0.4981240000090294,
          0.2613868553976553,
          0.015802222806700822,
          0.14946636862964544,
          -0.02100888015481256,
          0.24273033620836126,
          0.32295915397182207,
          0.23846764940191112,
          -0.03161471723644559,
          -0.4914612659587547,
          0.3622027577809176,
          -0.48192035272158745
        ]
      },
      {
        "dims": [
          "50",
          "25"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          0.4090473483980482,
          -0.5057247027106433,
          0.47240573540580916,
          0.04893774845298259,
          0.7356449368029835,
          -0.4015186316712068,
          0.07182553796857158,
          -0.4496565131590157,
          -0.27217000274331976,
          0.06908487556369527,
          0.444554167718755,
          1.1705381129094137,
          0.44075499454392975,
          0.02672809942828747,
          -0.4357586675287361,
          -0.1732895003501415,
          -0.386199032184835,
          0.13862797417334366,
          -0.4297025119723589,
          0.126007738338984,
          -0.282806344769718,
          0.11345998900394944,
          0.004436974313461563,
          -0.48067168818109923,
          -0.12717383610538976,
          0.05772056300730616,
          0.38771708528869575,
          0.027723828393509644,
          -0.3549381089366427,
          0.12442477429474742,
          0.32403082518503906,
          -0.42100680645025684,
          0.6082511548141858,
          0.5595030768471456,
          0.018690968567892843,
          0.18464494704108275,
          0.19717709541892,
          -0.650527187361953,
          0.38994716749771346,
          -0.16804378408753096,
          0.4193849056536377,
          0.2537674104852345,
          -0.19840390588751067,
          0.4377538877981143,
          -0.7493254937251435,
          -0.40935325999003275,
          -0.1284324512213711,
          0.03247354737429301,
          0.5083365296472705,
          -0.1031016535895439,
          -0.5680344296624746,
          0.32412150200164885,
          0.33179862479648503,
          0.3498667977904614,
          0.4107743554965058,
          0.05079081828797007,
          0.2446427548073475,
          0.39063682969508806,
          0.34335984162567035,
          -0.3384612396600405,
          0.15317553654918023,
          -0.1235646448237195,
          -0.4938982732728557,
          0.14282574821757957,
          0.37022777316040784,
          0.008515813377764218,
          -0.022402674916603808,
          0.062120694167205115,
          0.13993278804036974,
          -0.4495693688672673,
          0.16827095545223006,
          0.5425752041828615,
          0.26188156269857893,
          0.11213950724760022,
          0.4482288018938554,
          0.038649269791372495,
          -0.5665957905895744,
          -0.036416103129564566,
          -0.05320782180715432,
          -0.24974586029132823,
          0.10033570753709029,
          -0.39859981433723823,
          -0.6387679502536769,
          -0.31679021287886966,
          0.48725712848930247,
          -0.5173222625503052,
          0.6761008517071897,
          0.06046933846120022,
          -0.004873948151239945,
          -0.31651423958319774,
          0.2439089013040891,
          -0.5946781533016182,
          0.36524807512668606,
          -0.047374384445985206,
          0.20415532775636783,
          0.22520614631839544,
          0.5556840814421984,
          0.0029525494702043104,
          0.05448715153607421,
          0.5113481345652864,
          0.21076991464412922,
          0.38830589021576295,
          0.15341856802359952,
          0.358365621136134,
          -0.11932839908134829,
          0.0967007085113373,
          -0.43969606754190516,
          0.331847034473902,
          0.3199737645067136,
          -0.09379061974099728,
          0.23747820282051468,
          -0.3574016779786583,
          0.11901637972236012,
          -0.035891409008326214,
          -0.06986610580570128,
          0.13640333005315672,
          0.286414385397457,
          0.18463389638206415,
          -0.758208596467101,
          0.02682133160281637,
          0.08953483418114577,
          0.48952456581415443,
          -0.1518222231426341,
          -0.3819382088359975,
          0.5853631686307317,
          -0.024313412684423708,
          0.5285962981762549,
          -0.22900420949852587,
          0.28478059008390305,
          0.034950717420395926,
          0.1876852750163393,
          -0.48490366357806025,
          0.08209055068752324,
          0.17138220307271693,
          -0.37472262679609103,
          0.3656016547214372,
          0.6517624389668918,
          -1.2847745778146602,
          -0.17517063309830846,
          -0.02094083746242911,
          -0.43869149624668663,
          0.09386306235006692,
          -0.030467088314512777,
          -0.2100504250502582,
          -0.2188320784927893,
          0.3636821153680213,
          0.4021781058740176,
          0.39475856918694074,
          0.4157176245154382,
          -0.21901644383099136,
          0.07392979312400577,
          -0.5992042562479662,
          -0.8946834898057965,
          -0.11703406107181788,
          0.05520307104963369,
          -0.2957290963086594,
          0.289023990222129,
          -0.012125833053208425,
          -0.40762124287860185,
          0.41013489674308495,
          -0.3689502789964361,
          0.3227255425725038,
          -0.8924165908810674,
          -0.0026288747642644428,
          0.08063734516654561,
          -0.43519663426877025,
          -0.3075526828761943,
          0.38868145724460024,
          -0.7192225461197193,
          -0.7891381472728278,
          0.17279376418503029,
          -0.14390850728821653,
          -0.15321598366012765,
          0.538007621434052,
          0.018917996501306784,
          0.44645328698265446,
          0.11617864141820353,
          -0.03323999825633078,
          0.5530686999913466,
          -0.06095404720285675,
          0.07773089468607741,
          -0.4397297159691407,
          -0.17207760777736816,
          -0.6764772961613597,
          -0.28711821844739227,
          -0.023974229916682608,
          0.26155067509030616,
          0.07164041515019061,
          0.22628008125399807,
          -0.22350125620706704,
          0.07341287582523146,
          0.26256719492735886,
          0.47478088814826824,
          0.2938588355296508,
          0.005723601166940049,
          -0.006003867584402024,
          -0.268354150018398,
          -0.5170412295607326,
          0.19665353237353622,
          0.08069294341392318,
          0.626101264684764,
          -0.20099679625838832,
          -0.19597922834311904,
          -0.135547965679078,
          0.14738109299803043,
          -0.522916552780273,
          -0.18565149029123382,
          -0.2722049458327556,
          -0.3255919689634073,
          0.14350123624855768,
          0.33019361527092006,
          0.1444977935990578,
          0.26695511098287567,
          -0.35537548571074884,
          -0.6713916106373905,
          -0.8575674012662294,
          0.16486965528894026,
          0.2342446051146655,
          0.27474574562778153,
          -0.186757893873362,
          0.12678562428500117,
          0.4263498743967669,
          0.4857602850051559,
          0.06170615577717197,
          0.05530565858490761,
          -0.12765912907382737,
          0.23519757779152345,
          0.6627076994522546,
          -0.21797155042892385,
          0.035604608899016,
          -0.18139825401482979,
          0.10419051799053256,
          0.07492432515703472,
          -0.4573649498406218,
          -0.16263142612708148,
          -0.10699216956831069,
          -0.07173466014196504,
          0.35648846428600606,
          -0.5189242212445406,
          -0.29994919888989235,
          -0.1733427223242052,
          -0.28193801465932733,
          0.49241595869485444,
          0.48850425129901004,
          0.18436214523237648,
          -0.30323800377479815,
          0.015397704162261446,
          -0.4968545366078704,
          -0.009262619870541887,
          0.1679947906192317,
          -0.4085054224664863,
          0.04666546237591262,
          -0.5532450311937661,
          -0.5203774205447903,
          0.05470249670873412,
          0.12880497680925618,
          -0.05170891577804469,
          0.33410613834330194,
          0.16919337655537636,
          0.7064080271243163,
          -0.3013337774998387,
          0.5742682754364686,
          0.05639544115662894,
          0.18768319344980633,
          -0.3539713030018468,
          0.014406772776357168,
          -0.28541648929903146,
          0.22018871496675302,
          -0.7853936617478589,
          -0.4971476582551655,
          0.13808066266279484,
          -0.08776390365215697,
          0.0050078596637914835,
          -0.4282527521642588,
          0.3756973754907702,
          -0.1919427496810216,
          0.01154805021335461,
          0.45577401989502564,
          0.02814383833559026,
          -0.03806565730790066,
          0.09858978779870942,
          0.12792215087283432,
          0.08243474763213353,
          0.20403953479710873,
          0.5645631738336411,
          0.3801424117593851,
          -0.18817384640153015,
          0.1699051717906551,
          -0.34523887329407754,
          -0.5899829455834376,
          0.05454690156546167,
          -0.4298455587832276,
          0.25760733640898686,
          0.19664961689596835,
          0.25372003594423104,
          -0.22892266498332997,
          0.09689551495725549,
          -0.054880522178785175,
          0.21585441925531515,
          -0.33497730039939977,
          0.30017596840794764,
          0.5730268638893086,
          0.09462543342844863,
          -0.0876196184294021,
          0.07851925375974675,
          0.1587398342326996,
          0.3459998593213622,
          -0.04095211672711791,
          -0.0735736529193249,
          -0.2087558363537217,
          0.49686386126968884,
          -0.07356002748654612,
          0.40049871731282793,
          0.24677607115165714,
          0.5420208485051131,
          -0.23036057612070593,
          0.2878101336094084,
          0.2421627164619485,
          -0.1902649987752357,
          0.3045615921797803,
          0.4210268673336354,
          0.03284424874807723,
          0.35113443723698384,
          0.1138088173128608,
          -0.8092083759181296,
          0.3731975147499706,
          -0.4465762161044384,
          -0.6712714867987605,
          -0.8946327792720793,
          0.31275476695904797,
          -0.195279632945984,
          0.11224488027089677,
          -0.07951436298479064,
          -1.0733417401409688,
          0.35371507997054513,
          -0.5552880797438045,
          0.5576523417668334,
          -0.4526825785567891,
          -0.031912842768598584,
          -0.8457899148991623,
          -0.7851591492551747,
          -0.5240385583564993,
          -0.1312178853007178,
          0.38517010529877815,
          -0.04825881000217347,
          0.4304589652399231,
          -0.0852831813040296,
          -0.32767616148221873,
          0.3614132433823447,
          -0.006421369813347881,
          -0.4777267137639278,
          -0.6295591274465948,
          -0.6918744189342102,
          0.4155340265272592,
          -0.31897035530344287,
          -0.1170900407086048,
          0.029687431468673628,
          0.2599126091934956,
          0.2968304366798608,
          0.30471684208915006,
          0.3193455102931322,
          -0.3171316607784887,
          -0.08014565715226002,
          -0.22168066956937332,
          0.061931035357971786,
          0.29965021113974716,
          -0.5020702019413807,
          -0.25812687407992235,
          0.11318257642649447,
          0.651048267359498,
          -0.020230884082578632,
          0.055336332590628305,
          -0.47154262637833533,
          -0.5151937647661105,
          0.6637849117790052,
          0.5917822361171003,
          -0.21302016039387428,
          0.2410757657717449,
          0.3534208597177006,
          0.4355901687216603,
          -0.1522139988105102,
          0.06922291949299164,
          -0.061167382718401345,
          -0.1389859261582213,
