{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Relu",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Relu1",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Relu2",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "20",
          "50"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          -0.05589594316914598,
          0.4162930838797089,
          0.19984354291685655,
          0.13006014454372972,
          -0.6045351052317354,
          -0.29387440458309466,
          -1.2499826950390294,
          0.33254204551570254,
          0.41913572422404805,
          0.457240082867332,
          -0.815973127490136,
          0.3061732778431143,
          -0.28309378113921607,
          -0.6332894443385865,
          -0.013238819651619745,
          -0.8076879877659027,
          -0.33294394053565685,
          0.06453140284941895,
          0.032269875596483186,
          -0.22557472986840488,
          0.20836308596621045,
          -0.1454036775763666,
          -0.29481033866361267,
          0.15077368949296513,
          -0.01809571798143389,
          0.1746030996615566,
          -0.6109842056305262,
          -0.053682727594292705,
          0.14270356824447092,
          -0.9445235874790846,
          0.09797564061099821,
          0.08049570049217239,
          -0.46785521654334083,
          0.8274173764504376,
          0.3010496040441245,
          0.03277743127747715,
          0.15103390186561186,
          -0.5194475170068719,
          0.4158861524075312,
          -0.41294449342988765,
          -0.3303032385045039,
          -0.021515438546943415,
          -0.6085360858608787,
          0.3585482622366478,
          -0.45582286934241684,
          -0.0009940585860810651,
          -0.46859280919427193,
          -0.27442203459231723,
          0.18789038379942047,
          -0.5553581180864859,
          0.2763694399244599,
          0.1831178142034561,
          0.3594130148159644,
          0.4216280378389893,
          0.1030291073046387,
          0.35511148707228973,
          -0.398573201175499,
          -0.19227221485168722,
          -0.1228448653323762,
          -0.5318523122102072,
          -0.2941693942634693,
          0.15371149557846553,
          0.28345803108724366,
          -0.024303614378464528,
          -0.045696182504570235,
          0.22530954880713325,
          -0.0576194527153978,
          0.22088688209977264,
          -0.14824777602553035,
          0.804772197618361,
          0.18473452433549936,
          -0.0956082324982083,
          -0.4409125625636766,
          0.08582367045755092,
          0.27958952469091525,
          0.27689590363621136,
          0.31552358103536465,
          -0.22415733856655273,
          -0.006821314922971904,
          -0.3780225934533512,
          0.6236206579944602,
          -0.41231881283495125,
          -0.39690329964164145,
          -0.5163176179588679,
          -0.315518700248659,
          -0.33740687301419103,
          0.1446685289630852,
          -0.24194699279746262,
          1.0433387900605822,
          0.5000650839623961,
          -0.5933690645765729,
          0.049920043762580545,
          -0.11874547081706958,
          -0.06546918797638905,
          0.15615671897065272,
          -0.18868577182529273,
          0.029636616225852463,
          -0.23453713300173476,
          -0.10306337391409248,
          -0.24424306396601012,
          -0.5705503672827976,
          0.007516089129049772,
          -0.11599998428175393,
          0.025878442200931995,
          0.5824949070936251,
          -0.5482747343003492,
          0.010806579951672323,
          0.29933253873764176,
          -0.32384737373235106,
          -0.24965907121287872,
          0.2355961813716045,
          -0.3651541190069994,
          0.008219696756406655,
          0.12309475448263643,
          0.23605890455318038,
          0.5197988806443286,
          0.11490927764489473,
          -0.5467247746091761,
          0.20692540223422182,
          -0.01354158309285537,
          0.5502478903942776,
          0.34975666637431496,
          -0.0975103031415164,
          -1.0326874762233238,
          -0.39338306531048617,
          -0.08199747000510653,
          0.15420991538103312,
          0.8268969899849307,
          -0.6583434460763109,
          0.019019767554969896,
          0.18763660622590736,
          -0.01301322934217707,
          -0.15710172649631507,
          -0.21417722741971534,
          0.054216201874283956,
          -0.1347112405698302,
          -0.06011320701670028,
          0.05034792277345042,
          -0.052925513508312934,
          0.5988757112142543,
          0.865224379932875,
          -0.370539327656639,
          0.28657692421036374,
          -0.24704816959877457,
          -0.10384847632991155,
          -0.7705479179186917,
          0.12222949230138667,
          -0.3738444179070957,
          -0.2486841556166277,
          -0.28185567746811774,
          0.20236906215548572,
          0.688487860519335,
          -0.621138902965198,
          0.028873639488438838,
          0.4577074755241553,
          -0.25747442027927925,
          0.06556839592362049,
          0.2299950966154806,
          -0.38684760602678436,
          0.002208049730069222,
          -0.08765985020298873,
          0.27875982731302024,
          0.306806581599277,
          0.06920079925744158,
          0.14724267228858848,
          0.02648590269357208,
          -0.20338180707637507,
          -0.5290301097080329,
          -0.6031953958960573,
          -0.28162064698835604,
          0.10188012900464744,
          -0.6206107840405122,
          0.2960535670285174,
          -0.20644283180323517,
          -0.5269161551126472,
          -0.44973718264798396,
          0.3032402128237653,
          0.14427532458097103,
          0.4996276133158787,
          -0.1270602638624294,
          -0.16016048622158308,
          -0.8497163076970194,
          0.5442011407288126,
          0.07026239720780388,
          -0.30175119463707134,
          0.33810946188972335,
          0.5329348521394738,
          -0.48973906297710396,
          0.07029187962794509,
          -0.2631863958318466,
          -0.728928298363765,
          0.23207179297102679,
          0.2912590404083749,
          0.02205537996856679,
          -0.18660055234124984,
          -0.23155542433724202,
          -0.17067573481047751,
          0.7194319487067905,
          0.8995265665346563,
          0.6562741653375056,
          0.1476831248215084,
          -0.6097556264623002,
          -0.43582427978024285,
          -0.10432938273292483,
          0.003573889158917676,
          -0.39481184400629293,
          -0.2474946690362658,
          0.384735761231402,
          -0.5765414225654628,
          0.1197051512504776,
          0.10613462656770525,
          0.4287336640068409,
          -1.2156602444141114,
          -0.8194640181085651,
          0.708554717031023,
          -0.5766510646657926,
          -0.09332196681301239,
          0.1532778288253446,
          0.15861973488286082,
          0.4931797773755082,
          0.1576219475062023,
          -0.14923508271458544,
          -0.22471366734683879,
          -0.1335566828562868,
          -0.9568510194212667,
          -0.1716471772449248,
          0.6344954708060385,
          -0.37089223468629295,
          0.3772846418073293,
          0.2749083910066974,
          0.28509970132427453,
          -0.2121476714233853,
          0.19327491689741458,
          -0.18259240684617054,
          0.20562650557737408,
          0.11718611771366895,
          -0.8533712262862767,
          -0.3405502329025135,
          0.5419824777105269,
          0.08473028736735772,
          0.1850376311265656,
          0.46749910963790153,
          0.30172816219011384,
          -0.4101228546075045,
          -0.7767127812155841,
          0.01957978089050361,
          -0.3913572670258182,
          0.4877598790852715,
          0.15230921127906522,
          0.23919749521671863,
          -0.30875637083914065,
          -0.4735218491094386,
          0.518003868988858,
          0.09632646331467475,
          -0.41867548158882223,
          -0.4050758313191622,
          0.23476553964876037,
          0.03398510251787108,
          0.058147828883291904,
          -0.40435792972585083,
          0.35466216434180464,
          0.042432378000330215,
          -0.437881770149739,
          0.0012343876445105794,
          0.3169475191982708,
          0.13094287789658135,
          0.10563691656582502,
          0.053726848508709,
          -0.07534805378499042,
          -0.3633056317065796,
          -0.36645369795686766,
          0.5846783128936472,
          0.43973759963455344,
          0.09130873654440942,
          0.13309407603875764,
          0.09319187988793089,
          0.5734375923721776,
          0.3337268712734415,
          -0.09951819842135233,
          -0.05992243873632235,
          0.37995413932666583,
          0.38265607173103794,
          -0.29875344111327434,
          -0.3021687900702155,
          0.14830231625066098,
          -0.19716505155905997,
          0.05435492584908679,
          -0.1136016372221549,
          -0.15065847338030863,
          0.2294042148378156,
          -0.595208458725361,
          -0.7756338254178439,
          0.09310663321110191,
          -0.4726601577054114,
          -0.7727353320795102,
          -0.008536133906380517,
          0.2289101910167466,
          3.212587363483438e-05,
          0.31010102292093544,
          -0.4232241010985747,
          -0.6390264215013809,
          -0.0620214116451104,
          0.05501312948938388,
          0.2403046197171613,
          0.18937990890445053,
          0.6244834068644971,
          -0.26674154568930847,
          -0.04892856929123317,
          0.3716106120009347,
          -0.34355015523340415,
          -0.548643999821415,
          -0.6649210489867187,
          -0.38345613836760684,
          0.4381714824218682,
          0.25990770177375694,
          0.4634862217653043,
          0.2345157813720125,
          -1.2880211101216263,
          -0.7050843749034992,
          -0.16561162638779567,
          0.04550045574840686,
          -0.011386474178471464,
          0.2933350076558622,
          -0.37729674520283923,
          0.17300542480180667,
          0.3479602971270606,
          -0.2946909682482102,
          0.17558468816625308,
          -0.3348524947610837,
          -0.13704578453859367,
          -0.26607234693989884,
          0.2524020381939187,
          -1.2661013063368178,
          0.0311649958987408,
          -0.6930536631174025,
          -0.06840162825632878,
          0.2606674810128202,
          0.03201253814818073,
          0.05928010520342457,
          -0.37920187876183764,
          -0.29657666489966034,
          0.02230240869731288,
          -0.9750887987939584,
          0.027526897477916343,
          -0.16995326308199663,
          0.12681860458275399,
          0.26713085580389456,
          -1.0104968598023774,
          -0.397991409227209,
          -0.4590373352443679,
          0.04880961639542475,
          0.346306229982055,
          0.47900069416224633,
          -1.1234583331186223,
          -0.5418239552040458,
          -0.14807486302978132,
          -0.2323679790953491,
          -0.22421468009700093,
          0.5444175145877017,
          -0.226903948906612,
          -0.007961248628886471,
          0.07964251681089222,
          0.19965411554791865,
          -0.24974143785567862,
          0.2343409116047449,
          -0.3413015738426699,
          0.3028207582164969,
          0.616166854078332,
          -0.40381154681634074,
          -0.2501026329457572,
          -0.2335889057736909,
          -0.6196789340627396,
          -0.06544319059145054,
          -0.05592107669657223,
          -0.3839496518101265,
          -0.15927843155132543,
          -0.17500892463046633,
          -0.2177340526802663,
          0.23822920424530203,
          -0.2827141925560307,
          -0.056088992340021473,
          0.19199305397197,
          0.5238224498350416,
          -0.14435849219836056,
          0.4554159042113391,
          0.17028297399719583,
          0.13785434918365816,
          -0.6514726521300575,
          0.1312132574592569,
          0.025106829197193797,
          0.5795114669707624,
          0.2565807903892927,
          -0.003981542452912377,
          0.34571571707567694,
          -0.17780771226880573,
          0.3940978705019527,
          0.05267399555564611,
          -0.3568534094790607,
          -0.05987307005124804,
          0.7214596595657325,
          3.971397778869403e-169,
          -1.9794553938680456e-168,
          -5.451602963017205e-212,
          -2.9775812179102616e-179,
          -1.268887586590489e-201,
          3.3854346770800947e-172,
          1.1138635186384802e-207,
          -2.2289454908241878e-158,
          -7.448774239540527e-168,
          -2.342770552776291e-167,
          -4.702776431772758e-200,
          4.740795289820773e-162,
          7.408175429998178e-163,
          2.673639137984605e-210,
          -2.2824938217025534e-205,
          3.66375099588914e-212,
          -1.0351057540508553e-197,
          1.642702371934938e-201,
          9.6448908345482e-202,
          1.0832668973802311e-191,
          -2.773953340104652e-185,
          9.881064624754377e-185,
          -2.1459404215595823e-167,
          1.5783276683224107e-211,
          -3.849527746308051e-163,
          4.773278428538482e-213,
          2.2655565759536134e-211,
          1.8560737327486076e-171,
          2.509739384370441e-205,
          -6.351601060138531e-171,
          -1.1579347405314028e-174,
          5.417389511980178e-189,
          -1.6285027899066592e-206,
          -9.792056671507061e-169,
          -2.6276030915437796e-166,
          -1.6718509287294525e-197,
          6.346010751100168e-165,
          4.264694452405212e-180,
          -2.1201910518804222e-197,
          4.306418470300899e-166,
          -2.1825654648432115e-167,
          -4.535082661312465e-157,
          -3.5182231541665435e-206,
          9.886082651569382e-206,
          8.55031007434259e-182,
          -2.1536892186676088e-162,
          -9.101056146358628e-158,
          1.173018138226059e-190,
          -3.544678079286256e-206,
          -4.19748819642737e-166,
          -8.099642982036885e-187,
          -1.6853090455948811e-211,
          -5.889996723436434e-211,
          -3.7103139894575657e-168,
          2.015025641847565e-170,
          2.7570363396167042e-213,
          4.453910297266989e-157,
          -1.2004701587327638e-216,
          -1.0223134042232777e-162,
          8.369121840850733e-172,
          -2.602616765845672e-171,
          -7.505763960886337e-205,
          -4.1329051822083344e-191,
          4.306397971617832e-211,
          -2.4547815385326806e-160,
          -2.2291279071282617e-207,
          1.2248160967803435e-195,
          2.2593014887257226e-173,
          -1.8453830710556747e-187,
          5.96045453194624e-162,
          8.045188033502544e-157,
          -1.434097153822462e-159,
          6.973628109382741e-162,
          1.17430005280263e-169,
          5.908033001447074e-217,
          -2.953456288939601e-157,
          -4.0858657453861128e-165,
          -6.071094742911235e-212,
          9.32682665049308e-160,
          9.299011222423697e-218,
          -8.212488334977523e-206,
          1.3583764671036682e-198,
          -1.1644317457237566e-213,
          -3.8213760753437146e-206,
          5.132242868400246e-209,
          -4.3410172180506606e-169,
          1.9421856869475035e-161,
          -5.184266628248382e-195,
          2.2166757376593579e-162,
          1.7696136344371995e-170,
          2.1355558560855026e-213,
          1.2209944307270684e-208,
          -8.500601269764786e-196,
          -8.887452187119298e-182,
          1.9704903306368127e-215,
          -2.1095456785056127e-204,
          -1.0959037598964204e-209,
          9.406321951992797e-166,
          1.4197438952944936e-158,
          -2.076715471274198e-157,
          -0.21209406761795777,
          0.4584699274712983,
          -0.17925781336598257,
          0.07989191863322381,
          0.11677297887866794,
          -0.3356970183115413,
          0.09844062194596474,
          0.4984879808406427,
          0.2239272967377174,
          0.0900587171659177,
          0.04373601133087795,
          -0.23313696530625133,
          0.07040288364100145,
          0.12700759535078174,
          -0.44971872247640143,
          -0.09641585647821713,
          -0.5329486742876868,
          -0.14003077673897607,
          0.6041206968252971,
          -0.4593410745826982,
          0.38170194566229937,
          -0.19155646501907025,
          0.5675142617261093,
          0.24405965972397003,
          0.43762770550035357,
          -0.27300114592182234,
          0.23331529850072058,
          0.20686846888952334,
          -0.11331405586629319,
          0.34069623104783914,
          0.4045215468613575,
          0.3193210602573674,
          0.2749957815282933,
          0.08010966087256696,
          0.37426991245301655,
          0.16255872800057056,
          0.1660546755037274,
          -0.5533057453839471,
          -0.15118018932964877,
          -0.02761091014715473,
          0.06890739839829631,
          0.18791132435049074,
          -0.8211808891007101,
          -0.12589938733616732,
          0.08161578607656761,
          0.005869808199226175,
          -0.25642750277111437,
          0.18610509191417485,
          0.3044780285280873,
          0.12992733236463902,
          0.08917757537110299,
          0.38932568941799917,
          -0.120511382005597,
          -0.0518652932169649,
          0.41682818037098646,
          -0.25474814235916754,
          -0.016052926453384887,
          -0.4044135687539794,
          0.2895894567125672,
          0.05728171350688189,
          -0.026505071896844885,
          -0.5649069118252319,
          -0.48652059804594244,
          -0.4163667346921989,
          -0.13860403150307482,
          -0.16016682656523606,
          0.10735167968726927,
          0.24696620332049427,
          0.4177870583803214,
          0.0031693454093883323,
          0.27904902482894745,
          0.526765923618175,
          -0.17970557271631868,
          0.25240803540676093,
          0.30368602030083863,
          0.26663241961584244,
          -0.4520250054058124,
          0.5919738160934916,
          0.35399438130503885,
          -0.12496195220075021,
          -0.17620270976418245,
          0.25865827208855047,
          -0.05611058513302038,
          -0.07625589598397275,
          0.07395195184753135,
          0.20587740583857597,
          0.16348853183179363,
          -0.15659445213079226,
          -0.6050978731287203,
          -0.6361261042792227,
          -0.49560202500959794,
          0.4181255492245477,
          0.047809783590179386,
          -0.024845716197875345,
          0.5367956135818468,
          -0.15080133981649138,
          0.03261308295336718,
          0.3154526905460222,
          -0.1836516054200116,
          -0.03592732149058512,
          -0.39558687599561954,
          -0.06926487414217337,
          0.011379335838794573,
          -0.41434831373152325,
          -0.14863376182837537,
          0.1273875418874816,
          -0.4995825330404606,
          -0.3324954344779858,
          -0.021947639551480637,
          0.09988550610884807,
          -0.4904021439765238,
          0.5883283460375506,
          0.06698567000663788,
          -0.4029997895972071,
          0.154988540703125,
          0.28851722173206973,
          -0.6741098414803947,
          -0.2414753913317551,
          0.22729227533155819,
          -0.1402909891873136,
          -0.3232736874035777,
          -0.4644955626779153,
          0.08581165812510028,
          -0.01243289705148538,
          0.2704460144320936,
          0.27138359389813743,
          -0.33600511154934093,
          0.3959064043807221,
          -0.25921236946534554,
          0.17668046750833835,
          0.08602873495227435,
          0.5323091122980393,
          0.06986846895185182,
          0.14572906804656177,
          -0.385891259896049,
          0.18108401588224815,
          -0.2889878126415555,
          -0.513405580217454,
          0.1557057973113266,
          0.006142565392760623,
          -0.1128720021724673,
          0.06959788138482952,
          -0.3384651027418364,
          -0.20929086355728566,
          -0.3090635621043638,
          0.2097186540384094,
          0.22631990384918715,
          0.352644000740614,
          0.48691269292115413,
          -0.20970970931872226,
          -0.3044656666005273,
          -0.1868242480993197,
          0.2828635890258278,
          0.4824450755087296,
          0.01433387733952659,
          -0.20759957384688082,
          0.06655617295241197,
          0.015640991138547587,
          0.2274092697626226,
          -0.10337434060486801,
          -0.377632513909957,
          0.48149807767233016,
          -0.05072456138771732,
          -0.28467812215995425,
          -0.6362754145047376,
          0.012064006331177407,
          -0.06464212696601915,
          -0.009681488045353221,
          -0.43861678791882747,
          -0.3891951088788606,
          -0.3187426726570705,
          0.18018078245069005,
          -0.5508321580275793,
          0.21905824956794026,
          -0.14606258855135748,
          0.4863624230681303,
          -0.6129689571419831,
          0.22628656848418383,
          0.38920013706919143,
          0.13203462725591555,
          0.22671015877727305,
          0.3470332614440912,
          -0.3408984734299337,
          -0.18523239696661198,
          0.25290978876721876,
          0.20409483379957175,
          0.1285669700066045,
          0.007946739737571597,
          0.22066079857458706,
          -0.47350788936142446,
          -0.21729849996105313,
          -0.012806607108948357,
          0.08252943245965215,
          -0.4991314628478513,
          -0.18505974133992775,
          0.2943155344304004,
          -0.25306182498199015,
          0.19899892974631225,
          0.032611145537508726,
          -0.06826776645396757,
          0.1822643530272462,
          -0.42156975849277273,
          -0.20925597773434818,
          -0.129540662016386,
          -0.5671563646201934,
          0.2642840205851246,
          0.2094461976925835,
          0.2439860753089128,
          -0.11923065581760509,
          0.4520121734188156,
          0.04038995387070012,
          -0.14803159668575971,
          0.13217669432045978,
          -0.3786297778922076,
          -0.43002292319121127,
          0.38865228965417475,
          -0.06403280554279826,
          0.0021037903834626812,
          -0.2199278525639922,
          0.2866683155986065,
          0.20484450600711282,
          -0.010609644880743245,
          -0.39234639566330376,
          -0.23270639208570817,
          0.027793545555590424,
          0.7872292273454256,
          -0.47475749837362724,
          -0.004476224936239046,
          -0.6222777466648783,
          0.049286435742071776,
          -0.2763754283424293,
          -0.2201484325051929,
          0.20346037793781968,
          0.044021560945419536,
          -0.13527804269799107,
          0.5850826415289476,
          -0.0654838822889187,
          0.10618347023809188,
          -0.2580822890404107,
          0.07993372369728208,
          -0.1334585789825363,
          -0.5043956436794665,
          0.5201560131153818,
          0.20767017606101187,
          -0.23366343290403502,
          0.07075528403699076,
          -0.2672132133970393,
          -0.141063685268044,
          0.12387946550871169,
          0.028026899430738994,
          -0.17648444526967086,
          0.3497998617482317,
          0.2568907002467614,
          0.03676450431868118,
          -0.08807504103225708,
          0.1413183358728728,
          0.3283024383771267,
          -0.13644807424251482,
          0.2847719500571215,
          0.12092833187757561,
          -0.3007013046656188,
          0.15842173329871004,
          -0.005726439124437022,
          -0.03388135609163261,
          -0.20760098877903085,
          0.07130937217569693,
          0.3072774559044422,
          0.5934763103330963,
          -0.36549214942945796,
          -0.026839053362587816,
          -0.2802250664521362,
          0.354647261692516,
          -0.299233813976768,
          -0.10417560048589479,
          0.07602954183896159,
          -0.44983793077480644,
          -0.32164277286539694,
          0.26558743619349773,
          0.3226891490175593,
          0.3252003775340341,
          0.12800600116915611,
          0.04558235934100784,
          0.24514145181351327,
          -0.2046341552664952,
          0.0284488115019953,
          0.3432112183846649,
          -0.13024912447678078,
          -0.010523113857634667,
          -0.0559572286507415,
          0.5929204166358492,
          -0.20001824599546733,
          0.1186006217205143,
          0.08086632476676321,
          0.4487101055503865,
          -0.36246116573605475,
          0.6353705902671697,
          0.5054993301765792,
          -0.07595931966219668,
          0.14001249247190306,
          -0.24618397094650352,
          0.3484970091805962,
          -0.44330256191718775,
          0.01614691872176227,
          -0.0036251745786752792,
          0.1582896539768744,
          0.0719405263931766,
          -0.19353929203590983,
          0.4333529728144567,
          -0.032424885341781874,
          -0.32439616090146345,
          0.43746764746073297,
          0.7276681701989013,
          -0.030363347697605226,
          -0.06546852185845958,
          0.2700773360020617,
          0.09201732303381388,
          -0.4232101291702532,
          -0.5287940428894005,
          -0.3971641519413634,
          -0.030672390305591025,
          0.11767261370542322,
          0.14516447047316844,
          -0.11296291113671486,
          -0.00033994884622948586,
          -0.33780066739114833,
          -0.020983236585279532,
          -0.0733086378265065,
          -0.2211034659645239,
          0.3373065188787285,
          -0.15781348165137193,
          -0.10910624898226051,
          0.16466702195097382,
          -0.3346177022529456,
          -0.5859970057018518,
          0.13713051627082093,
          -0.29442740823364466,
          0.35032718646853517,
          -0.7334507064081751,
          0.15701031118636258,
          -0.09356683798138696,
          -0.2563859402090631,
          0.044429233826681576,
          -0.005891034991732794,
          0.3243416300040674,
          -0.1385175877423339,
          -0.030448289141065277,
          -1.466512360548402,
          0.4272213152229086,
          -0.42267398342535145,
          -0.12034851422729444,
          -0.5185721205154731,
          0.12696656134136294,
          -0.14186315274556902,
          0.3126093883798353,
          0.033876086450285836,
          -0.271505983293498,
          -0.19903498640532682,
          0.0990405016019805,
          0.15063011055859418,
          -0.25392902018794905,
          0.3383145294285287,
          -0.045078206784243215,
          0.30812324998802715,
          0.11811629379118073,
          0.2902969802418572,
          0.059474572361884415,
          -1.362926726906404,
          -0.14958638669210347,
          -0.01043884688902751,
          0.2203865882478633,
          -0.08979661743247443,
          -0.8370394096089985,
          -0.12920750937366204,
          -0.13035342620854137,
          -0.36456209560141833,
          -0.2036957278296913,
          0.2554277242612617,
          0.24455947079429657,
          -0.2957998899464339,
          -0.420710790046686,
          -0.18760333721418734,
          0.22695866384164975,
          -0.4626310556555567,
          0.2214733025330911,
          0.389939200881056,
          -0.15981177703544394,
          0.23841303392709437,
          -0.12644314528442038,
          -0.6290263551993883,
          -0.21933446278907745,
          0.24395425922566613,
          0.47095815243397027,
          0.17579413045306666,
          -0.09464006857741876,
          0.4356910474912901,
          -0.8632243395704942,
          -0.42103871027408635,
          0.4670274164885136,
          -1.2273484841856326,
          -0.02249389189881203,
          -0.610503641650803,
          -0.528562267032741,
          -0.2090066815059292,
          0.2825344378293561,
          -0.5244818249240002,
          0.21075828375316558,
          0.6746312711719865,
          -0.48764912982316083,
          -0.038970238827250626,
          0.5279158788580416,
          -0.07820874865997325,
          -0.019634514456675713,
          -0.12329928515558496,
          0.17567281958390213,
          -0.12068551271092216,
          0.034584501368817105,
          0.001900438397407894,
          0.4069949184672645,
          0.18706877890708384,
          -0.08843766864900339,
          0.36007740146578177,
          0.011305579709039415,
          0.44056234472821704,
          0.16779962734441817,
          -0.12584762035994385,
          -0.7322358728517844,
          -0.031632000208078916,
          -0.02788581520361881,
          -0.23741064289595487,
          -0.3003297205517402,
          -0.41017897255066366,
          0.3627995156137182,
          0.3195240872626133,
          -0.13828648477509833,
          -0.1877092759658905,
          -0.9779036375998709,
          -0.7136194009569812,
          0.45436190305703666,
          -0.26451249864618276,
          0.008109606507119288,
          -0.41569143861327607,
          0.5107539345246122,
          0.0713339306406911,
          0.25957436672852,
          -0.4039376167294925,
          -0.7676433099680886,
          -0.4488988135788795,
          0.02621359249699976,
          0.5239483270661534,
          -0.07378844660995762,
          -0.21583540081380423,
          0.03159376826647811,
          -0.4173834813488,
          0.024695769400460067,
          0.1289881447607673,
          -0.17172682823127416,
          -0.10622531688080772,
          -0.34841806925273033,
          -0.4464896730035486,
          -0.2136847864737278,
          -0.18472428514415806,
          0.06719679803949959,
          0.09597600003057934,
          -0.04972101751147668,
          -0.3346936492674832,
          0.18465391546975327,
          0.3425589387959525,
          0.26637722045004175,
          0.004733418550436372,
          -0.347455125146693,
          0.4707754584375806,
          0.46830237322430157,
          -0.010347369914022075,
          -0.17327328705498257,
          -0.8317091983221521,
          -0.5301873393511627,
          0.43368829686194826,
          -0.5065035757727937,
          0.20539545279428617,
          0.19313939056925494,
          -0.24017752733404127,
          -0.10926073094824824,
          -0.16712125685424722,
          -0.7230527304238666,
          0.38481837319104567,
          0.0204743929241974,
          0.508461092499094,
          0.10384810724908916,
          -0.41096785547662057,
          0.7539416097472955,
          0.17628322059120255,
          0.28080247534103653,
          -0.04280189603867417,
          0.3903949948511138,
          0.03758750733674284,
          -0.4281905062239575,
          0.1424536817638923,
          -0.23290348444719172,
          0.6822908784640721,
          -0.03439257411915879
        ]
      },
      {
        "dims": [
          "1",
          "50"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -0.544643307159473,
          0.08978863164224497,
          0.20632608039959627,
          0.15665140456956345,
          0.5165068249819642,
          0.33637013618135353,
          0.17306356326850783,
          0.22923876339298543,
          -0.31096943230304447,
          0.030002069152323,
          0.18572950792505397,
          0.4505266989395221,
          0.09285160076590004,
          -0.2216571326223247,
          0.03735880295617964,
          0.38167863281374576,
          -0.3576903145805358,
          0.12560280034218396,
          0.5055890369501927,
          -0.23088045163489715,
          0.3778688019600284,
          -0.015325873806709477,
          0.43806601850942223,
          0.4675930083733497,
          0.23294301682404808,
          -0.1013685072460672,
          0.07060103031772781,
          0.14800026276062328,
          -0.1513039427103678,
          0.2559871824139633,
          -0.48067366651342697,
          -0.198635302948642,
          -0.041458459660584576,
          -0.33187128719291675,
          -0.3148906979323912,
          0.30319060756580934,
          -0.34387575558420697,
          0.2763075403420062,
          -0.490996888483199,
          0.03487005892105028,
          0.1847688663944543,
          0.247472153679901,
          -0.2432373159805436,
          0.16762363091340593,
          -0.10476242806721202,
          0.12755326177034326,
          0.015541478459394638,
          -0.5489675418385298,
          0.41762802386370057,
          -0.319388294908669
        ]
      },
      {
        "dims": [
          "50",
          "25"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          0.5985629118980392,
          0.3617083345328511,
          0.6410450708293052,
          0.248914176067846,
          0.8632136584411761,
          -0.1845667089437446,
          0.30447985595530597,
          -0.0022835603906815726,
          0.18902257489580604,
          -0.25302003550966506,
          0.6038303471437942,
          0.7118689172151456,
          -0.05085126154440392,
          -0.306627969759955,
          -0.8671619300416441,
          -0.29988122386497373,
          -0.6972992473028143,
          0.12661663388604927,
          0.010070685906819924,
          -0.09900499075186966,
          0.00017674236060486956,
          0.403302350702296,
          -0.3004600483206766,
          -0.2885699643754537,
          0.022987393893652498,
          0.3631540663979467,
          -0.04231447232937489,
          -0.3575885743397424,
          0.0644601699751531,
          0.36237607557921414,
          0.28883105809345394,
          -0.47331561787946946,
          -0.09331735970952658,
          0.39992626319000746,
          -0.382225563862518,
          0.16539454220219443,
          -0.06649082641683925,
          0.14667724934037896,
          0.3994372902820529,
          -0.12675611486525354,
          0.8241844930029567,
          0.2696096476550597,
          0.3065840918362604,
          0.20533043943484303,
          -0.17780695201004998,
          -0.3132737741580317,
          -0.18857709876225714,
          -0.2499061835480114,
          0.5278613153681938,
          -0.2698823153574664,
          -0.6170823614368877,
          0.3772147397334888,
          0.2718739761589,
          0.12380955671742207,
          0.0926884537733431,
          -0.3535580817943963,
          -0.20759467542277185,
          0.2470791664116797,
          0.26333870534990406,
          0.07354982970326378,
          -0.007938248265556279,
          -0.7595776404101613,
          -0.41991457380818165,
          -0.027654274727864834,
          0.2622273455964099,
          -0.1141108161251734,
          -0.14981686354207427,
          0.25343582144793314,
          -0.32187009001964284,
          -0.6805134621976845,
          0.35773010587911536,
          0.5690463034101536,
          0.10830738501129919,
          0.005087951342223269,
          0.3440880981536041,
          0.2765649021251951,
          -0.6269740735182546,
          0.16401228195501172,
          0.24626830190695723,
          -0.29317660796356215,
          0.008775573591751741,
          0.30247143407798305,
          -0.4927142645544991,
          -0.2170887590318641,
          0.5384003225901481,
          -0.32786588161662733,
          0.7037278594387804,
          0.0004656537005608484,
          -0.09522365656529543,
          -0.025457202778989982,
          0.2286005102245772,
          -0.35773683143577484,
          0.3524466563280527,
          -0.060006222453155,
          -0.10357237165544364,
          0.22134233326370237,
          0.5225329043574941,
          0.03527356289088413,
          -0.17060059606995553,
          0.4727533732295267,
          0.08500931343917943,
          0.18214304957200145,
          0.3253471986135669,
          0.15183922684254264,
          -0.09056804713933961,
          0.04968368713945339,
          -0.5947035522377552,
          0.40958421373168963,
          0.36278925275935353,
          -0.24445424155024537,
          0.5025709791819849,
          -0.30715676746024567,
          -0.24483196754279885,
          0.17434885004748313,
          0.061207058667211926,
          0.4109024068395546,
          -0.12942323260238653,
          0.3144425480340377,
          -0.507680723966608,
          0.24322495815148268,
          0.08436844952639062,
          0.8591971117992544,
          -0.9165787279890597,
          -0.3434641775287023,
          0.38044226130695896,
          -0.0007468910774021583,
          0.222625366910889,
          -0.18952892849954514,
          -0.12767327310171553,
          0.25173856336889944,
          0.31674535721469077,
          -0.12269342063977648,
          -0.09565781953225756,
          0.2107409330109158,
          -1.1390280398256036,
          0.07151709243127674,
          0.2821637557843596,
          -0.6341254533148517,
          -0.18572125092775946,
          -0.21397681534918025,
          -0.48308982861926636,
          0.24935310876527947,
          -0.08166978353148223,
          -0.08654334825042347,
          -0.3744061196555936,
          0.13472401209191046,
          -0.052096060507412625,
          0.5495327688225636,
          0.5986259803979699,
          -0.3027234650063768,
          0.27052610282708506,
          -0.6400893964639545,
          -1.0146663284044044,
          -0.4424876695087773,
          0.21230608683134028,
          0.5117358718987555,
          0.05080513243461758,
          -0.15298711181119543,
          -0.9078515924323017,
          0.4607384660804867,
          -0.26804921923918484,
          0.09351322029216963,
          -0.13834140702398526,
          0.020252117801302004,
          0.10094786783323675,
          -0.1847067991674701,
          -0.48791819293974276,
          0.13843701229322428,
          0.4896140386255968,
          -0.37273025930662357,
          0.3483912166567593,
          0.031826053859256825,
          -0.09274381763431046,
          0.27928008105683044,
          0.09180163606701028,
          0.2471083635837529,
          -0.1856237973512316,
          0.07263532146981269,
          0.61641068815024,
          0.12409627932938913,
          0.31124931912316844,
          -0.26308390355822797,
          -0.36158421977234,
          -0.5765524327338422,
          -0.0032547864159960804,
          -0.3862446848437165,
          0.20499133102385841,
          0.0429127050110442,
          -0.19132548289024545,
          -0.36223048354114373,
          0.4727041748675972,
          0.019547919543000336,
          0.47387939816929237,
          0.21754872852466522,
          0.30037939797643437,
          0.1388116634803029,
          -0.5960929167748771,
          0.15480026196482952,
          0.5893859572611949,
          -0.049141002302792,
          0.253216276840627,
          0.2082526860209922,
          0.08731247517946468,
          -0.613242004119577,
          0.2600131845623453,
          0.19650983860418786,
          0.06702169324257677,
          0.017499505485603393,
          -0.2795254074984017,
          0.35048183514088876,
          -0.10293431791215023,
          0.0899554027353762,
          -0.25291764228754865,
          -0.0747526047414111,
          -0.43561618622390236,
          -0.6225864030542533,
          -0.23891268564571008,
          0.12158500627965041,
          0.35078176708473796,
          -1.5301069648145584,
          0.10344004404006651,
          0.16124987946477626,
          0.12208528820045478,
          -0.23265938829058216,
          -0.017096766311341563,
          -0.26219476291786525,
          -0.04121893477451713,
          0.27951526700209006,
          -0.21941336370822018,
          0.05554225282265876,
          0.31535733918524783,
          0.31525814753153014,
          -0.19971471661216922,
          -0.4877094176829679,
          0.03506271432616019,
          -0.4800335708299616,
          0.24417854396518598,
          0.1555384165785824,
          -0.845004875518522,
          -0.13479587645276558,
          -0.46702305269134686,
          0.11856646958887222,
          0.3687212945984112,
          0.22037610309412206,
          0.06230997637306922,
          -0.314302705427624,
          0.11201787217173695,
          -0.10924416007959245,
          0.47915902620807793,
          -0.009450210149509352,
          -0.49708854522899454,
          0.593811164264341,
          -0.8233372530477542,
          -0.3537949325419915,
          -0.07620776604428091,
          0.08423354822900368,
          0.08250190785591222,
          0.5005503264012121,
          0.25924124777129426,
          0.4009753306846182,
          0.1884729019001073,
          0.0290310005732037,
          0.17382573100725082,
          0.5838619965975208,
          0.0400068348334539,
          0.11148435091911582,
          0.10659398477954367,
          0.16629048990546055,
          -0.5127725168767385,
          -0.2882608027272181,
          -0.6550451860610421,
          0.13602028756392257,
          0.2556465176846327,
          -0.27666886494675713,
          0.4502382472544583,
          0.1615829222309259,
          -1.1053750983495516,
          0.04163449472161102,
          -0.1788505390036089,
          0.2095020700218831,
          0.27222658202719086,
          0.34260067998300797,
          0.015991936868770543,
          0.1445065405932021,
          0.48076630565100426,
          -0.1487239155248551,
          -0.006842745141299692,
          0.2623094786895555,
          -0.6640843943059231,
          -0.5095501413432332,
          -0.4603107718744175,
          0.09345859728084928,
          0.043672199428244046,
          0.198255595826163,
          0.3055449407620992,
          0.1216309218592596,
          0.035951421084721234,
          0.5114300846638309,
          0.45260849709993956,
          -0.31063682716676794,
          0.5655626136629197,
          0.24015901051222913,
          -0.16472485947694127,
          0.5669714922060505,
          -0.09484995454685409,
          0.40668995187363505,
          0.2181902236450615,
          0.011153752502517036,
          -0.047973341202896376,
          -0.4094239911407466,
          0.3272377414500513,
          -0.524299157790197,
          0.09737128724501667,
          -0.059090823501505435,
          0.7134821062890542,
          0.1873939176352039,
          0.31385080112815844,
          0.22271637476981862,
          -0.05838103429892557,
          0.05577717962658164,
          0.22714936136372588,
          -0.2979615794423228,
          0.29620522260661336,
          0.004337606703406557,
          -0.27797137138652794,
          0.497728586700002,
          0.09522098296105953,
          -0.14506324259876885,
          -0.3037092716523449,
          0.32674863302335916,
          0.15157174778811022,
          -0.30603781332719004,
          0.33499554308534624,
          -1.1621625497136625,
          0.22639324723509882,
          -0.8595628864163171,
          0.3062021911103191,
          -0.22852980119143668,
          0.167540894974429,
          -0.24111789961467975,
          -0.4116134191326001,
          -0.18620817474634185,
          -0.26486556564298486,
          -0.6303026904198542,
          -0.24329640825656168,
          -0.31048753725223255,
          -0.2743460615870742,
          0.031002902176895716,
          0.2858397409916273,
          0.2461909760850407,
          0.020365936011124495,
          0.30291152525358833,
          -0.43941038442901675,
          0.2976759830260147,
          -0.0025609353351522036,
          0.3398869605383948,
          0.10311181876199213,
          0.47961744392541567,
          0.16991870670952738,
          0.05315971816696965,
          -0.5037385943444199,
          -0.3937658251714169,
          -0.20000485808426333,
          -1.141423609235527,
          0.4515950599318004,
          0.2991808521255985,
          -0.003577753510248455,
          -0.4267312022212468,
          0.11075014594805797,
          0.5592713722972081,
          -0.3282366784248742,
          0.3002638907832295,
          -0.2839809154779616,
          -0.3875667698797472,
          0.690064532475833,
          0.21780197234455267,
          -0.5110134572160661,
          0.08394014742852828,
          0.00890280327777425,
          0.4901007378093186,
          0.13122116030727313,
          -0.2790419636840527,
          -0.029219768282930814,
          0.12752255893777192,
